
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("ПодарочныйСертификат", Элементы.НайденныеподарочныеСертификаты.ТекущиеДанные.ПодарочныйСертификат);
	СтруктураЗакрытия.Вставить("НомерСертификата", Элементы.НайденныеподарочныеСертификаты.ТекущиеДанные.НомерСертификата);
	СтруктураЗакрытия.Вставить("Остаток", Элементы.НайденныеподарочныеСертификаты.ТекущиеДанные.Остаток);
	
	Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура НайденныеподарочныеСертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("ПодарочныйСертификат", Элементы.НайденныеподарочныеСертификаты.ТекущиеДанные.ПодарочныйСертификат);
	СтруктураЗакрытия.Вставить("НомерСертификата", Элементы.НайденныеподарочныеСертификаты.ТекущиеДанные.НомерСертификата);
	СтруктураЗакрытия.Вставить("Остаток", Элементы.НайденныеподарочныеСертификаты.ТекущиеДанные.Остаток);
	
	Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Адрес") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаСертификатов = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	НайденныеПодарочныеСертификаты.Загрузить(ТаблицаСертификатов);
	
КонецПроцедуры