
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Вставить("Теги", НСТР("ru = 'Зарплата'"));
	НастройкиВариантов["Основной"].Вставить("ИмяМакетаОбразца", "ОбразецОсновной");
	
	НастройкиВариантов["Основной"].Вставить("Рекомендуемый", Истина);
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли