
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") И ТипЗнч(Параметры.Отбор.Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		Номенклатура = Параметры.Отбор.Владелец;
		Если Номенклатура.ЭтоНабор Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Единицы измерения недоступны для наборов'");
			Элементы.Список.ТолькоПросмотр = Истина;
			Элементы.ГруппаКопирование.Доступность = Ложь;
		ИначеЕсли Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Единицы измерения недоступны для подарочных сертификатов'");
			Элементы.Список.ТолькоПросмотр = Истина;
			Элементы.ГруппаКопирование.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаКопирование.Видимость = ЗначениеЗаполнено(Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КопированиеЕдиницИзмерения" И ЗначениеЗаполнено(Номенклатура) И Параметр=Номенклатура Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьОт(Команда)
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Номенклатура", Номенклатура);
	СтруктураОткрытия.Вставить("КопироватьЕдиницыИзмерения", Истина);
	СтруктураОткрытия.Вставить("КопироватьИзВыбранных", Истина);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаКопированияСвязаннойИнформации", СтруктураОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДругим(Команда)
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Номенклатура", Номенклатура);
	СтруктураОткрытия.Вставить("КопироватьЕдиницыИзмерения", Истина);
	СтруктураОткрытия.Вставить("КопироватьИзВыбранных", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаКопированияСвязаннойИнформации", СтруктураОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
 
