#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПриходныйОрдер, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПриходныйОрдерЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриходныйОрдерЗапасы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ПриходныйОрдерЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА &УчетПоЯчейкам
	|			ТОГДА ПриходныйОрдерЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ячейка,
	|	ПриходныйОрдерЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПриходныйОрдерЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПриходныйОрдерЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПриходныйОрдерЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПриходныйОрдерЗапасы.Количество
	|		ИНАЧЕ ПриходныйОрдерЗапасы.Количество * ПриходныйОрдерЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдер.Запасы КАК ПриходныйОрдерЗапасы
	|ГДЕ
	|	ПриходныйОрдерЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Ссылка.Дата КАК ДатаСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Приход) КАК Операция,
	|	ТаблицаСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	&Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ссылка.Ячейка КАК Ячейка,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдер.Запасы КАК ТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдер.СерийныеНомера КАК ТаблицаСерийныеНомера
	|		ПО ТаблицаЗапасы.Ссылка = ТаблицаСерийныеНомера.Ссылка
	|			И ТаблицаЗапасы.КлючСвязи = ТаблицаСерийныеНомера.КлючСвязи
	|ГДЕ
	|	ТаблицаСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И ТаблицаЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриходныйОрдер);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСклады", МассивРезультатов[0].Выгрузить());
	
	// Серийные номера
	РезультатЗапроса1 = МассивРезультатов[1].Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса1);
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", РезультатЗапроса1);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
	КонецЕсли; 
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаПриходныйОрдер, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаПриходныйОрдер, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Не УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение", "ДвиженияЗапасыИзменение"
	// содержат записи, необходимо выполнить контроль реализации товаров.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Ячейка) КАК ЯчейкаПредставление,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
		|					ИЗ
		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
		|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Отрицательный остаток запасов на складе.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ДокументОбъектПриходныйОрдер = ДокументСсылкаПриходныйОрдер.ПолучитьОбъект();
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектПриходныйОрдер, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ВыполнитьКонтроль()

#Область ИнтерфейсПечати

Функция ОписатьПравилаЗаполненияПодписей() Экспорт
	
	РеквизитыОбъекта = Новый Соответствие;
	
	РеквизитыОбъекта.Вставить("ПодписьРуководителя", "Организация.ПодписьРуководителя");
	РеквизитыОбъекта.Вставить("ПодписьКладовщика", "СтруктурнаяЕдиница.ПодписьМОЛ");
	РеквизитыОбъекта.Вставить("Комиссия", "ЭтоКомиссия");
	
	Возврат РеквизитыОбъекта;
	
КонецФункции

Функция ДанныеБланкаТоварногоНаполнения(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходныйОрдер.Ссылка КАК Ссылка
	|	,""Приходный ордер"" КАК ПредставлениеРегистратора
	|	,ПриходныйОрдер.Дата КАК ДатаДокумента
	|	,ПриходныйОрдер.СтруктурнаяЕдиница КАК ПредставлениеСклада
	|	,ПриходныйОрдер.Номер
	|	,ПриходныйОрдер.Ячейка КАК ПредставлениеЯчейки
	|	,ПриходныйОрдер.Организация.Префикс КАК Префикс
	|	,""Запасы"" КАК ТипНоменклатурыТаблицы
	|	,ПриходныйОрдер.Запасы.(
	|		НомерСтроки КАК НомерСтроки
	|		,Номенклатура.Склад КАК Склад
	|		,Номенклатура.Ячейка КАК Ячейка
	|		,Неопределено КАК Содержание
	|		,Выбор когда Выразить(ПриходныйОрдер.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100)) = """"
	|			Тогда ПриходныйОрдер.Запасы.Номенклатура.Наименование
	|			Иначе ПриходныйОрдер.Запасы.Номенклатура.НаименованиеПолное Конец КАК ПредставлениеНоменклатуры
	|		,Номенклатура.Артикул КАК Артикул
	|		,Номенклатура.Код КАК Код
	|		,ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения
	|		,Количество КАК Количество
	|		,Характеристика
	|		,Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|		,КлючСвязи
	|	) КАК ТаблицаЗапасы
	|	,ПриходныйОрдер.СерийныеНомера.(
	|		СерийныйНомер,
	|		КлючСвязи
	|	) КАК ТаблицаСерийныеНомера
	|Из Документ.ПриходныйОрдер КАК ПриходныйОрдер
	|Где ПриходныйОрдер.Ссылка В(&МассивОбъектов)
	|Упорядочить по НомерСтроки";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
	ПараметрыНоменклатуры = Новый Структура;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПриходныйОрдер";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ПриходныйОрдер" Тогда
		
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст = 
			"Выбрать
			|	ПриходныйОрдер.Дата КАК ДатаДокумента
			|	,ПриходныйОрдер.Номер
			|	,ПриходныйОрдер.Организация КАК Организация
			|	,ПриходныйОрдер.Организация.Префикс КАК Префикс
			|	,ПриходныйОрдер.ПодписьКладовщика.Должность КАК ДолжностьКладовщика
			|	,ПриходныйОрдер.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика
			|
			|	,ПриходныйОрдер.Запасы.(
			|		НомерСтроки КАК НомерСтроки
			|		,Номенклатура.НаименованиеПолное КАК Запас
			|		,Номенклатура.Код КАК Код
			|		,Номенклатура.Артикул КАК Артикул
			|		,ЕдиницаИзмерения КАК ЕдиницаХранения
			|		,Количество КАК Количество
			|		,Характеристика
			|		,КлючСвязи
			|	)
			|
			|	,ПриходныйОрдер.СерийныеНомера.(
			|		ПРЕДСТАВЛЕНИЕ(ПриходныйОрдер.СерийныеНомера.СерийныйНомер) КАК СерийныйНомер
			|		,КлючСвязи
			|	)
			|Из Документ.ПриходныйОрдер КАК ПриходныйОрдер
			|Где ПриходныйОрдер.Ссылка = &ТекущийДокумент
			|Упорядочить по НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйОрдер_ПриходныйОрдер";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриходныйОрдер.ПФ_MXL_ПриходныйОрдер");
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, ,);
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = "Приходный ордер № "
				+ НомерДокумента
				+ " от "
				+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Количество = 0;
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				
				СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ВыборкаСтрокЗапасы.КлючСвязи);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, 
					ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул, СтрокаСерийныеНомера);
				
				ПараметрыНоменклатуры.Очистить();
				ПараметрыНоменклатуры.Вставить("Код", ВыборкаСтрокЗапасы.Код);
				ПараметрыНоменклатуры.Вставить("Артикул", ВыборкаСтрокЗапасы.Артикул);
				ОбластьМакета.Параметры.ПредставлениеКодаНоменклатуры = ПечатьДокументовУНФ.ПредставлениеКодаНоменклатуры(ПараметрыНоменклатуры);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество = Количество + 1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "М4" Тогда
		
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриходныйОрдер.Дата КАК ДатаДокумента,
			|	ПриходныйОрдер.Организация КАК Организация,
			|	ПриходныйОрдер.СтруктурнаяЕдиница.Наименование КАК СкладНаименование,
			|	ПриходныйОрдер.Номер,
			|	ПриходныйОрдер.Организация.Префикс КАК Префикс,
			|	ПриходныйОрдер.ПодписьКладовщика.Должность КАК ДолжностьКладовщика,
			|	ПриходныйОрдер.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
			|	ПриходныйОрдер.ПодписьСдающегоЗапасы.Должность КАК ДолжностьСдал,
			|	ПриходныйОрдер.ПодписьСдающегоЗапасы.РасшифровкаПодписи КАК РасшифровкаПодписиСдал,
			|	ПриходныйОрдер.Запасы.(
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура.НаименованиеПолное КАК Запас,
			|		Номенклатура.Код КАК Код,
			|		Номенклатура.Артикул КАК Артикул,
			|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|		Количество КАК Количество,
			|		Характеристика,
			|		ЕдиницаИзмерения.Код
			|	)
			|ИЗ
			|	Документ.ПриходныйОрдер КАК ПриходныйОрдер
			|ГДЕ
			|	ПриходныйОрдер.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйОрдер_М4";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриходныйОрдер.ПФ_MXL_М4");
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, ,);
			
			ОбластьМакетаШапка              = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакетаЗаголовокДокумента = Макет.ПолучитьОбласть("ЗаголовокДокумента");
			ОбластьМакетаЗаголовокТаблицы   = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ОбластьМакетаСтрока             = Макет.ПолучитьОбласть("Строка");
			ОбластьМакетаПодвалСтрок        = Макет.ПолучитьОбласть("ПодвалСтрок");
			ОбластьМакетаИтого              = Макет.ПолучитьОбласть("Итого");
			ОбластьМакетаПодвал             = Макет.ПолучитьОбласть("Подвал");
			
			// Выводим общие реквизиты шапки
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
			ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.НомерДокумента           = НомерДокумента;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
			
			// Выводим заголовок докмента
			ОбластьМакетаЗаголовокДокумента.Параметры.Заполнить(Шапка);
			ОбластьМакетаЗаголовокДокумента.Параметры.ДатаСоставления = Шапка.ДатаДокумента;
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокДокумента);
			
			// Выводим заголовок таблицы
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			
			// Инициализация итогов в документе
			ИтогоКоличествоПринято = 0;
			Ном                    = 0;
			
			// Инициализация счетчиков страниц и строк
			НомерСтраницы   = 1;
			НомерСтроки     = 0;
			КоличествоСтрок = Шапка.Запасы.Выгрузить().Количество();
			
			// Выводим многострочную часть докмента
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				НомерСтроки = НомерСтроки + 1;
				ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				ОбластьМакетаСтрока.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул);
				
				ПараметрыНоменклатуры.Очистить();
				ПараметрыНоменклатуры.Вставить("Код", ВыборкаСтрокЗапасы.Код);
				ПараметрыНоменклатуры.Вставить("Артикул", ВыборкаСтрокЗапасы.Артикул);
				ОбластьМакетаСтрока.Параметры.ПредставлениеКодаНоменклатуры = ПечатьДокументовУНФ.ПредставлениеКодаНоменклатуры(ПараметрыНоменклатуры);
				
				// Проверим вывод
				СтрокаСПодвалом = Новый Массив;
				Если НомерСтроки = 1 Тогда
					СтрокаСПодвалом.Добавить(ОбластьМакетаЗаголовокТаблицы); // если первая строка, то должен
				КонецЕсли;                                                   // помещаться заголовок
				
				СтрокаСПодвалом.Добавить(ОбластьМакетаСтрока);
				Если НомерСтроки = КоличествоСтрок Тогда           // если последняя строка, должен
					СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);  // помещаться и подвал документа
					СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
				Иначе                                              // иначе - только подвал строк
					СтрокаСПодвалом.Добавить(ОбластьМакетаПодвалСтрок);
				КонецЕсли;
				
				Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
					
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					// Выведем заголовок таблицы
					НомерСтраницы = НомерСтраницы + 1;
					ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
					ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
				ИтогоКоличествоПринято = ИтогоКоличествоПринято + ВыборкаСтрокЗапасы.Количество;
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ОбластьМакетаИтого.Параметры.ИтогоКоличествоПринято = ИтогоКоличествоПринято;
			ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
			
			// Выводим итоги по документу
			ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакетаПодвал.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
			
		ИначеЕсли ИмяМакета = "ТОРГ4" Тогда
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриходныйОрдер.Дата КАК ДатаДокумента,
			|	ПриходныйОрдер.Организация КАК Организация,
			|	ПриходныйОрдер.СтруктурнаяЕдиница.Наименование КАК СкладНаименование,
			|	ПриходныйОрдер.Номер,
			|	ПриходныйОрдер.Организация.Префикс КАК Префикс,
			|	ПриходныйОрдер.ПодписьРуководителя.Должность КАК ДолжностьРуководителя,
			|	ПриходныйОрдер.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя,
			|	ПриходныйОрдер.ПодписьКладовщика.Должность КАК ДолжностьКладовщика,
			|	ПриходныйОрдер.ПодписьКладовщика.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщика,
			|	ПриходныйОрдер.Запасы.(
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура.НаименованиеПолное КАК Запас,
			|		Номенклатура.Артикул КАК Артикул,
			|		Номенклатура.Код КАК Код,
			|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
			|		ВЫБОР
			|			КОГДА ПриходныйОрдер.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|				ТОГДА ПриходныйОрдер.Запасы.ЕдиницаИзмерения.Коэффициент
			|			ИНАЧЕ 1
			|		КОНЕЦ КАК КоличествоВОдномМесте,
			|		ВЫБОР
			|			КОГДА ПриходныйОрдер.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|				ТОГДА ПриходныйОрдер.Запасы.Количество * ПриходныйОрдер.Запасы.ЕдиницаИзмерения.Коэффициент
			|			ИНАЧЕ ПриходныйОрдер.Запасы.Количество
			|		КОНЕЦ КАК КоличествоШтук,
			|		Количество КАК Количество,
			|		Характеристика
			|	),
			|	ПриходныйОрдер.Комиссия.ПодписиКомиссии.(
			|		ПодписьЧленаКомиссии.Должность КАК Должность,
			|		ПодписьЧленаКомиссии.РасшифровкаПодписи КАК РасшифровкаПодписи
			|	) КАК ПодписиКомиссии
			|ИЗ
			|	Документ.ПриходныйОрдер КАК ПриходныйОрдер
			|ГДЕ
			|	ПриходныйОрдер.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			ВыборкаКомиссия = Шапка.ПодписиКомиссии.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйОрдер_ТОРГ4";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриходныйОрдер.ПФ_MXL_ТОРГ4");
			
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, ,);
			
			ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
			ОбластьМакетаВсего = Макет.ПолучитьОбласть("Всего");
			ОбластьМакетаШапкаКомиссии = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ШапкаКомиссия", "", Ошибки);
			ОбластьМакетаЧленКомиссии = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ЧленКомиссии", "", Ошибки);
			ОбластьМакетаПодписьКладовщика = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ПодписьКладовщика", "", Ошибки);
			
			
			// Выводим общие реквизиты шапки
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
			ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ОбластьМакетаШапка.Параметры.НомерДокумента           = НомерДокумента;
			ОбластьМакетаШапка.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
			
			// Инициализация счетчика страниц
			НомерСтраницы = 1;
			
			// Инициализация счетчика строк
			НомерСтроки     = 0;
			КоличествоСтрок = Шапка.Запасы.Выгрузить().Количество();
			
			// инициализация итогов по странице
			ИтогоШтукПоСтранице     = 0;
			ИтогоПоСтранице        	= 0;
			
			// инициализация итогов по документу
			ИтогоШтук        = 0;
			Итого	         = 0;
			Ном              = 0;
			
			// Выводим многострочную часть докмента
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				
				ОбластьМакетаСтрока.Параметры.ЗапасНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул);
				
				ПараметрыНоменклатуры.Очистить();
				ПараметрыНоменклатуры.Вставить("Код", ВыборкаСтрокЗапасы.Код);
				ПараметрыНоменклатуры.Вставить("Артикул", ВыборкаСтрокЗапасы.Артикул);
				ОбластьМакетаСтрока.Параметры.ПредставлениеКодаНоменклатуры = ПечатьДокументовУНФ.ПредставлениеКодаНоменклатуры(ПараметрыНоменклатуры);
				
				// Проверим вывод
				СтрокаСПодвалом = Новый Массив;
				Если НомерСтроки = 1 Тогда
					
					СтрокаСПодвалом.Добавить(ОбластьМакетаЗаголовокТаблицы);
					
				КонецЕсли;
				
				СтрокаСПодвалом.Добавить(ОбластьМакетаСтрока);
				СтрокаСПодвалом.Добавить(ОбластьМакетаИтогоПоСтранице);
				
				Если НомерСтроки = КоличествоСтрок Тогда
					
					СтрокаСПодвалом.Добавить(ОбластьМакетаВсего);
					Если ОбластьМакетаШапкаКомиссии <> Неопределено Тогда
						
						СтрокаСПодвалом.Добавить(ОбластьМакетаШапкаКомиссии);
						
					КонецЕсли;
					
					Если ОбластьМакетаЧленКомиссии <> Неопределено Тогда
						
						СтрокаСПодвалом.Добавить(ОбластьМакетаЧленКомиссии);
						СтрокаСПодвалом.Добавить(ОбластьМакетаЧленКомиссии);
						СтрокаСПодвалом.Добавить(ОбластьМакетаЧленКомиссии);
						
					КонецЕсли;
					
					Если ОбластьМакетаПодписьКладовщика <> Неопределено Тогда
						
						СтрокаСПодвалом.Добавить(ОбластьМакетаПодписьКладовщика);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
					
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоШтукПоСтранице = ИтогоШтукПоСтранице;
					ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоПоСтранице = ИтогоПоСтранице;
					ТабличныйДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
					
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					// Очистим итоги по странице
					ИтогоШтукПоСтранице = 0;
					ИтогоПоСтранице = 0;
					
					// Выведем заголовок таблицы
					НомерСтраницы = НомерСтраницы + 1;
					ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
					ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
					
				ИначеЕсли НомерСтроки = 1 Тогда // первая срока, все помещается
					
					ОбластьМакетаЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
					ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
				
				// Обновим итоги по странице
				ИтогоШтукПоСтранице = ИтогоШтукПоСтранице + ВыборкаСтрокЗапасы.КоличествоШтук;
				ИтогоПоСтранице = ИтогоПоСтранице + ВыборкаСтрокЗапасы.Количество;
				
				// Обновим итогов по документу
				ИтогоШтук = ИтогоШтук + ВыборкаСтрокЗапасы.КоличествоШтук;
				Итого = Итого + ВыборкаСтрокЗапасы.Количество;
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоШтукПоСтранице = ИтогоШтукПоСтранице;
			ОбластьМакетаИтогоПоСтранице.Параметры.ИтогоПоСтранице = ИтогоПоСтранице;
			ТабличныйДокумент.Вывести(ОбластьМакетаИтогоПоСтранице);
			
			// Выводим итоги по документу
			ОбластьМакетаВсего.Параметры.ИтогоШтук        = ИтогоШтук;
			ОбластьМакетаВсего.Параметры.Итого        = Итого;
			ТабличныйДокумент.Вывести(ОбластьМакетаВсего);
			
			// Выводим подписи
			Если ОбластьМакетаШапкаКомиссии <> Неопределено Тогда
				
				ТабличныйДокумент.Вывести(ОбластьМакетаШапкаКомиссии);
				
			КонецЕсли;
			
			ДанныеПечати = Новый Структура;
			
			Если ОбластьМакетаЧленКомиссии <> Неопределено Тогда
				
				КоличествоВыведенныхСтрок = 1;
				Пока ВыборкаКомиссия.Следующий() Цикл
					
					ДанныеПечати.Вставить("ДолжностьЧленаКомиссии", ВыборкаКомиссия.Должность);
					ДанныеПечати.Вставить("РасшифровкаПодписиЧленаКомиссии", ВыборкаКомиссия.РасшифровкаПодписи);
					
					ОбластьМакетаЧленКомиссии.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаЧленКомиссии);
					
					КоличествоВыведенныхСтрок = КоличествоВыведенныхСтрок + 1;
					
				КонецЦикла;
				
				ДанныеПечати.Вставить("ДолжностьЧленаКомиссии", Неопределено);
				ДанныеПечати.Вставить("РасшифровкаПодписиЧленаКомиссии", Неопределено);
				
				Пока КоличествоВыведенныхСтрок < 4 Цикл
					
					ОбластьМакетаЧленКомиссии.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаЧленКомиссии);
					
					КоличествоВыведенныхСтрок = КоличествоВыведенныхСтрок + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ОбластьМакетаПодписьКладовщика <> Неопределено Тогда
			
				ОбластьМакетаПодписьКладовщика.Параметры.Заполнить(Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакетаПодписьКладовщика);
				
			КонецЕсли;
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйОрдер") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриходныйОрдер", "Приходный ордер", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПриходныйОрдер"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М4") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М4", "М-4", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "М4"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ4") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ4", "Т-4", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТОРГ4"));
		
	КонецЕсли;
	
	ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполнения");
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
		ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = Обработки.ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
		ОписаниеПечатнойФормы.СинонимМакета = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
		
		ДанныеОбъектовПечати = ДанныеБланкаТоварногоНаполнения(МассивОбъектов, ОбъектыПечати);
		Обработки.ПечатьБланкТоварногоНаполнения.СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М4";
	КомандаПечати.Представление = НСтр("ru = 'М4 (Приходный ордер)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТОРГ4";
	КомандаПечати.Представление = НСтр("ru = 'ТОРГ4 (Акт о приемке товара)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриходныйОрдер";
	КомандаПечати.Представление = НСтр("ru = 'Приходный ордер'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли