
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры работы с обсуждениями
//
// Для новых объектов и при изменении из списка, изменения в СистемаВзаимодействия записываются регламентым заданием (отложенно)
// Для изменений в форме объектов, изменения в СистемаВзаимодействия записываются фоновым заданием (сразу)
////////////////////////////////////////////////////////////////////////////////

#Область ИнтеграцияСистемаВзаимодействия

// Значения заполнения для сообщения обсуждений.
// 
// Возвращаемое значение:
//  Структура
//  * Объект    - ЛюбаяСсылка — Объект-владелец контекстного обсуждения.
//              - ИдентификаторОбсужденияСистемыВзаимодействия — Идентификатор обсуждения.
//  * Текст     - Строка - Текст сообщения.
//  * Дата      - Дата - Дата сообщения.
//  * Автор     - СправочникСсылка.Пользователи - Автор сообщения.
//  * Данные    - Произвольный - Данные, содержащиеся в сообщении.
//  * Действия  - СписокЗначений - 
//  * Системный - Булево - Определяет, надо ли оформить текст в виде системного.
//                         Например, "#Изменено: сумма документа".
// 
Функция НовыйДанныеСообщения() Экспорт
	
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Объект", Неопределено);
	ДанныеСообщения.Вставить("Текст", "");
	ДанныеСообщения.Вставить("Дата", Дата(1, 1, 1, 0, 0, 0));
	ДанныеСообщения.Вставить("Автор", Справочники.Пользователи.ПустаяСсылка());
	ДанныеСообщения.Вставить("Данные", Неопределено);
	ДанныеСообщения.Вставить("Действия", Новый СписокЗначений);
	ДанныеСообщения.Вставить("Получатель", Неопределено);
	ДанныеСообщения.Вставить("Системный", Ложь);
	
	Возврат ДанныеСообщения;
	
КонецФункции

// Производит попытку создать произвольное сообщение обсуждения. Если не удается — добавляет сообщение в очередь сообщений.
//
// Параметры:
//  ДанныеСообщения - Структура - См. функцию ОбсужденияСервер.НовыйДанныеСообщения()
//
Процедура СоздатьСообщение(ДанныеСообщения) Экспорт
	
	Если ТипЗнч(ДанныеСообщения) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Передан некорректный параметр ""ДанныеСообщения"" (ожидаемый тип — Структура).'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеСообщения, НовыйДанныеСообщения(), Ложь);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Текст) Тогда
		ВызватьИсключение НСтр("ru='Сообщение с пустым текстом не может быть записано.'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Автор) Тогда
		ДанныеСообщения.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Дата) Тогда
		ДанныеСообщения.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ПопытатьсяСоздатьСообщениеСистемыВзаимодействия(ДанныеСообщения);
	
КонецПроцедуры

// Добавляет сообщение в очередь сообщений.
//
// Параметры:
//  ДанныеСообщения - Структура - См. функцию ОбсужденияСервер.НовыйДанныеСообщения()
//
Процедура СоздатьСообщениеОтложенно(ДанныеСообщения) Экспорт
	
	Если ТипЗнч(ДанныеСообщения) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Передан некорректный параметр ""ДанныеСообщения"" (ожидаемый тип — Структура).'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеСообщения, НовыйДанныеСообщения(), Ложь);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Текст) Тогда
		ВызватьИсключение НСтр("ru='Сообщение с пустым текстом не может быть записано.'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Автор) Тогда
		ДанныеСообщения.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Дата) Тогда
		ДанныеСообщения.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСообщения.Получатель) = Тип("СправочникСсылка.Сотрудники") И ЗначениеЗаполнено(ДанныеСообщения.Получатель) Тогда
		ДанныеСообщения.Получатель = РегистрыСведений.СотрудникиПользователя.ПолучитьПользователяПоСотруднику(ДанныеСообщения.Получатель);
	КонецЕсли;
	
	ЗаписатьДанныеВРегистрОчереди(ДанныеСообщения);
	
КонецПроцедуры

// Получает объект-владец обсуждения системы взаимодействия по контексу обсуждения.
//
// Параметры:
//  ИдентификаторОбсуждения	 - ИдентификаторОбсужденияСистемыВзаимодействия
// 
// Возвращаемое значение:
//   - ЛюбаяСсылка
//
Функция РазыменоватьКонтекстОбсуждения(ИдентификаторОбсуждения) Экспорт
	
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(ИдентификаторОбсуждения);
	
	Если Обсуждение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Обсуждение.КонтекстОбсуждения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьСсылкуИзНавигационной(Обсуждение.КонтекстОбсуждения.НавигационнаяСсылка)
	
КонецФункции

Функция ПолучитьСообщение(ОбсуждениеИдентификатор, СообщениеИдентификатор) Экспорт
	
	Возврат ПолучитьСообщениеРекурсивно(ОбсуждениеИдентификатор, СообщениеИдентификатор, Неопределено);
	
КонецФункции

Функция ПолучитьОбсуждение(ОбсуждениеИдентификатор) Экспорт
	
	Возврат СистемаВзаимодействия.ПолучитьОбсуждение(ОбсуждениеИдентификатор);
	
КонецФункции

// Получает идентификатор пользователя системы взаимодействия.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//   - ИдентификаторПользователяСистемыВзаимодействия, Неопределено
//
Функция ИдентификаторПользователя(Пользователь) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ОбсужденияСервер.ИдентификаторПользователя", "Пользователь", Пользователь, Тип("СправочникСсылка.Пользователи"));
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ВызватьИсключение НСтр("ru='Не заполнено значение параметра ""Пользователь""'");
	КонецЕсли;
	
	Возврат СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
	
КонецФункции

// Получает контекстное обсуждение системы взаимодейсвие по указанному объекту
// В случае если такое обсуждение еще не создано - создает его.
//
// Параметры:
//  ОбъектСсылка - ЛюбаяСсылка
// 
// Возвращаемое значение:
//   - ОбсуждениеСистемыВзаимодействия
//
Функция ПолучитьКонтекстноеОбсуждение(ОбъектСсылка) Экспорт
	
	Обсуждение = Неопределено;
	
	#Если НЕ ВнешнееСоединение Тогда
	КонтекстОбсуждения = Новый КонтекстОбсужденияСистемыВзаимодействия(ПолучитьНавигационнуюСсылку(ОбъектСсылка));
	
	ОтборОбсуждений = Новый ОтборОбсужденийСистемыВзаимодействия();
	ОтборОбсуждений.КонтекстноеОбсуждение = Истина;
	ОтборОбсуждений.КонтекстОбсуждения = КонтекстОбсуждения;
	
	ОбсужденияПоОбъекту = СистемаВзаимодействия.ПолучитьОбсуждения(ОтборОбсуждений);
	
	Если ОбсужденияПоОбъекту.Количество() <> 0 Тогда
		Возврат ОбсужденияПоОбъекту[0];
	КонецЕсли;
	
	Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	Обсуждение.Заголовок = "История " + ОбъектСсылка;
	Обсуждение.КонтекстОбсуждения = КонтекстОбсуждения;
	
	Обсуждение.Записать();
	#КонецЕсли
	
	Возврат Обсуждение;
	
КонецФункции

// Находит последнее сообщение конкретного пользователя в указанном обсуждении.
//
// Параметры:
//  ОбсуждениеИдентификатор	 - ОбсуждениеСистемыВзаимодействия
//  Пользователь			 - ИдентификаторПользователяСистемыВзаимодействия, ПользовательСистемыВзаимодействия, СправочникСсылка.Пользователи
//  После					 - ИдентификаторСообщенияСистемыВзаимодействия - Если параметр передан, возвращаются сообщения после указанного.
// 
// Возвращаемое значение:
//   - СообщениеСистемыВзаимодействия, Неопределено
//
Функция ПолучитьПоследнееСообщение(ОбсуждениеИдентификатор, Пользователь, После = Неопределено) Экспорт
	
	#Если НЕ ВнешнееСоединение Тогда
	ТипыПользователя = Новый Массив;
	ТипыПользователя.Добавить(Тип("ИдентификаторПользователяСистемыВзаимодействия"));
	ТипыПользователя.Добавить(Тип("ПользовательСистемыВзаимодействия"));
	ТипыПользователя.Добавить(Тип("СправочникСсылка.Пользователи"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ПолучитьПоследнееСообщение", "Пользователь", Пользователь, ТипыПользователя);
	
	Отбор = Новый ОтборСообщенийСистемыВзаимодействия;
	Отбор.Обсуждение = ОбсуждениеИдентификатор;
	Отбор.Количество = 1;
	Если После <> Неопределено Тогда
		Отбор.После = После;
	КонецЕсли;
	Отбор.НаправлениеСортировки = НаправлениеСортировки.Убыв;
	
	Сообщения = СистемаВзаимодействия.ПолучитьСообщения(Отбор);
	Если Сообщения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СообщениеУказанногоАвтора = Неопределено;
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Автор = ИдентификаторПользователя(Пользователь);
	ИначеЕсли ТипЗнч(Пользователь) = Тип("ИдентификаторПользователяСистемыВзаимодействия") Тогда
		Автор = Пользователь;
	ИначеЕсли ТипЗнч(Пользователь) = Тип("ПользовательСистемыВзаимодействия") Тогда
		Автор = Пользователь.Идентификатор;
	КонецЕсли;
	
	Для каждого Сообщение Из Сообщения Цикл
		Если Сообщение.Автор = Автор Тогда
			Возврат Сообщение;
		КонецЕсли;
	КонецЦикла;
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область АвтоматическиеСобытия

// Записывает данные об изменениях объекта по подписке на событие.
// 
// Параметры:
//  Источник			   - Ссылка объекта, для которого будут записаны данные обсуждений
//  Отказ				   - Отказ записи
//Дополнительно формируются записи: 
//		при наличии поля "Контрагент" - формируется запись в обсуждениях контрагента об упоминании в этом объекте
//		при вводе на основании - формируется запись о введенном дочернем объекте в обсуждении для родительского объекта
Процедура ОбсужденияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ЛогироватьИзмененияОбъектов() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ГрупповаяЗагрузкаДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоЗаписьАссистентом") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		Если ОбщегоНазначения.ЭтоДокумент(Источник.Метаданные()) Тогда
			Сообщение = ?(Источник.Проведен, НСтр("ru = 'Создан и проведен'"), НСтр("ru = 'Создан'"));
		Иначе
			Сообщение = НСтр("ru = 'Создан'");
		КонецЕсли;
		
		ДобавитьСообщение(Сообщение, Источник.Ссылка,,Истина);
		ДобавитьЗаписьУпоминаниеКонтрагента(,Источник);
		ДобавитьЗаписьВводНаОсновании(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Записывает данные об изменениях объекта по подписке на событие.
// 
// Параметры:
//  Источник			   - Ссылка объекта, для которого будут записаны данные обсуждений
//  Отказ				   - Отказ записи
//  РежимЗаписи			   - Режим записи объекта
//  РежимПроведения		   - Режим проведения объекта
// Если объект новый и еще не сохранен, запись обсуждений передается в процедуру ОбсужденияПриЗаписи, где уже есть ссылка объекта
//В ДополнительныеСвойства передаются параметры: 
//	Модифицированность		- модифицированность объекта в форме
Процедура ОбсужденияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ЛогироватьИзмененияОбъектов() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ГрупповаяЗагрузкаДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОбсуждениеЗаписано") Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоЗаписьАссистентом") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		Возврат;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ДляОбсуждений", Новый Структура);
	
	Если ОбщегоНазначения.ЭтоДокумент(Источник.Метаданные()) Тогда
		Сообщение = ОбсужденияСравнитьОбъектыДокумент(Источник, РежимЗаписи, РежимПроведения);
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(Источник.Метаданные()) Тогда
		Сообщение = ОбсужденияСравнитьОбъектыСправочник(Источник);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Сообщение) Тогда
		
		ИнформационнаяБазаЗарегистрирована = Ложь;
		#Если НЕ ВнешнееСоединение Тогда
			ИнформационнаяБазаЗарегистрирована = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
		#КонецЕсли
		
		Если ИнформационнаяБазаЗарегистрирована Тогда
			Если Источник.ДополнительныеСвойства.Свойство("Модифицированность") Тогда // Запись из формы фоновым заданием в ПослеЗаписи
				МоментВремени = МестноеВремя(ТекущаяУниверсальнаяДата(), РаботаВМоделиСервиса.ПолучитьЧасовойПоясОбластиДанных(ОбщегоНазначения.ЗначениеРазделителяСеанса()));
				Источник.ДополнительныеСвойства.ДляОбсуждений.Вставить("Сообщение", Сообщение);
				Источник.ДополнительныеСвойства.ДляОбсуждений.Вставить("МоментВремени", МоментВремени);
			Иначе // запись регламентным заданием
				ДобавитьСообщение(Сообщение, Источник.Ссылка, ,Истина);
			КонецЕсли;
		ИначеЕсли УправлениеНебольшойФирмойПовтИсп.ИспользоватьЧатВОбсуждениях() Тогда //запись в регистр Обсуждения
			ДобавитьСообщение(Сообщение, Источник.Ссылка,,Истина);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДобавитьТекстСтандартныхСообщений(Сообщение, СтарыйОбъект, НовыйОбъект, РежимЗаписи)
	
	Если НЕ СтарыйОбъект.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Сообщение = НСтр("ru = 'Проведен'");
	КонецЕсли; 
	
	Если СтарыйОбъект.Проведен И РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Сообщение = НСтр("ru = 'Проведение отменено'");
	КонецЕсли; 
	
	Если НЕ СтарыйОбъект.ПометкаУдаления И НовыйОбъект.ПометкаУдаления Тогда
		Сообщение = НСтр("ru = 'Помечен на удаление'");
	КонецЕсли; 
	
	Если СтарыйОбъект.ПометкаУдаления И НЕ НовыйОбъект.ПометкаУдаления Тогда
		Сообщение = НСтр("ru = 'Снята пометка на удаление'");
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеИзмененийРеквизитов(СтруктураРеквизитов, СтарыйОбъект, НовыйОбъект)
	
	МетаданныеОбъекта = НовыйОбъект.Метаданные();
	ОписаниеИзменений = "";
	
	ИзмененДоговор = Ложь;
	ИзмененКонтрагент = Ложь;
	
	Для каждого Реквизит Из СтруктураРеквизитов Цикл
		
		Если СтарыйОбъект[Реквизит.Ключ]=НовыйОбъект[Реквизит.Ключ] Тогда
			Продолжить;
		КонецЕсли;

		// Текст описания изменения формируется автоматически
		Синоним = ПредставлениеРеквизита(МетаданныеОбъекта, Реквизит.Ключ);
		СтароеЗначение = СтарыйОбъект[Реквизит.Ключ];
		НовоеЗначение = НовыйОбъект[Реквизит.Ключ];
		
		//Не выводим договор, если он был изменен вместе с контрагентом
		Если Реквизит.Ключ = "Договор" Тогда
			ИзмененДоговор = Истина;
			Продолжить;
		КонецЕсли; 
		Если Реквизит.Ключ = "Контрагент" Тогда
			ИзмененКонтрагент = Истина;
		КонецЕсли; 
		
		ТекстИзменений = ДобавитьСообщениеОбИзмененииРеквизита(СтароеЗначение, НовоеЗначение);
		
		//Сокращение текста сообщения
		Если ТипЗнч(СтароеЗначение) = Тип("Строка") 
			И СтрДлина(Строка(СтароеЗначение) + Строка(НовоеЗначение)) > ДлинаСообщения() Тогда
			
			Сокращение = СократитьТекстСообщения(ТекстИзменений, НовыйОбъект, Синоним+": ");
			
			Если НЕ НовыйОбъект.ДополнительныеСвойства.ДляОбсуждений.Свойство("Сокращение") Тогда
				НовыйОбъект.ДополнительныеСвойства.ДляОбсуждений.Вставить("Сокращения", Новый Соответствие);
			КонецЕсли;
			Если ЗначениеЗаполнено(Сокращение) Тогда
				НовыйОбъект.ДополнительныеСвойства.ДляОбсуждений.Сокращения.Вставить(Сокращение);
			КонецЕсли;
		КонецЕсли;
		
		ДобавитьОписаниеИзменений(ОписаниеИзменений, ТекстИзменений, Синоним);
	
	КонецЦикла;
	
	Если СтруктураРеквизитов.Свойство("Договор") И НЕ ИзмененКонтрагент И СтарыйОбъект.Договор <> НовыйОбъект.Договор Тогда
		ТекстИзменений = ДобавитьСообщениеОбИзмененииРеквизита(СтарыйОбъект.Договор, НовыйОбъект.Договор);
		ДобавитьОписаниеИзменений(ОписаниеИзменений, ТекстИзменений, Синоним);
	КонецЕсли;
	
	Возврат ОписаниеИзменений;
	
КонецФункции

Функция ОписаниеИзмененийКонтактнойИнформации(СтарыйОбъект, НовыйОбъект)
	
	Если НовыйОбъект.Метаданные().ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	СтараяТЧ = СтарыйОбъект.КонтактнаяИнформация.Выгрузить();
	НоваяТЧ = НовыйОбъект.КонтактнаяИнформация;
	
	МассивСтарыхЗначений = СтараяТЧ.ВыгрузитьКолонку("Представление");
	МассивНовыхЗначений = НоваяТЧ.ВыгрузитьКолонку("Представление");
	
	ТекстИзменений = ОписаниеСравненияМассивов(МассивСтарыхЗначений, МассивНовыхЗначений);
	
	Если НЕ ПустаяСтрока(ТекстИзменений) Тогда
		ТекстИзменений = НСтр("ru = 'Контактная информация: '") + ТекстИзменений;
	КонецЕсли;
	
	Возврат ТекстИзменений;
	
КонецФункции

Функция ЕстьРеквизитОбъекта(Знач ИмяРеквизита, Знач Объект)
	
	ПроверкаРеквизита = Новый Структура(ИмяРеквизита, Неопределено);
	ЗаполнитьЗначенияСвойств(ПроверкаРеквизита, Объект);
	Если ПроверкаРеквизита[ИмяРеквизита] <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОписаниеСравненияМассивов(МассивСтарыхЗначений, МассивНовыхЗначений)
	
	Результат = "";
	
	СписокДобавленных = Новый СписокЗначений;
	СписокУдаленных = Новый СписокЗначений;
	Для каждого Элемент Из МассивСтарыхЗначений Цикл
		Если МассивНовыхЗначений.Найти(Элемент)=Неопределено И СписокУдаленных.НайтиПоЗначению(Элемент)=Неопределено Тогда
			СписокУдаленных.Добавить(Элемент);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого Элемент Из МассивНовыхЗначений Цикл
		Если МассивСтарыхЗначений.Найти(Элемент)=Неопределено И СписокДобавленных.НайтиПоЗначению(Элемент)=Неопределено Тогда
			СписокДобавленных.Добавить(Элемент);
		КонецЕсли; 
	КонецЦикла;
	
	Если СписокДобавленных.Количество()=0 И СписокУдаленных.Количество()=0 Тогда
		Возврат "";
	КонецЕсли;
	
	Если СписокДобавленных.Количество()>0 И СписокУдаленных.Количество()>0 Тогда
		Результат = НСтр("ru = 'Удалены: '")+Строка(СписокУдаленных)+", "+НСтр("ru = 'Добавлены: '")+Строка(СписокДобавленных);;
		Возврат Результат;
	КонецЕсли; 
	
	Если СписокУдаленных.Количество()>0 Тогда
		Результат = НСтр("ru = 'Удалены: '")+Строка(СписокУдаленных);
	КонецЕсли;
	
	Если СписокДобавленных.Количество()>0 Тогда
		Результат = НСтр("ru = 'Добавлены: '")+Строка(СписокДобавленных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОписаниеИзменений(ОписаниеИзменений, ТекстИзменений, Синоним="") Экспорт
	
	ДобавитьСтроку(ОписаниеИзменений, Синоним + ": " + ТекстИзменений);
	
КонецПроцедуры

Функция ДобавитьСообщениеОбИзмененииРеквизита(СтароеЗначение = Неопределено, НовоеЗначение = Неопределено, Формат ="") Экспорт
	
	// Текст описания изменения формируется автоматически
	Если СтароеЗначение<>Неопределено ИЛИ НовоеЗначение<>Неопределено Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтароеЗначение)) 
			ИЛИ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СтароеЗначение))
			Тогда
			ТекстСтарыйОбъект = HTMLСсылка(СтароеЗначение);
		ИначеЕсли НЕ ПустаяСтрока(Формат) Тогда 
			ТекстСтарыйОбъект = Формат(СтароеЗначение, Формат);
		Иначе
			ТекстСтарыйОбъект = Строка(СтароеЗначение);
		КонецЕсли; 
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(НовоеЗначение)) 
			ИЛИ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НовоеЗначение))
			Тогда
			ТекстНовыйОбъект = HTMLСсылка(НовоеЗначение);
		ИначеЕсли НЕ ПустаяСтрока(Формат) Тогда 
			ТекстНовыйОбъект = Формат(НовоеЗначение, Формат);
		Иначе
			ТекстНовыйОбъект = Строка(НовоеЗначение)
		КонецЕсли; 
	КонецЕсли; 
	
	ТекстИзменений = "";
	Если СтароеЗначение<>Неопределено ИЛИ НовоеЗначение<>Неопределено Тогда
		Если СтрДлина(Строка(СтароеЗначение) + Строка(НовоеЗначение)) > ДлинаСообщения() Тогда
			ТекстИзменений = ТекстСтарыйОбъект + Символы.ПС + "→" + Символы.ПС + ТекстНовыйОбъект;
		Иначе
			ТекстИзменений = ТекстСтарыйОбъект + " → " + ТекстНовыйОбъект;
		КонецЕсли;
	Иначе
		ТекстИзменений = "";
	КонецЕсли;
	
	Возврат ТекстИзменений;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПослеЗаписиНаСервере(ТекущийОбъект) Экспорт
	
	Если НЕ ТекущийОбъект.ДополнительныеСвойства.Свойство("ДляОбсуждений")
		ИЛИ ТекущийОбъект.ДополнительныеСвойства.ДляОбсуждений.Количество()=0
		ИЛИ НЕ ТекущийОбъект.ДополнительныеСвойства.ДляОбсуждений.Свойство("Сообщение") Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационнаяБазаЗарегистрирована = Ложь;
	#Если НЕ ВнешнееСоединение Тогда
		ИнформационнаяБазаЗарегистрирована = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	#КонецЕсли
	
	Если НЕ ИнформационнаяБазаЗарегистрирована Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСообщения = НовыйДанныеСообщения();
	ДанныеСообщения.Объект = ТекущийОбъект.Ссылка;
	ДанныеСообщения.Текст = ТекущийОбъект.ДополнительныеСвойства.ДляОбсуждений.Сообщение;
	ДанныеСообщения.Дата = ТекущийОбъект.ДополнительныеСвойства.ДляОбсуждений.МоментВремени;
	ДанныеСообщения.Автор = Пользователи.АвторизованныйПользователь();
	ДанныеСообщения.Системный = Истина;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ДанныеСообщения);
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбсужденияСервер.ПопытатьсяСоздатьСообщениеСистемыВзаимодействия",
		ПараметрыЗадания,, НСтр("ru = 'Логирование изменений в систему взаимодействия'"));
	
КонецПроцедуры

//Формирует Массив структур, содержащий имена и описания пользователей для использования в тексте обсуждений.
// 
// Параметры: Нет
//
// Возвращаемое значение:
//  Массив           - по числу пользователей: 
//   * Пользователь  - эл. справочника Пользователи
//   * Представление - Строка - Наименование пользователя,
//   * Имя 			 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя";
//   * ДляПоиска 	 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя",
//	 				   в нижнем регистре
Функция МассивОписанийПользователей() Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Наименование КАК Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОписания = Новый Структура;
		СтруктураОписания.Вставить("Пользователь", Выборка.Пользователь);
		СтруктураОписания.Вставить("Представление", Выборка.Представление);
		СтруктураОписания.Вставить("Имя", СтрЗаменить(Выборка.Представление, " ", "_"));
		СтруктураОписания.Вставить("ДляПоиска", НРег(СтруктураОписания.Имя));
		Результат.Добавить(СтруктураОписания);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//Функция СловарьОписанийПользователей() Экспорт
Функция СловарьОписанийПользователей() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Наименование КАК Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОписания = Новый Структура;
		СтруктураОписания.Вставить("Имя", СтрЗаменить(Выборка.Представление, " ", "_"));
		
		СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.Представление);
		номерСловаФИО = 1;
		Для каждого элементФИО Из СтруктураФИО Цикл
			СтруктураОписания.Вставить("ФИО"+номерСловаФИО, элементФИО.Значение);
			номерСловаФИО = номерСловаФИО + 1;
		КонецЦикла;
		
		Для н=1 По 10 Цикл // 10 первых букв слова ФИО для поиска
			Для номерСловаФИО=1 По 3 Цикл //3 части Представления - отдельные слова ФИО Представления пользователя 
				СловоПоиска = Лев(СтруктураОписания["ФИО"+номерСловаФИО],н);
				СловоПоиска = НРег(СловоПоиска);
				МассивПользователей = Результат.Получить(СловоПоиска);
				Если МассивПользователей = Неопределено Тогда
					МассивПользователей = Новый Массив;
					МассивПользователей.Добавить(СтруктураОписания.Имя);
					Результат.Вставить(СловоПоиска, МассивПользователей);
				ИначеЕсли МассивПользователей.Найти(СтруктураОписания.Имя)=Неопределено Тогда
					МассивПользователей.Добавить(СтруктураОписания.Имя);
					Результат.Вставить(СловоПоиска, МассивПользователей);
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла; 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует содержимое поля HTML документа, которое отображает обсуждения
// 
// Параметры: 
//  Объект		     - любая ссылка - объект, по которому выводятся данные обсуждений 
//  ЗаПериод		 - Булево - регулирует ограничение показываемых записей. Если ЗаПериод=Истина И
//						число записей обсуждений больше 15, то показываются записи за последние 14 дней
//						от текущей даты
// Возвращаемое значение:
//  Результат        - Строка - содержимое поля HTML документа 
//
Функция ОбсужденияПоОбъекту(Объект, ЗаПериод=Ложь) Экспорт
	
	Результат = 
	"<HTML>
	|<STYLE type=text/css>
	|BODY {
	|	/* Шрифты */ FONT-FAMILY: sans-serif; FONT-SIZE:12px;
	|}
	|</STYLE>
	|<BODY>
	|";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Обсуждения.МоментВремени КАК МоментВремени,
	|	Обсуждения.Комментарий,
	|	Обсуждения.Системный,
	|	Обсуждения.Пользователь
	|ИЗ
	|	РегистрСведений.Обсуждения КАК Обсуждения
	|ГДЕ
	|	Обсуждения.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	//Если больше 15 записей и используем ограничение по периоду, 
	//то показываем данные за последние 2 недели (14 дней)
	Если ЗаПериод = Истина И Выборка.Количество()>15 Тогда
		ЧислоДнейОграничения = 14;
		ДатаОграничения = ТекущаяДата()-3600*24*ЧислоДнейОграничения;
	Иначе
		ДатаОграничения = Дата("00010101");
	КонецЕсли;
	
	ПредВремя = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если Выборка.МоментВремени<ДатаОграничения Тогда
			
			Результат = Результат+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '<DIV STYLE=""DISPLAY: BLOCK; WIDTH: 100%; MARGIN-BOTTOM: 5px; %1"">
			|<DIV STYLE=""WIDTH: 9em; FLOAT: LEFT; COLOR: gray;"">%2</DIV>
			|<DIV STYLE=""WIDTH: 12em; FLOAT: LEFT; COLOR: gray;"">%3</DIV>
			|<DIV STYLE=""MARGIN-LEFT: 21em;"">%4</DIV>
			|</DIV><BR>'"),
			?(Выборка.Системный, "COLOR: gray;", ""),
			"",
			"",
			"<A HREF='ПоказатьВсе'>Показать все</A>");

			Результат = Результат+Символы.ПС;
			
			Прервать;
		КонецЕсли;
		
		ТекстКомментария = СтрЗаменить(Выборка.Комментарий, Символы.ПС, "<BR>");
		ОбновитьПредставлениеОбъектаВНавигационнойСсылке(ТекстКомментария);

		Если НачалоДня(ТекущаяДатаСеанса())=НачалоДня(Выборка.МоментВремени) Тогда
			МоментВремениСтрокой = НСтр("ru = 'Сегодня в '")+Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=ЧЧ:мм'"));
		ИначеЕсли НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1)=НачалоДня(Выборка.МоментВремени) Тогда
			МоментВремениСтрокой = НСтр("ru = 'Вчера в '")+Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=ЧЧ:мм'"));
		ИначеЕсли Год(Выборка.МоментВремени)<>Год(ТекущаяДатаСеанса()) Тогда 
			МоментВремениСтрокой = Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=''дд МММ гггг ЧЧ:мм'''"))
		Иначе
			МоментВремениСтрокой = Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=''дд МММ ЧЧ:мм'''"))
		КонецЕсли; 
		Результат = Результат+СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '<DIV STYLE=""DISPLAY: BLOCK; WIDTH: 100%; MARGIN-BOTTOM: 5px; %1"">
		|<DIV STYLE=""WIDTH: 9em; FLOAT: LEFT; COLOR: gray;"">%2</DIV>
		|<DIV STYLE=""WIDTH: 12em; FLOAT: LEFT; COLOR: gray;"">%3</DIV>
		|<DIV STYLE=""MARGIN-LEFT: 21em;"">%4</DIV>
		|</DIV><BR>'"),
		?(Выборка.Системный, "COLOR: gray;", ""),
		МоментВремениСтрокой,
		HTMLСсылкаДляСтарыхКомментариев(Выборка.Пользователь),
		ТекстКомментария);
		Результат = Результат+Символы.ПС;
		ПредВремя = НачалоМинуты(Выборка.МоментВремени);
	КонецЦикла;
	Результат = Результат+"</BODY></HTML>";
	
	Возврат Результат;
	
КонецФункции

// Добавляет запись обсуждения в регистр сведений Обсуждения для Ссылки, а также для упомянутых (по навигационным ссылкам) в тексте комментария объектов,
// формирует напоминания пользователям, упомянутым в тексте комментария
// Параметры:
//  Комментарий			   Строка 		- текст сообщения
//  Ссылка				   Любая ссылка - ссылка на объект обсуждения
//  МоментВремени          Дата и время - время сохранения сообщения
//  Системный			   Булево 		- Истина для сохранения изменений объекта, Ложь для сохранения комментариев к объекту
//  Пользователь		   Справочник Пользователи - Пользователь, сохраняющий комментарий
//
Процедура ДобавитьСообщение(
	Комментарий,
	Ссылка,
	МоментВремени = Неопределено,
	Системный = Ложь,
	Пользователь = Неопределено,
	Действия = Неопределено
	) Экспорт
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ЛогироватьИзмененияОбъектов()
		ИЛИ ПустаяСтрока(Комментарий)
		ИЛИ НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательАвторСообщения	= ?(НЕ ЗначениеЗаполнено(Пользователь), Пользователи.АвторизованныйПользователь(), Пользователь);
	
	ИнформационнаяБазаЗарегистрирована = Ложь;
	#Если НЕ ВнешнееСоединение Тогда
		ИнформационнаяБазаЗарегистрирована = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	#КонецЕсли
	
	Если ИнформационнаяБазаЗарегистрирована Тогда
		
		ДанныеСообщения = НовыйДанныеСообщения();
		ДанныеСообщения.Объект = Ссылка;
		ДанныеСообщения.Текст = Комментарий;
		ДанныеСообщения.Дата = МоментВремени;
		ДанныеСообщения.Автор = ПользовательАвторСообщения;
		ДанныеСообщения.Системный = Системный;
		Если ТипЗнч(Действия) = Тип("СписокЗначений") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Действия, ДанныеСообщения.Действия);
		КонецЕсли;
		
		//Записать основное сообщение
		ЗаписатьВОчередьСистемыВзаимодействия(ДанныеСообщения);
		
	Иначе
		
		ПользователиРассылки= Новый Массив;
		//Заменяем в тексте сообщения навигационные ссылки на HTML-ссылки
		Если НЕ Системный Тогда
			
			ЗаменитьТехническиеСимволы(Комментарий);
			
			МассивСсылокУпоминаний = ПреобразоватьНавигационныеСсылки(Комментарий);
			
			//Записать упоминания других объектов в сообщении, если есть
			Для каждого СсылкаУпоминание Из МассивСсылокУпоминаний Цикл
				КомментарийУпоминание = НСтр("ru = 'Упоминание в: '")+HTMLСсылка(Ссылка);
				ЗаписатьДанныеВРегистрОбсуждения(КомментарийУпоминание, СсылкаУпоминание, МоментВремени, Системный, ПользовательАвторСообщения);
			КонецЦикла;
		КонецЕсли;
		
		//Заменяем имена пользователей по тегу @ на HTML-ссылки пользователей
		ПреобразоватьСсылкиПользователей(Комментарий, ПользователиРассылки);
		
		//Записать основное сообщение
		ЗаписатьДанныеВРегистрОбсуждения(Комментарий, Ссылка, МоментВремени, Системный, ПользовательАвторСообщения);
		
		СформироватьНапоминанияПользователям(Ссылка, ПользовательАвторСообщения, Комментарий, ПользователиРассылки);
		
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытий

Функция ОбсужденияСравнитьОбъектыСправочник(НовыйОбъект)
	
	СтруктураПроверяемыхРеквизитов = РеквизитыДляПроверкиИзмененийСправочник(НовыйОбъект);
	СтарыйОбъект = ДанныеСправочникаВыборка(НовыйОбъект, СтруктураПроверяемыхРеквизитов);
	
	Сообщение = "";
	Если НЕ СтарыйОбъект.ПометкаУдаления И НовыйОбъект.ПометкаУдаления Тогда
		Сообщение = НСтр("ru = 'Помечен на удаление'");
	КонецЕсли; 
	
	Если СтарыйОбъект.ПометкаУдаления И НЕ НовыйОбъект.ПометкаУдаления Тогда
		Сообщение = НСтр("ru = 'Снята пометка на удаление'");
	КонецЕсли;
	
	ЕстьРеквизитНедействителен = СтруктураПроверяемыхРеквизитов.Свойство("Недействителен") И ТипЗнч(СтарыйОбъект.Недействителен) = Тип("Булево");
	
	Если ЕстьРеквизитНедействителен И НЕ СтарыйОбъект.Недействителен И НовыйОбъект.Недействителен Тогда
		Сообщение = НСтр("ru = 'Помечен недействительным'");
		СтруктураПроверяемыхРеквизитов.Удалить("Недействителен");
	КонецЕсли;
	
	Если ЕстьРеквизитНедействителен И СтарыйОбъект.Недействителен И НЕ НовыйОбъект.Недействителен Тогда
		Сообщение = НСтр("ru = 'Снята пометка недействителен'");
		СтруктураПроверяемыхРеквизитов.Удалить("Недействителен");
	КонецЕсли;
	
	ОписаниеИзменений = ОписаниеИзмененийРеквизитов(СтруктураПроверяемыхРеквизитов, СтарыйОбъект, НовыйОбъект);
	ОписаниеИзмененийКИ = ОписаниеИзмененийКонтактнойИнформации(СтарыйОбъект, НовыйОбъект);
	
	ДобавитьСтроку(Сообщение, ОписаниеИзменений);
	ДобавитьСтроку(Сообщение, ОписаниеИзмененийКИ);
	
	ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект, НовыйОбъект);
	
	Возврат Сообщение;
	
КонецФункции

Функция ОбсужденияСравнитьОбъектыДокумент(НовыйОбъект, РежимЗаписи, РежимПроведения)
	
	СтруктураПроверяемыхРеквизитов = РеквизитыДляПроверкиИзмененийДокумент(НовыйОбъект);
	СтарыйОбъект = ДанныеДокументаВыборка(НовыйОбъект, СтруктураПроверяемыхРеквизитов);
	
	Сообщение = "";
	ДобавитьТекстСтандартныхСообщений(Сообщение, СтарыйОбъект, НовыйОбъект, РежимЗаписи);
	
	ОбъектМодифицирован = Неопределено;
	Если НовыйОбъект.ДополнительныеСвойства.Свойство("Модифицированность") Тогда
		ОбъектМодифицирован = НовыйОбъект.ДополнительныеСвойства.Модифицированность;
		Если ОбъектМодифицирован = Ложь Тогда
			Возврат Сообщение;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеИзменений = ОписаниеИзмененийРеквизитов(СтруктураПроверяемыхРеквизитов, СтарыйОбъект, НовыйОбъект);
	
	ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект, НовыйОбъект);
	
	Если ОписаниеИзменений = "" И ОбъектМодифицирован = Истина Тогда
		Если Сообщение = "" Тогда
			//Изменены реквизиты, не входящие в список для проверки
			Сообщение = НСтр("ru = 'Изменен документ'");
		КонецЕсли;
	Иначе
		ДобавитьСтроку(Сообщение, ОписаниеИзменений);
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

Процедура ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект=Неопределено, НовыйОбъект)
	
	Если НЕ ЕстьРеквизитОбъекта("Контрагент", НовыйОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтарыйОбъект=Неопределено  Тогда
		//Вызов из несохраненного документа
		Сообщение = НСтр("ru = 'Добавлен в: '")+HTMLСсылка(НовыйОбъект.Ссылка);
		ДобавитьСообщение(Сообщение, НовыйОбъект.Контрагент,,Истина);
	ИначеЕсли СтарыйОбъект.Контрагент<>НовыйОбъект.Контрагент Тогда
		Сообщение = НСтр("ru = 'Добавлен в: '")+HTMLСсылка(НовыйОбъект.Ссылка);
		ДобавитьСообщение(Сообщение, НовыйОбъект.Контрагент,,Истина);
		
		Сообщение = НСтр("ru = 'Удален из: '")+HTMLСсылка(СтарыйОбъект.Ссылка);
		ДобавитьСообщение(Сообщение, СтарыйОбъект.Контрагент,,Истина);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗаписьВводНаОсновании(Источник)
	
	спДокументовОснований = Новый СписокЗначений;
	
	Если ЕстьРеквизитОбъекта("ДокументОснование", Источник) И ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
		спДокументовОснований.Добавить(Источник.ДокументОснование);
	Иначе
		спДокументовОснований = ПолучитьРодительскийДокумент(Источник.Ссылка);
	КонецЕсли;
	
	Если спДокументовОснований.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	Сообщение = НСтр("ru = 'Использован в: '")+HTMLСсылка(Источник.Ссылка);
	
	Для каждого стр Из спДокументовОснований Цикл
		ДокументОснование = стр.Значение;
		
		ДобавитьСообщение(Сообщение, ДокументОснование,,Истина);
	КонецЦикла; 
	
КонецПроцедуры

Функция РеквизитыДляПроверкиИзмененийДокумент(ДокументОбъект)
	
	ВсеРеквизиты = УправлениеНебольшойФирмойПовтИсп.ПроверяемыеРеквизитыОбсуждения();
	РеквизитыДокумента = "";
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	
	Если ВсеРеквизиты.Свойство(ИмяДокумента) Тогда
		РеквизитыДокумента = ВсеРеквизиты[ИмяДокумента];	
	КонецЕсли;
	
	Возврат Новый Структура(РеквизитыДокумента);
	
КонецФункции

Функция ДанныеСправочникаВыборка(СправочникОбъект, СтруктураПроверяемыхРеквизитов)
	
	ТекстПолей = "";
	Для каждого КлючИЗначение Из СтруктураПроверяемыхРеквизитов Цикл
		
		ИмяПоля = КлючИЗначение.Ключ;
		ТекстПолей  = ТекстПолей + "
		|	," + ИмяПоля + " КАК " + ИмяПоля;
		
	КонецЦикла;
	
	ТекстТабличнойЧасти = "";
	Если СправочникОбъект.Метаданные().ТабличныеЧасти.Найти("КонтактнаяИнформация")<>Неопределено Тогда
		Если СправочникОбъект.Метаданные().ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Найти("Представление") <> Неопределено Тогда
			ТекстТабличнойЧасти = " 
			| ,КонтактнаяИнформация.(
			|		Представление КАК Представление
			|)";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СправочникОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|Ссылка КАК Ссылка,
	|ПометкаУдаления КАК ПометкаУдаления
	|" + ТекстПолей + "
	|
	|" + ТекстТабличнойЧасти + "
	|ИЗ
	|	" + СправочникОбъект.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

Функция ДанныеДокументаВыборка(ДокументОбъект, СтруктураПроверяемыхРеквизитов)
	
	ТекстПолей = "";
	Для каждого КлючИЗначение Из СтруктураПроверяемыхРеквизитов Цикл
		
		ИмяПоля = КлючИЗначение.Ключ;
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + ИмяПоля;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|Ссылка КАК Ссылка,
	|Проведен КАК Проведен,
	|ПометкаУдаления КАК ПометкаУдаления,
	|" + ТекстПолей + "
	|
	|ИЗ
	|	" + ДокументОбъект.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

Функция РеквизитыДляПроверкиИзмененийСправочник(СправочникОбъект)
	
	СтруктураПроверяемыхРеквизитов = Новый Структура("
	|Наименование,
	|Комментарий,
	/////////////////////////////////
	|ИНН,
	|КПП,
	|Контрагент,
	|Договор,
	|Ответственный,
	|НаименованиеПолное,
	|ВестиРасчетыПоДоговорам,
	|ВестиРасчетыПоДокументам,
	|ВестиРасчетыПоЗаказам,
	|ВестиУчетОплатыПоСчетам,
	|ВидКонтрагента,
	|СостояниеЛида,
	|Недействителен");

	РеквизитыСправочника = СправочникОбъект.Метаданные().Реквизиты;
	СтандартныеРеквизитыСправочника = СправочникОбъект.Метаданные().СтандартныеРеквизиты;
	Для каждого КлючИЗначение Из СтруктураПроверяемыхРеквизитов Цикл
		Если НоменклатураВДокументахКлиентСервер.ЕстьРеквизитОбъекта(КлючИЗначение.Ключ, СтандартныеРеквизитыСправочника) = Истина Тогда
			Продолжить;
		КонецЕсли;
		Если РеквизитыСправочника.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПроверяемыхРеквизитов.Удалить(КлючИЗначение.Ключ);
	КонецЦикла;
	
 	Возврат СтруктураПроверяемыхРеквизитов;
	
КонецФункции

#КонецОбласти

Функция HTMLСсылка(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	ИнформационнаяБазаЗарегистрирована = Ложь;
	#Если НЕ ВнешнееСоединение Тогда
		ИнформационнаяБазаЗарегистрирована = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	#КонецЕсли
	
	Если ИнформационнаяБазаЗарегистрирована Тогда
		Если УправлениеНебольшойФирмойПовтИсп.ДоступныМеханизмы8_3_11() Тогда
			Возврат ПолучитьНавигационнуюСсылку(Ссылка);
		Иначе
			Возврат Строка(Ссылка);
		КонецЕсли;
	ИначеЕсли УправлениеНебольшойФирмойПовтИсп.ИспользоватьЧатВОбсуждениях() Тогда
		СсылкаСтрокой = Строка(Ссылка);
		СсылкаСтрокой = СтрЗаменить(СсылкаСтрокой, " (не проведен)", "");
		СсылкаСтрокой = СтрЗаменить(СсылкаСтрокой, " (удален)", "");
		
		Возврат "<A HREF='"+ПолучитьНавигационнуюСсылку(Ссылка)+"'>"+СсылкаСтрокой+"</A>";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция HTMLСсылкаДляСтарыхКомментариев(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	СсылкаСтрокой = Строка(Ссылка);
	СсылкаСтрокой = СтрЗаменить(СсылкаСтрокой, " (не проведен)", "");
	СсылкаСтрокой = СтрЗаменить(СсылкаСтрокой, " (удален)", "");
	
	Возврат "<A HREF='"+ПолучитьНавигационнуюСсылку(Ссылка)+"'>"+СсылкаСтрокой+"</A>";
	
КонецФункции

Процедура ЗаменитьТехническиеСимволы(Комментарий)
	
	Комментарий = СтрЗаменить(Комментарий, "<", "&lt;");
	Комментарий = СтрЗаменить(Комментарий, ">", "&gt;");
	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистрОбсуждения(Комментарий, Ссылка, МоментВремени, Системный, Пользователь)
	
	Менеджер = РегистрыСведений.Обсуждения.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Ссылка;
	Менеджер.МоментВремени = ?(НЕ ЗначениеЗаполнено(МоментВремени), ТекущаяДатаСеанса(), МоментВремени);
	Менеджер.Комментарий = Комментарий;
	Менеджер.Системный = Системный;
	Менеджер.Пользователь = Пользователь;
	Менеджер.Записать(Истина);
	
КонецПроцедуры

Процедура ИспользованиеРеглЗаданияЗаписьСообщенийВСистемуВзаимодействия(Использование)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяПользователя = "";
	Если Пользователи.АвторизованныйПользователь() = Пользователи.СсылкаНеуказанногоПользователя(Ложь) Тогда
		ПользовательАссистент = АссистентУправления.ПользовательАссистент();
		Если ПользовательАссистент <> Неопределено И ПользовательАссистент <> Справочники.Пользователи.ПустаяСсылка() Тогда
			ИмяПользователя = Пользователи.СвойстваПользователяИБ(ПользовательАссистент.ИдентификаторПользователяИБ).Имя;
		КонецЕсли;
	Иначе
		ИмяПользователя = Строка(ПользователиИнформационнойБазы.ТекущийПользователь().Имя)
	КонецЕсли;
	
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ЗаписьСообщенийВСистемуВзаимодействия));
	Если МассивЗаданий.Количество()=0 Тогда
		
		Если Использование = Истина Тогда
			
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ЗаписьСообщенийВСистемуВзаимодействия);
			Задание.Использование = Использование;
			Задание.ИмяПользователя = ИмяПользователя;
			Задание.Ключ = "ЗаписьСообщенийВСистемуВзаимодействия";
			Задание.Наименование = "Запись сообщений в систему взаимодействия";
			Задание.Расписание = РасписаниеРегламентногоЗаданияПоУмолчанию();
			Задание.Записать();
			
		КонецЕсли;
		
	Иначе
		Задание = МассивЗаданий[0];
		Если Задание.Использование <> Использование ИЛИ НЕ Задание.ИмяПользователя = Строка(ПользователиИнформационнойБазы.ТекущийПользователь().Имя) Тогда
			Задание.Использование = Использование;
			Задание.ИмяПользователя = ИмяПользователя;
			Задание.Записать();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция РасписаниеРегламентногоЗаданияПоУмолчанию()
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);
	
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание							= Новый РасписаниеРегламентногоЗадания;
	Расписание.ДниНедели				= ДниНедели;
	Расписание.ПериодПовтораВТечениеДня	= 300; // 5 минут
	Расписание.ПериодПовтораДней		= 1; // каждый день
	Расписание.Месяцы					= Месяцы;
	
	Возврат Расписание;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаТекстаСообщения

Процедура ПреобразоватьСсылкиПользователей(Текст, ПользователиРассылки)
	
	ОписанияПользователей = МассивОписанийПользователей();
	Для каждого Элемент Из ОписанияПользователей Цикл
		Если СтрНайти(Текст, "@"+Элемент.Имя)=0 Тогда
			Продолжить;
		КонецЕсли;
		Текст = СтрЗаменить(Текст, "@"+Элемент.Имя, HTMLСсылка(Элемент.Пользователь));
		ПользователиРассылки.Добавить(Элемент.Пользователь);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОбновитьПредставлениеОбъектаВНавигационнойСсылке(ТекстКомментария)
	
	Текст = ТекстКомментария;
	
	НачалоСсылки = СтрНайти(Текст, "<A HREF='");
	Пока НачалоСсылки>0 Цикл
		КонецСсылки = СтрНайти(Текст, "'>");
		КонецОбъекта= СтрНайти(Текст, "</A>");
		ОписаниеОбъекта = Сред(Текст, КонецСсылки+2, КонецОбъекта-КонецСсылки-2);
		
		ДлинаСсылки = КонецСсылки - НачалоСсылки;
		НС = Сред(Текст, НачалоСсылки+9, ДлинаСсылки-9);
		НС = СтрЗаменить(НС, "<BR>","");
		Если СокрЛП(НС)="" Тогда
			//Перечисления
			СсылкаОбъекта = ОписаниеОбъекта;
		Иначе
			СсылкаОбъекта = ПолучитьСсылкуИзНавигационной(НС);
		КонецЕсли;
	
		ТекстКомментария = СтрЗаменить(ТекстКомментария, 
				ОписаниеОбъекта,
				Строка(СсылкаОбъекта)
				);
		Текст = Сред(Текст, КонецОбъекта+4, СтрДлина(Текст));
		НачалоСсылки = СтрНайти(Текст, "<A HREF='");
	КонецЦикла; 
	
КонецПроцедуры	

Функция ПредставлениеРеквизита(МетаданныеОбъекта, Имя)
	
	Реквизит=МетаданныеОбъекта.Реквизиты.Найти(Имя);
	Если НЕ Реквизит=Неопределено Тогда
		Возврат ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
	КонецЕсли;
	
	Для каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя=Имя Тогда
			Возврат ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Имя;
	
КонецФункции

Функция УдалитьТеги(Текст)
	
	Результат = "";
	Остаток = Текст;
	Позиция = СтрНайти(Остаток, "<");
	Пока Позиция>0 Цикл
		Результат = Результат+Лев(Остаток, Позиция-1);
		Остаток = Сред(Остаток, Позиция);
		ПозицияКонца = СтрНайти(Остаток, ">");
		Если ПозицияКонца=0 Тогда
			Остаток = "";
			Прервать;
		КонецЕсли; 
		Тег = Лев(Остаток, ПозицияКонца);
		Если ВРег(Тег)="<BR>" Тогда
			Результат = Результат+Символы.ПС;
		Иначе
			Остаток = Сред(Остаток, ПозицияКонца+1);
		КонецЕсли;
		Позиция = СтрНайти(Остаток, "<");
	КонецЦикла;
	Результат = Результат+Остаток;
	Возврат Результат;
	
КонецФункции

Процедура ОформитьСистемныйТекст(Текст)
	
	Текст = Новый ФорматированнаяСтрока("#" + Текст, Новый Шрифт(,,,Истина));
	
КонецПроцедуры

Функция ПолучитьСсылкуИзНавигационной(НС) Экспорт
	
	Если СтрНайти(НС, "e1cib/list/") > 0 Тогда
		Возврат ПредопределенноеЗначение(Сред(НС, 12) + ".ПустаяСсылка").Метаданные().ПредставлениеСписка;
	КонецЕсли;
	
	ПерваяТочка = СтрНайти(НС, "e1cib/data/");
	ВтораяТочка = СтрНайти(НС, "?ref=");
	ТретьяТочка = СтрНайти(НС, "'>");
	
	ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
	ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
	ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
	Если ТретьяТочка> 0 Тогда
		КонецНС = Прав(НС, СтрДлина(НС) - ТретьяТочка+1);
		ЗначениеСсылки = СтрЗаменить(ЗначениеСсылки, КонецНС, "");
	КонецЕсли;
	Попытка
		Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	Исключение
		Возврат НСтр("ru = 'Ошибка преобразования: '")+НС;
	КонецПопытки; 
	
КонецФункции

Функция НайтиСокращения(Знач ТекстСообщения, массивСокращений)
	
	НачалоНССокращения = СтрНайти(ТекстСообщения, "e1cib/data/Справочник.СообщенияОбсуждений");
	Если НачалоНССокращения > 0 Тогда
		
		текстСправа = Сред(ТекстСообщения, НачалоНССокращения);
		ПервыйПробел = СтрНайти(текстСправа, " ");
		конецНССокращения = ?(ПервыйПробел=0, СтрДлина(текстСправа), ПервыйПробел);
		текстНС = Сред(текстСправа, 1, конецНССокращения);
		
		ссылкаСправочника = ПолучитьСсылкуИзНавигационной(текстНС);
		Если НЕ ТипЗнч(ссылкаСправочника) = Тип("Строка") Тогда
		
			массивСокращений.Добавить(ссылкаСправочника);
			
			НайтиСокращения(Сред(текстСправа, конецНССокращения+1), массивСокращений);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция СократитьТекстСообщения(ТекстСообщения, Объект, Заголовок="")
	
	ПервыйПробелПослеОграничения = СтрНайти(ТекстСообщения, " ", НаправлениеПоиска.СНачала, ДлинаСообщения());
	Если ПервыйПробелПослеОграничения = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПолноеСообщение = Справочники.СообщенияОбсуждений.СоздатьЭлемент();
	ПолноеСообщение.Наименование = Заголовок;
	ПолноеСообщение.ПолныйТекст = ТекстСообщения;
	ПолноеСообщение.Объект = Объект.Ссылка;
	Попытка
		ПолноеСообщение.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	НСсылка = ПолучитьНавигационнуюСсылку(ПолноеСообщение.Ссылка);
	
	
	ТекстСообщения = Лев(ТекстСообщения, ПервыйПробелПослеОграничения) + " " + НСсылка;
	
	Возврат ПолноеСообщение.Ссылка;
	
КонецФункции

//Задает длину текстового сообщения, начиная с которой оставщееся сообщение обрезается до трёх точек, 
// и будет записано в виде ссылки на полное сообщение в справочник СообщенияОбсуждений
Функция ДлинаСообщения()
	
	Возврат 100;
	
КонецФункции

Процедура ДобавитьСтроку(Строка, ДобавляемаяСтрока)
	
	Если ПустаяСтрока(ДобавляемаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		Строка = Строка + Символы.ПС;
	КонецЕсли;
	
	Строка = "" + Строка + ДобавляемаяСтрока;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаписатьОшибкуВЖР(ИмяСобытия, Комментарий, Ссылка)
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия, 
		УровеньЖурналаРегистрации.Ошибка,
		,
		Ссылка,
		Комментарий
		);
	
КонецПроцедуры

Процедура СформироватьНапоминанияПользователям(Ссылка, Пользователь, Комментарий, ПользователиРассылки)
	
	Если НЕ (РольДоступна(Метаданные.Роли.ИспользованиеОбсуждений)
		ИЛИ РольДоступна(Метаданные.Роли.ПолныеПрава))
		Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ПользовательРассылки Из ПользователиРассылки Цикл
		Напоминание = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
		Напоминание.Описание = ""+Пользователь+": "+УдалитьТеги(Комментарий);
		Напоминание.СрокНапоминания = ТекущаяДатаСеанса();
		Напоминание.ВремяСобытия = ТекущаяДатаСеанса();
		Напоминание.Пользователь = ПользовательРассылки;
		Напоминание.Источник = Ссылка;
		Напоминание.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
		Напоминание.ПредставлениеИсточника = Строка(Ссылка);
		Напоминание.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРодительскийДокумент(ДокументСсылка)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	мУжеВСписке = Новый Соответствие;
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			
			Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
				 И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		Если МетаданныеДокумента = Метаданные.Документы.СверкаВзаиморасчетов Тогда
			
			Прервать;
			
		КонецЕсли;
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И Метаданные.Документы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	возврат СписокРеквизитов;
	
КонецФункции

// Устанавливает функциональную опцию ИспользоватьНапоминанияПользователя=Истина при обновлении версии конфигурации.
// 
// Параметры:
//  СтруктураПараметров    - Структура - Входящие параметры при обновлении
//				ОбработкаЗавершена - Булево - признак окончания процедуры обработки
Процедура ВключитьФОИспользоватьНапоминанияПользователяПриОбновлении(СтруктураПараметров) Экспорт
	
	Попытка
		
		Константы.ИспользоватьНапоминанияПользователя.Установить(Истина);
		СтруктураПараметров.ОбработкаЗавершена = Истина;
		
	Исключение
		// запись ЖР
	КонецПопытки;
	
КонецПроцедуры

Функция ПреобразоватьНавигационныеСсылки(Комментарий)
	
	МассивСсылок = Новый Массив;
	МассивНавигационныхСсылок = Новый Массив;
	
	МассивСтрок = СтрРазделить(Комментарий, Символы.ПС, Ложь);
	Комментарий = "";
	
	Для каждого строкаКомментария Из МассивСтрок Цикл
	
		Остаток = строкаКомментария;
		
		Позиция = СтрНайти(Остаток, "e1cib");
		Пока Позиция>0 Цикл
			Комментарий = Комментарий+Лев(Остаток, Позиция-1);
			Остаток = Сред(Остаток, Позиция);
			Позиция = СтрНайти(Остаток, " ");
			СловоПосле = ?(Позиция=0, Остаток, Лев(Остаток, Позиция-1));
			Остаток = ?(Позиция=0, "", Сред(Остаток, Позиция));
			
			ТретьяТочка = СтрНайти(СловоПосле, "'>");
			Если ТретьяТочка> 0 Тогда
				КонецНС = Прав(СловоПосле, СтрДлина(СловоПосле) - ТретьяТочка+1);
				СловоПослеДляСсылки = СтрЗаменить(СловоПосле, КонецНС, "");
				МассивНавигационныхСсылок.Добавить(СловоПослеДляСсылки);
			Иначе
				МассивНавигационныхСсылок.Добавить(СловоПосле);
			КонецЕсли;
			
			Комментарий = Комментарий+"<A HREF='"+СловоПосле+"'>%"+Формат(МассивНавигационныхСсылок.Количество(), "ЧГ=0")+"</A>";
			СсылкаНаОбъект = ПолучитьСсылкуИзНавигационной(СловоПосле);
			Если НЕ (СтрНайти(СловоПосле, "e1cib/list/") > 0 
				ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("Строка")) 
				Тогда
				МассивСсылок.Добавить(СсылкаНаОбъект);
			КонецЕсли;
			Позиция = СтрНайти(Остаток, "e1cib");
		КонецЦикла;
		Комментарий = Комментарий + Остаток;
		ПредставленияСсылок = ПолучитьПредставленияНавигационныхСсылок(МассивНавигационныхСсылок);
		Индекс = ПредставленияСсылок.Количество();
		Пока Индекс>0 Цикл
			ПредставленияСсылокТекст = ПредставленияСсылок[Индекс-1];
			Если ПредставленияСсылокТекст = Неопределено Тогда
				Представление = СсылкаНаОбъект;
			Иначе	
				Представление = ПредставленияСсылокТекст.Текст;
			КонецЕсли; 
			
			Комментарий = СтрЗаменить(Комментарий, "%"+Формат(Индекс, "ЧГ=0"), Представление);
			Индекс = Индекс-1;
		КонецЦикла;
		
		Если НЕ МассивСтрок[МассивСтрок.Количество()-1] = строкаКомментария Тогда
			//Если это не последняя строка, добавим перенос строки
			Комментарий = Комментарий + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла; 
	
	возврат МассивСсылок;
	
КонецФункции

//Возвращает данные присоединенного файла для открытия по нажатию на навигационную ссылку в обсуждениях
Функция ПолучитьДанныеФайлаСправочникаПоНавигационнойСсылке(СтрокаНавигационнойСсылкиСправочника) Экспорт

	СсылкаПрисоединенныеФайлы = ПолучитьСсылкуИзНавигационной(СтрокаНавигационнойСсылкиСправочника);
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(СсылкаПрисоединенныеФайлы,	Неопределено);
	
	Возврат ДанныеФайла;
			
КонецФункции

// Обработчик регламентного задания ЗаписьСообщенийВСистемуВзаимодействия.
//
Процедура ЗаписатьОтложенныеСообщенияВСистемуВзаимодействия() Экспорт
	
	#Если НЕ ВнешнееСоединение Тогда
		
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗаписьСообщенийВСистемуВзаимодействия);
	
	ИнформационнаяБазаЗарегистрирована = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	Если ИнформационнаяБазаЗарегистрирована = Ложь ИЛИ ИнформационнаяБазаЗарегистрирована = Неопределено Тогда
		
		ИспользованиеРеглЗаданияЗаписьСообщенийВСистемуВзаимодействия(Ложь);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьСообщенийСистемыВзаимодействия.Объект КАК Ссылка,
	|	ОчередьСообщенийСистемыВзаимодействия.МоментВремени КАК МоментВремени,
	|	ОчередьСообщенийСистемыВзаимодействия.Пользователь КАК Пользователь,
	|	ОчередьСообщенийСистемыВзаимодействия.Комментарий КАК Комментарий,
	|	ОчередьСообщенийСистемыВзаимодействия.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	|	ОчередьСообщенийСистемыВзаимодействия.Данные КАК Данные,
	|	ОчередьСообщенийСистемыВзаимодействия.Действия КАК Действия,
	|	ОчередьСообщенийСистемыВзаимодействия.Получатель КАК Получатель,
	|	ОчередьСообщенийСистемыВзаимодействия.Получатель.ИдентификаторПользователяИБ КАК ПолучательИдентификаторПользователяИБ,
	|	ОчередьСообщенийСистемыВзаимодействия.Системный КАК Системный
	|ИЗ
	|	РегистрСведений.ОчередьСообщенийСистемыВзаимодействия КАК ОчередьСообщенийСистемыВзаимодействия
	|ИТОГИ ПО
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	ВыборкаОбъект = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбъект.Количество()=0 Тогда
		
		Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
			ИспользованиеРеглЗаданияЗаписьСообщенийВСистемуВзаимодействия(Ложь);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Пока ВыборкаОбъект.Следующий() Цикл
		
		Попытка
			Если ТипЗнч(ВыборкаОбъект.Ссылка) = Тип("Строка") Тогда
				Обсуждение = ПолучитьОбсуждение(ВыборкаОбъект.Ссылка);
			Иначе
				Обсуждение = ПолучитьКонтекстноеОбсуждение(ВыборкаОбъект.Ссылка);
			КонецЕсли;
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ЗаписатьОшибкуВЖР(
				НСтр("ru = 'Получение сообщений системы взаимодействия'",ОбщегоНазначения.КодОсновногоЯзыка()),
				ТекстОшибки, ВыборкаОбъект.Ссылка);
			Если СтрНайти(ТекстОшибки, "Пользователь не авторизован") > 0 Тогда
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецПопытки;
		
		// Снимаем наблюдение, чтобы пользователь не получал уведомление сам себе.
		НужноСнятьВернутьНаблюдение = Пользователи.АвторизованныйПользователь() = ВыборкаОбъект.Пользователь;
		
		Если НужноСнятьВернутьНаблюдение Тогда
			НужноСнятьВернутьНаблюдение = СистемаВзаимодействия.ПолучитьРежимНаблюдения(Обсуждение.Идентификатор);
		КонецЕсли;
		
		Если НужноСнятьВернутьНаблюдение Тогда
			СистемаВзаимодействия.УстановитьРежимНаблюдения(Обсуждение.Идентификатор, Ложь);
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		
		ВыборкаЗапись = ВыборкаОбъект.Выбрать();
		Пока ВыборкаЗапись.Следующий() Цикл
			
			Если ВыборкаЗапись.ИдентификаторПользователяИБ = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
				Продолжить;
			КонецЕсли;
			
			Текст = ВыборкаЗапись.Комментарий;
			МассивСокращений = Новый Массив;
			
			Если ВыборкаЗапись.Системный Тогда
				ОформитьСистемныйТекст(Текст);
				НайтиСокращения(Текст, МассивСокращений);
			КонецЕсли;
			
			НовоеСообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
			НовоеСообщение.Текст = Текст;
			НовоеСообщение.Дата = ВыборкаЗапись.МоментВремени;
			НовоеСообщение.Автор = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ВыборкаЗапись.ИдентификаторПользователяИБ);
			
			Если ЗначениеЗаполнено(ВыборкаЗапись.Получатель) Тогда
				Попытка
					НовоеСообщение.Получатели.Добавить(СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ВыборкаЗапись.ПолучательИдентификаторПользователяИБ));
				Исключение
					// Указанный пользователь Еще не подключен к Системе взаимодействия, игнорируем получателя сообщения.
					ТекстОшибки = ОписаниеОшибки();
					ЗаписатьОшибкуВЖР(
						НСтр("ru = 'Запись нового сообщения системы взаимодействия'",ОбщегоНазначения.КодОсновногоЯзыка()),
						ТекстОшибки, ВыборкаОбъект.Ссылка);
				КонецПопытки;
			КонецЕсли;
			
			Данные = ВыборкаЗапись.Данные.Получить();
			Если Данные <> Неопределено Тогда
				НовоеСообщение.Данные = Данные;
			КонецЕсли;
			
			Действия = ВыборкаЗапись.Действия.Получить();
			Если ТипЗнч(Действия) = Тип("СписокЗначений") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Действия, НовоеСообщение.Действия);
			КонецЕсли;
			
			Если НЕ ТранзакцияАктивна() Тогда
			
				НачатьТранзакцию();
				
				БлокировкаДанных		= Новый БлокировкаДанных;
				ЭлементБлокировки		= БлокировкаДанных.Добавить("РегистрСведений.ОчередьСообщенийСистемыВзаимодействия");
				ЭлементБлокировки.УстановитьЗначение("Объект", ВыборкаОбъект.Ссылка);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				Попытка
					БлокировкаДанных.Заблокировать();
				Исключение
					ТекстОшибки = ОписаниеОшибки();
					ЗаписатьОшибкуВЖР(
						НСтр("ru = 'Запись отложенного сообщения в систему взаимодействия '",ОбщегоНазначения.КодОсновногоЯзыка()),
						ТекстОшибки, ВыборкаОбъект.Ссылка);
						
					ОтменитьТранзакцию();
					Прервать;
					
				КонецПопытки;
			
			КонецЕсли; 
			
			Попытка
				НовоеСообщение.Записать();
			Исключение
				ЕстьОшибки = Истина;
				
				ТекстОшибки = ОписаниеОшибки();
				ЗаписатьОшибкуВЖР(
					НСтр("ru = 'Запись нового сообщения системы взаимодействия'",ОбщегоНазначения.КодОсновногоЯзыка()),
					ТекстОшибки, ВыборкаОбъект.Ссылка);
					
				ОтменитьТранзакцию();
				Прервать;
				
			КонецПопытки;
		КонецЦикла;
		
		// Удалим переданные записи из регистра очереди.
		Если НЕ ЕстьОшибки Тогда
			НаборЗаписейОбъект = РегистрыСведений.ОчередьСообщенийСистемыВзаимодействия.СоздатьНаборЗаписей();
			НаборЗаписейОбъект.Отбор.Объект.Установить(ВыборкаОбъект.Ссылка);
			Попытка
				НаборЗаписейОбъект.Записать();
			Исключение
				ЕстьОшибки = Истина;
				ТекстОшибки = ОписаниеОшибки();
				ЗаписатьОшибкуВЖР(
					НСтр("ru = 'Удаление записи регистра ОчередьСообщенийСистемыВзаимодействия'",ОбщегоНазначения.КодОсновногоЯзыка()),
					ТекстОшибки, ВыборкаОбъект.Ссылка);
					
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
			КонецПопытки;
				
			Если МассивСокращений.Количество() > 0 Тогда
				Для каждого элСокращения Из МассивСокращений Цикл
					ПолноеСообщение = элСокращения.ПолучитьОбъект();
					ПолноеСообщение.ИдентификаторСообщения = НовоеСообщение.Идентификатор;
					ПолноеСообщение.Записать();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ТранзакцияАктивна() Тогда
			
			Если ЕстьОшибки Тогда
				ОтменитьТранзакцию();
			Иначе
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
		КонецЕсли; 
		
		//Возвращаем наблюдение
		Если НужноСнятьВернутьНаблюдение Тогда
			СистемаВзаимодействия.УстановитьРежимНаблюдения(Обсуждение.Идентификатор, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецЕсли

КонецПроцедуры

Процедура ПопытатьсяСоздатьСообщениеСистемыВзаимодействия(ДанныеСообщения) Экспорт
	
	#Если НЕ ВнешнееСоединение Тогда
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	Попытка
		Если ТипЗнч(ДанныеСообщения.Объект) = Тип("ИдентификаторОбсужденияСистемыВзаимодействия") Тогда
			Обсуждение = ПолучитьОбсуждение(ДанныеСообщения.Объект);
		Иначе
			Обсуждение = ПолучитьКонтекстноеОбсуждение(ДанныеСообщения.Объект);
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписатьДанныеВРегистрОчереди(ДанныеСообщения);
		ЗаписатьОшибкуВЖР(
			НСтр("ru = 'Получение сообщений системы взаимодействия'",ОбщегоНазначения.КодОсновногоЯзыка()),
			ТекстОшибки, ДанныеСообщения.Объект);
		Возврат;
	КонецПопытки;
	
	Если Обсуждение.КонтекстОбсуждения <> Неопределено Тогда
		//Снимаем наблюдение, чтобы пользователь не получал уведомление сам себе
		БылРежимНаблюдения = СистемаВзаимодействия.ПолучитьРежимНаблюдения(Обсуждение.Идентификатор);
		Если БылРежимНаблюдения Тогда
			СистемаВзаимодействия.УстановитьРежимНаблюдения(Обсуждение.Идентификатор, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Текст = ДанныеСообщения.Текст;
	Если ДанныеСообщения.Системный Тогда
		ОформитьСистемныйТекст(Текст);
	КонецЕсли;
	
	Попытка
		//Создаем сообщение
		НовоеСообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
		НовоеСообщение.Текст = Текст;
		НовоеСообщение.Дата = ДанныеСообщения.Дата;
		НовоеСообщение.Автор = ИдентификаторПользователя(ДанныеСообщения.Автор);
		
		Если ЗначениеЗаполнено(ДанныеСообщения.Получатель) Тогда
			НовоеСообщение.Получатели.Добавить(ИдентификаторПользователя(ДанныеСообщения.Получатель));
		КонецЕсли;
		
		Если ДанныеСообщения.Данные <> Неопределено Тогда
			НовоеСообщение.Данные = ДанныеСообщения.Данные;
		КонецЕсли;
		
		Если ДанныеСообщения.Действия <> Неопределено И ТипЗнч(ДанныеСообщения.Действия) = Тип("СписокЗначений") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеСообщения.Действия, НовоеСообщение.Действия);
		КонецЕсли;
		
		НовоеСообщение.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписатьДанныеВРегистрОчереди(ДанныеСообщения);
		ЗаписатьОшибкуВЖР(
			НСтр("ru = 'Запись нового сообщения системы взаимодействия'",ОбщегоНазначения.КодОсновногоЯзыка()),
			ТекстОшибки, ДанныеСообщения.Объект);
	КонецПопытки;
	
	Если Обсуждение.КонтекстОбсуждения <> Неопределено Тогда
		//Возвращаем наблюдение
		Если БылРежимНаблюдения Тогда
			СистемаВзаимодействия.УстановитьРежимНаблюдения(Обсуждение.Идентификатор, Истина);	
		КонецЕсли;
	КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

// См. функцию ПолучитьСообщение().
//
Функция ПолучитьСообщениеРекурсивно(ОбсуждениеИдентификатор, СообщениеИдентификатор, СообщениеИдентификаторПосле = Неопределено)
	
	#Если НЕ ВнешнееСоединение Тогда
	Отбор = Новый ОтборСообщенийСистемыВзаимодействия;
	Отбор.Обсуждение = ОбсуждениеИдентификатор;
	Если ЗначениеЗаполнено(СообщениеИдентификаторПосле) Тогда
		Отбор.После = СообщениеИдентификатор;
	КонецЕсли;
	
	Сообщения = СистемаВзаимодействия.ПолучитьСообщения(Отбор);
	
	Если Сообщения.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru='Сообщение не найдено.'");
	КонецЕсли;
	
	Для каждого Сообщение Из Сообщения Цикл
		Если Сообщение.Идентификатор = СообщениеИдентификатор Тогда
			Возврат Сообщение;
		КонецЕсли;
	КонецЦикла;
	
	ПолучитьСообщениеРекурсивно(ОбсуждениеИдентификатор, СообщениеИдентификатор, Сообщения[Сообщения.ВГраница()]);
	#КонецЕсли
	
КонецФункции

Процедура ЗаписатьДанныеВРегистрОчереди(ДанныеСообщения)
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеСообщения, НовыйДанныеСообщения(), Ложь);
	
	Менеджер = РегистрыСведений.ОчередьСообщенийСистемыВзаимодействия.СоздатьМенеджерЗаписи();
	Менеджер.Объект        = ДанныеСообщения.Объект;
	Менеджер.МоментВремени = ?(ЗначениеЗаполнено(ДанныеСообщения.Дата), ДанныеСообщения.Дата, ТекущаяДатаСеанса());
	Менеджер.Комментарий   = ДанныеСообщения.Текст;
	Менеджер.Пользователь  = ДанныеСообщения.Автор;
	Если ТипЗнч(ДанныеСообщения.Данные) <> Неопределено Тогда
		Менеджер.Данные    = Новый ХранилищеЗначения(ДанныеСообщения.Данные);
	КонецЕсли;
	Если ТипЗнч(ДанныеСообщения.Действия) = Тип("СписокЗначений") И ДанныеСообщения.Действия.Количество() > 0 Тогда
		Менеджер.Действия  = Новый ХранилищеЗначения(ДанныеСообщения.Действия);
	КонецЕсли;
	Менеджер.Получатель    = ДанныеСообщения.Получатель;
	Менеджер.Системный     = ДанныеСообщения.Системный;
	Менеджер.Записать(Истина);
	
	ИспользованиеРеглЗаданияЗаписьСообщенийВСистемуВзаимодействия(Истина);
	
КонецПроцедуры

Процедура ЗаписатьВОчередьСистемыВзаимодействия(ДанныеСообщения)
	
	Если НЕ ЗначениеЗаполнено(ДанныеСообщения.Автор) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСообщения.Автор) = Тип("СправочникСсылка.Пользователи")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Автор, "Служебный") Тогда
		//Нельзя записать сообщение от имени служебного пользователя
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеВРегистрОчереди(ДанныеСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ТекущиеДела

// Заполняет список текущих дел пользователя.
// Описание параметров процедуры см. в ТекущиеДелаСлужебный.НоваяТаблицаТекущихДел()
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ГруппаДел	= НСтр("ru = 'Напоминания'");
	ИмяФормы	= "РегистрСведений.НапоминанияПользователя.Форма.МоиНапоминания";
	
	ОбщиеПараметрыЗапросов = ТекущиеДелаСлужебный.ОбщиеПараметрыЗапросов();
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя")
		Или Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.НапоминанияПользователя)
		Или ТекущиеДелаСервер.ДелоОтключено(ГруппаДел) Тогда
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(*) КАК МоиНапоминанияВсегоНапоминаний
		|ИЗ
		|	РегистрСведений.НапоминанияПользователя КАК РегистрСведенийНапоминанияПользователя
		|ГДЕ
		|	РегистрСведенийНапоминанияПользователя.Пользователь = &Пользователь";
	
	ДанныеДел = ТекущиеДелаСлужебный.ЧисловыеПоказателиТекущихДел(Запрос, ОбщиеПараметрыЗапросов);
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор	 = "МоиНапоминанияВсегоНапоминаний";
	Дело.ЕстьДела		= ДанныеДел.МоиНапоминанияВсегоНапоминаний > 0;
	Дело.Важное			= Ложь;
	Дело.Представление	= НСтр("ru = 'Мои напоминания'");
	Дело.Количество		= ДанныеДел.МоиНапоминанияВсегоНапоминаний;
	Дело.Форма			= ИмяФормы;
	Дело.ПараметрыФормы	= Новый Структура;
	Дело.Владелец		= ГруппаДел;
	Дело.Подсказка		= "";
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсРабочегоПроцесса

// Интерфейс рабочего процесса для создания напоминаний
//
Процедура СоставПолейЗаполненияДляРабочегоПроцесса(ТаблицаОписанияПолей, знач ТипДействия) Экспорт
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= "Пользователь";
	НовоеОписание.Заголовок					= НСтр("ru='Кому напомнить'");
	НовоеОписание.ВариантЗаполнения			= "ИзОснования";
	НовоеОписание.ТипЗначения				= Метаданные.РегистрыСведений.НапоминанияПользователя.Измерения.Пользователь.Тип;
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= "ВремяСобытия";
	НовоеОписание.Заголовок					= НСтр("ru='Дата напоминания'");
	НовоеОписание.ВариантЗаполнения			= "Смещение";
	НовоеОписание.ТипЗначения				= ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
КонецПроцедуры

#КонецОбласти
