
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура обработчик события ПриСозданииНаСервере.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если (Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас)
			И (Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.ПодарочныйСертификат) Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены контрагентов можно вводить только для номенклатуры с типами Запас, Сертификат'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Наборы
	Если НЕ Элементы.Список.ТолькоПросмотр И ТипЗнч(ВладелецФормы)=Тип("УправляемаяФорма") И ВладелецФормы.ИмяФормы="Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		ОбъектНоменклатура = ВладелецФормы.Объект;
		
		Если ОбъектНоменклатура.ЭтоНабор И ОбъектНоменклатура.СпособРасчетаЦеныНабора=ПредопределенноеЗначение("Перечисление.СпособыРасчетаЦеныНабора.СкладыватьИзЦенКомплектующих") Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены контрагентов недоступны для наборов со способом расчета цен по комплектующим'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли; 	
	// Конец Наборы
	
КонецПроцедуры

