
#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют обрабатываемые события и действия.
// Модуль должен обязательно содержать процедуры:
//  ПриОпределенииСобытий
//  ПриОпределенииДействий
//
Процедура ПриОпределенииИсточников(Источники) Экспорт
	
	Источники.Добавить("Документы.ЗаказПокупателя");
	Источники.Добавить("Документы.ЗаказПоставщику");
	Источники.Добавить("Документы.ЗаказНаПроизводство");
	Источники.Добавить("Документы.Событие");
	Источники.Добавить("РаботаСБонусами");
	Источники.Добавить("СостоянияЗаказов");
	
КонецПроцедуры

Процедура ПриОпределенииДействий(Действия) Экспорт
	
КонецПроцедуры

Процедура ВыполнитьДействие(Предмет, Действие, ЗначенияЗаполнения, ДополнительныеПараметры, Результат) Экспорт
	
КонецПроцедуры

#КонецОбласти
