
#Область ПрограмныйИнтерфейс

Функция АдресЭлектроннойПочтыЗаполнен(Форма, КакСвязаться) Экспорт
	
	Если ЗначениеЗаполнено(КакСвязаться) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИндексСтроки = Форма.Объект.Участники.Индекс(Форма.Элементы.Получатели.ТекущиеДанные);
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru='Не заполнен адрес электронной почты.'"),,
		СтрШаблон("Объект.Участники[%1].КакСвязаться", Формат(ИндексСтроки, "ЧГ=")));
	
	Возврат Ложь;
	
КонецФункции

Функция КонтактУжеСоздан(Контакт, ТекстСообщения, Форма) Экспорт
	
	Если ТипЗнч(Контакт) <> Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИндексСтроки = Форма.Объект.Участники.Индекс(Форма.Элементы.Получатели.ТекущиеДанные);
	ОбщегоНазначенияКлиент.СообщитьПользователю(
	ТекстСообщения,,
	СтрШаблон("Объект.Участники[%1].Контакт", Формат(ИндексСтроки, "ЧГ=")));
	
	Возврат Истина;
	
КонецФункции

Функция КонтрагентУжеСоздан(Контакт, ТекстСообщения, Форма) Экспорт
	
	Если ТипЗнч(Контакт) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИндексСтроки = Форма.Объект.Участники.Индекс(Форма.Элементы.Получатели.ТекущиеДанные);
	ОбщегоНазначенияКлиент.СообщитьПользователю(
	ТекстСообщения,,
	СтрШаблон("Объект.Участники[%1].Контакт", Формат(ИндексСтроки, "ЧГ=")));
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПоказатьВыборИзКлассификатораКонтактов(Форма, ИмяЭлементаКонтрагент = "Контрагент") Экспорт
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Элемент", Форма.Элементы[ИмяЭлементаКонтрагент]);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ОбработатьВыборИзКлассификатораКонтактов",
	ЭтотОбъект,
	ПараметрыОбработчика);
	
	Форма.ПоказатьВыборИзМеню(
	ОписаниеОповещения,
	Форма.СписокАвтоПодбораКонтрагента,
	ПараметрыОбработчика.Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборИзКлассификатораКонтактов(ВыбранноеЗначение, Параметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("ЭлементСпискаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("КлассификаторДляЗаполненияКИ", ВыбранноеЗначение.Значение);
	ПараметрыФормы.Вставить("СопоставитьКонтактИАдресЭПВСобытияхПослеЗаписиОбъекта", Истина);
	УправлениеНебольшойФирмойКлиент.ДополнитьПараметрыФормыИзПараметровВыбораЭлемента(ПараметрыФормы, Параметры.Элемент);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, Параметры.Элемент);
	
КонецПроцедуры


#КонецОбласти