
Процедура ЗаполнитьХозяйственнуюОперациюВНабореЗаписей(НаборЗаписей) Экспорт
	
	Регистратор = НаборЗаписей.Отбор.Регистратор.Значение;
	РегистраторМетаданные = Регистратор.Метаданные();
	Если РегистраторМетаданные.Реквизиты.Найти("ХозяйственнаяОперация") <> Неопределено Тогда
		ХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "ХозяйственнаяОперация");
		Для Каждого Движение Из НаборЗаписей Цикл
			Движение.ХозяйственнаяОперация = ХозяйственнаяОперация;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры