///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейКлиентПереопределяемый.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет открытие Интернет-страницы в конфигурации, если для открытия
// Интернет-страниц в конфигурации предусмотрены собственные механизмы.
// Если в конфигурации не используются собственные механизмы для открытия
// Интернет-страниц, тогда необходимо оставить тело процедуры пустым, в
// противном случае параметру СтандартнаяОбработка необходимо присвоить
// значение Ложь.
//
// Параметры:
//	АдресСтраницы - Строка - URL-адрес открываемой Интернет-страницы;
//	ЗаголовокОкна - Строка - заголовок окна, в котором отображается
//		Интернет-страница, если для открытия Интернет-страницы
//		используется внутренняя форма конфигурации;
//	СтандартнаяОбработка - Булево - в параметре возвращается признак
//		необходимости открытия Интернет-страницы стандартным способом.
//		Значение по умолчанию - Истина.
//
Процедура ОткрытьИнтернетСтраницу(АдресСтраницы, ЗаголовокОкна, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейсУНФ

Процедура ИнтернетПоддержкаИСервисы_БИПВойтиИлиВыйти(Форма) Экспорт
	
	Если Форма.БИПДанныеАутентификации = Неопределено Тогда
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
			Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуПользователейЗавершение", ЭтотОбъект, Неопределено),
			Форма);
	Иначе
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПриОтветеНаВопросОВыходеИзИнтернетПоддержки", ЭтотОбъект, Форма),
			НСтр("ru = 'Логин и пароль для подключения к сервисам Интернет-поддержки пользователей будут удалены из программы.
				|Отключить Интернет-поддержку?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Выход из Интернет-поддержки пользователей'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтветеНаВопросОВыходеИзИнтернетПоддержки(КодВозврата, Форма) Экспорт
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда
		ИнтернетПоддержкаПользователейВызовСервера.ВыйтиИзИПП();
		Форма.БИПДанныеАутентификации = Неопределено;
		Оповестить("ИнтернетПоддержкаОтключена");
		Оповестить("Запись_НаборКонстант",, "СостояниеПодключенияИПП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьИнтернетПоддержкуПользователейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("Запись_НаборКонстант",, "СостояниеПодключенияИПП");
	
КонецПроцедуры

#КонецОбласти