Процедура ДобавитьЗапись(Структура) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИдентификаторыСинхронизуемыхОбъектовМП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ИдентификаторНаКлиентскомУзле.Установить(Структура.ИдентификаторНаКлиентскомУзле);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапсиь = НаборЗаписей.Добавить();
		Для Каждого Элемент Из Структура Цикл
			НоваяЗапсиь[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
		
	Иначе
		Для каждого ЗаписьНабора Из НаборЗаписей Цикл
			Для Каждого Элемент Из Структура Цикл
				ЗаписьНабора[Элемент.Ключ] = Элемент.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	НаборЗаписей.Записать();
	
	
КонецПроцедуры

Функция ПолучитьСсылкуПоУникальномуИдентификаторуНаЦентральномУзле(УникальныйИдентификаторНаЦентральномУзле) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыСинхронизуемыхОбъектовМП.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ИдентификаторыСинхронизуемыхОбъектовМП КАК ИдентификаторыСинхронизуемыхОбъектовМП
		|ГДЕ
		|	ИдентификаторыСинхронизуемыхОбъектовМП.ИдентификаторНаЦентральномУзле = &ИдентификаторНаЦентральномУзле";
	
	Запрос.УстановитьПараметр("ИдентификаторНаЦентральномУзле", УникальныйИдентификаторНаЦентральномУзле);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено
	
КонецФункции // ()
