
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Недействителен");
	
	НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.Использование = Истина;
	НовыйОтбор.ЛевоеЗначение = ПолеОтбора;
	НовыйОтбор.ПравоеЗначение = Ложь;
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНедействительную(Команда)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Недействителен");
	НайденныйЭлемент = Неопределено;
	
	Для Каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора
			Тогда
			НайденныйЭлемент = ЭлементОтбора;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлемент = Неопределено
		Тогда
		Возврат;
	КонецЕсли;
	
	НовыйОтбор = НайденныйЭлемент;
	НовыйОтбор.Использование = Не НовыйОтбор.Использование;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

		НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
		РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.Недействителен", Истина, ВидСравненияКомпоновкиДанных.Равно);
		РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Наименование");
		РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти); 

КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат 
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		Возврат 
	КонецЕсли;
	
КонецПроцедуры

