
// В процедуре нужно реализовать заполнение параметров формарования текста запроса на основании ссылки на документ.
// 
// Параметры:
//  Параметры
//  ДокументСсылка
Процедура ЗаполнитьПараметрыФормированияТекстаЗапросаВложенныхШтрихкодов(Параметры, ДокументСсылка) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Организация");
		
		Параметры.ИмяПоляАлкогольнаяПродукция = "НоменклатураЕГАИС";
		Параметры.ИмяТабЧастиАкцизныхМарок    = "АкцизныеМарки";
		Параметры.ОрганизацияЕГАИС            = ШтрихкодированиеЕГАИС.ОрганизацияЕГАИС(Организация);
		
	КонецЕсли;
	
КонецПроцедуры
