
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторЯндекса) Тогда
		УстановитьПредупреждениеПриРедактирвоании(Элементы.ВремяДоставкиС);
		УстановитьПредупреждениеПриРедактирвоании(Элементы.ВремяДоставкиПо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПредупреждениеПриРедактирвоании(Элемент)
	
	Элемент.ПредупреждениеПриРедактировании = НСтр("ru = 'Изменять интервал Яндекс.Доставки не рекомендуется.'");
	
КонецПроцедуры

#КонецОбласти