
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекСтрокаПолучатели = ПараметрыВыполненияКоманды.Источник.Элементы.Получатели.ТекущиеДанные;
	
	Если ТекСтрокаПолучатели = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭлектроннаяПочтаУНФКлиент.АдресЭлектроннойПочтыЗаполнен(ПараметрыВыполненияКоманды.Источник, ТекСтрокаПолучатели.КакСвязаться) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлектроннаяПочтаУНФКлиент.КонтрагентУжеСоздан(
		ТекСтрокаПолучатели.Контакт,
		НСтр("ru = 'Контрагент уже создан.'"),
		ПараметрыВыполненияКоманды.Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыФормыСозданияКонтакта(
	ПараметрКоманды,
	ТекСтрокаПолучатели.Контакт,
	ТекСтрокаПолучатели.КакСвязаться);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник.Элементы.Получатели);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыФормыСозданияКонтакта(ПараметрКоманды, Контакт, КакСвязаться)
	
	Результат = Новый Структура;
	Результат.Вставить("РежимВыбора", Истина);
	Результат.Вставить("ЗначенияЗаполнения", Новый Структура);
	Результат.ЗначенияЗаполнения.Вставить("Покупатель", Истина);
	
	ИсточникПривлечения = ПолучитьЗначениеИсточникаПривлечения(ПараметрКоманды);
	Результат.ЗначенияЗаполнения.Вставить("ИсточникПривлеченияПокупателя", ИсточникПривлечения);
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Результат.Вставить("Контакт", Контакт);
		Возврат Результат;
	КонецЕсли;
	
	Результат.Вставить("КонтактКакСвязаться", Новый Структура);
	Результат.КонтактКакСвязаться.Вставить("ВидКонтакта", "Контрагент");
	Результат.КонтактКакСвязаться.Вставить("Контакт", Контакт);
	Результат.КонтактКакСвязаться.Вставить("КакСвязаться", КакСвязаться);
	Результат.КонтактКакСвязаться.Вставить("ТипКИ", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КонтрагентУжеСоздан(Контакт, ТекстСообщения, Форма) Экспорт
	
	Если ТипЗнч(Контакт) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИндексСтроки = Форма.Объект.Участники.Индекс(Форма.Элементы.Получатели.ТекущиеДанные);
	ОбщегоНазначенияКлиент.СообщитьПользователю(
	ТекстСообщения,,
	СтрШаблон("Объект.Участники[%1].Контакт", Формат(ИндексСтроки, "ЧГ=")));
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеИсточникаПривлечения(Событие)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Событие, "ИсточникПривлечения");
	
КонецФункции

#КонецОбласти
