&НаКлиенте
Перем Дисплеи;

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	// Наборы
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.НоменклатураНабора", Справочники.Номенклатура.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыНоменклатура,ЗапасыХарактеристика,ЗапасыКоличество,ЗапасыЕдиницаИзмерения");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
	// Конец Наборы

	// Скидки	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	ГруппаОтборов = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов, "Объект.Запасы.ПроцентСкидкиНаценки", 100);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов, "Объект.Запасы.СуммаСкидкиНаценки", Новый ПолеКомпоновкиДанных("Объект.Запасы.Сумма"),ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыСумма");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПроцентСкидкиНаценки", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыПроцентСкидкиНаценки");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "%");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.СуммаСкидкиНаценки", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыСуммаСкидкиНаценки");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "сумма");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ПроцентАвтоматическойСкидки", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыПроцентАвтоматическойСкидки");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "%");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.СуммаАвтоматическойСкидки", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "ЗапасыСуммаАвтоматическойСкидки");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "сумма");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	// Конец Скидки
	
	// Характеристики и партии
	ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристикИПартий();
	
	// Остатки и резервы
	
	ПолеДляОформления = ?(Не ЭтоМобильныйКилент, "ЗапасыДоступно", "ЗапасыМКДоступно");
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Доступно", Новый ПолеКомпоновкиДанных("Объект.Запасы.Количество")
	, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеДляОформления);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Зеленый);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Доступно", Новый ПолеКомпоновкиДанных("Объект.Запасы.Количество")
	, ВидСравненияКомпоновкиДанных.Меньше);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Доступно", 0, ВидСравненияКомпоновкиДанных.Больше);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеДляОформления);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.ЦветТекстаПредупреждениеОбОкончанииДоговора);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Доступно", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеДляОформления);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "0");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", WebЦвета.Красный);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.ТипНоменклатурыЗапас", Ложь);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ПолеДляОформления);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", "");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	// Наборы
	Элементы.ЗапасыКартинкаНабора.Видимость			= Ложь;
	Для каждого Стр Из Объект.Запасы Цикл
		Если Стр.КартинкаНабора>0 Тогда
			Элементы.ЗапасыКартинкаНабора.Видимость = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	// Конец Наборы
	
КонецПроцедуры

// Процедура инициализирует параметры нового чека.
//
&НаСервере
Процедура ИнициализироватьНовыйЧек(ВыдатьОкноУспешноПробит = Ложь)
	
	СсылкаНаЧек_МК = Объект.Ссылка;
	
	НовыйЧек = Документы.ЧекККМ.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(НовыйЧек, Объект,, "Запасы, БезналичнаяОплата, СкидкиНаценки, Номер, Проведен, ПометкаУдаления, Заказ");
	Если ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены) Тогда
		МассивРеквизитов = Новый Массив;
		ПолучитьСтрокуРеквизитыИсключения(МассивРеквизитов);
		
		Для Каждого ЗначениеМассива Из МассивРеквизитов Цикл
			НовыйЧек[ЗначениеМассива] = СтруктураСостояниеКассовойСмены[ЗначениеМассива];
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		РазблокироватьДанныеДляРедактирования(Объект.Ссылка, УникальныйИдентификатор);
	Исключение
		//
	КонецПопытки;
	
	ЗначениеВДанныеФормы(НовыйЧек, Объект);
	
	Объект.СуммаДокумента = 0;
	ОбновитьНадписьКнопкиКОплатеНаСервере();
	
	Объект.ВидСкидкиНаценки = Неопределено;
	Объект.ДисконтнаяКарта = Неопределено;
	Объект.Контрагент = Неопределено;
	Объект.Договор = Неопределено;
	Объект.ПроцентСкидкиПоДисконтнойКарте = 0;
	Объект.СкидкиРассчитаны = Ложь;
	СуммаСкидки = 0;
	
	Объект.ПолученоНаличными = 0;
	ПолученоПлатежнымиКартами = 0;
	
	СуммаЧекаБезСкидки = 0;
	СуммаСдачи = 0;
	
	Объект.Запасы.Очистить();
	Объект.БезналичнаяОплата.Очистить();
	Объект.СкидкиНаценки.Очистить();
	
	Объект.НомерЧекаККМ = "";
	Объект.Архивный = Ложь;
	Объект.Статус = Перечисления.СтатусыЧековККМ.ЧекНеПробит;
	Объект.Телефон = "";
	Объект.АдресЭП = "";
	Объект.Комментарий = "";
	
	УстановленСерыйЦвет = Истина;
	Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.ОбновитьСерый;
	
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаСервере());
	
	Если ЭтоМобильныйКилент Тогда
		Если ВыдатьОкноУспешноПробит Тогда
			Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы.ГруппаФормаЗавершенияПродажи;
			Элементы.ПечатьТоварногоЧека_МК.Видимость = Истина;
		Иначе
			Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы.ГруппаПродажаМК;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьНовыйЧек()

// Заполняет суммы скидок на клиенте.
//
&НаКлиенте
Процедура ЗаполнитьСуммыСкидок()
	
	Для каждого ТекСтрока Из Объект.Запасы Цикл
		СуммаБезСкидки = ТекСтрока.Цена * ТекСтрока.Количество;
		ОбщаяСкидка = СуммаБезСкидки - ТекСтрока.Сумма;
		СуммаРучнойСкидкиНаценки = ?((ОбщаяСкидка - ТекСтрока.СуммаАвтоматическойСкидки) > 0, ОбщаяСкидка - ТекСтрока.СуммаАвтоматическойСкидки, 0);
		
		ТекСтрока.СуммаСкидкиНаценки = СуммаРучнойСкидкиНаценки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура пересчитывает документ на клиенте.
//
&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте(ПоказатьСтраницуДанныеПоСтроке = Истина)
	
	Если Не Объект.ОперацияСДенежнымиСредствами Тогда
		Объект.СуммаДокумента = Объект.Запасы.Итог("Всего");
	КонецЕсли;
	
	Оплачено = Объект.ПолученоНаличными + Объект.БезналичнаяОплата.Итог("Сумма") + Объект.Предоплата.Итог("СуммаРасчетов");
	СуммаСдачи = ?(Оплачено = 0, 0, Оплачено - Объект.СуммаДокумента);
	
	СуммаСкидки = Объект.Запасы.Итог("СуммаСкидкиНаценки") + Объект.Запасы.Итог("СуммаАвтоматическойСкидки");
	СуммаЧекаБезСкидки = Объект.СуммаДокумента + СуммаСкидки;	
	
	Если ПоказатьСтраницуДанныеПоСтроке И
		Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница <> Элементы.СтраницаДанныеПоСтроке Тогда
		Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке;
	КонецЕсли;
	
	ОбновитьНадписьКнопкиКОплатеНаКлиенте();
	ВывестиИнформациюНаДисплейПокупателя();
	
КонецПроцедуры // ПересчитатьДокументНаКлиенте()

&НаКлиенте
Процедура ОбновитьНадписьКнопкиКОплатеНаКлиенте()
	
	Элементы.КнопкаКОплате.Заголовок = НСтр("ru = 'К оплате: '") + Формат(Объект.СуммаДокумента, "ЧДЦ=2; ЧН=0.00");
	Если Объект.СуммаДокумента = 0 Тогда
		Элементы.КнопкаКОплате.ЦветФона = Новый Цвет;
	Иначе
		Элементы.КнопкаКОплате.ЦветФона = WebЦвета.Золотой;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКнопкиКОплатеНаСервере()
	
	Элементы.КнопкаКОплате.Заголовок = НСтр("ru = 'К оплате: '") + Формат(Объект.СуммаДокумента, "ЧДЦ=2; ЧН=0.00");
	
КонецПроцедуры

// Процедура заполнения списка видов платежных карт.
//
&НаСервере
Процедура ПолучитьСписокВыбораВидовПлатежныхКарт()
	
	МассивВидовПлатежныхКарт = Справочники.ЭквайринговыеТерминалы.ВидыПлатежныхКарт(Объект.ЭквайринговыйТерминал);
	
	Элементы.ОплатаПлатежнымиКартамиВидПлатежнойКарты.СписокВыбора.ЗагрузитьЗначения(МассивВидовПлатежныхКарт);
	
КонецПроцедуры // ПолучитьСписокВыбораВидовПлатежныхКарт()

// Получает ссылки на внешнее оборудование.
//
&НаСервере
Процедура ПолучитьСсылкиНаОборудование()

	ФискальныйРегистратор = ?(
		ИспользоватьПодключаемоеОборудование // Проверка на включенную ФО "Использовать ПО"
	  И ЗначениеЗаполнено(Объект.КассаККМ)
	  И ЗначениеЗаполнено(Объект.КассаККМ.ПодключаемоеОборудование),
	  Объект.КассаККМ.ПодключаемоеОборудование.Ссылка,
	  Справочники.ПодключаемоеОборудование.ПустаяСсылка()
	);

	ЭквайринговыйТерминал = ?(
		ИспользоватьПодключаемоеОборудование
	  И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал)
	  И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал.ПодключаемоеОборудование)
	  И НЕ Объект.ЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования,
	  Объект.ЭквайринговыйТерминал.ПодключаемоеОборудование,
	  Справочники.ПодключаемоеОборудование.ПустаяСсылка()
	);
	
КонецПроцедуры // ПолучитьСсылкиНаОборудование()

// Процедура заполняет Ставку НДС в табличной части по системе налогообложения
// организации.
// 
&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС()
	
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация, Объект.СтруктурнаяЕдиница, Объект.Дата);
	
	Если НЕ НалогообложениеПередИзменением = Объект.НалогообложениеНДС Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

// Процедура заполняет Ставку НДС в табличной части по системе налогообложения.
// 
&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС()
	
	Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.ВидСтавкиНДС) Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(СтрокаТабличнойЧасти.Номенклатура.ВидСтавкиНДС, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
			Иначе
				СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Объект.Организация.ВидСтавкиНДСПоУмолчанию, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
			КонецЕсли;
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.СуммаНДС = ?(
				Объект.СуммаВключаетНДС,
				СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
				СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100
			);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
			
		КонецЦикла;
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		Иначе
			СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			СтрокаТабличнойЧасти.СуммаНДС = 0;
			
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	// Наборы
	Если НЕ СтруктураДанные.Свойство("ЕдиницаИзмерения") Тогда
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	КонецЕсли; 
	Если НЕ СтруктураДанные.Свойство("Коэффициент") Тогда
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			СтруктураДанные.Вставить("Коэффициент", СтруктураДанные.ЕдиницаИзмерения.Коэффициент);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли; 
	КонецЕсли;
	// Конец Наборы
	
	СтруктураДанные.Вставить(
		"Содержание",
		УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
			?(ЗначениеЗаполнено(СтруктураДанные.Номенклатура.НаименованиеПолное),
			СтруктураДанные.Номенклатура.НаименованиеПолное, СтруктураДанные.Номенклатура.Наименование),
			СтруктураДанные.Характеристика, СтруктураДанные.Номенклатура.Артикул)
	);
	
	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;
	
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.ВидСтавкиНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", Справочники.СтавкиНДС.СтавкаНДС(СтруктураДанные.Номенклатура.ВидСтавкиНДС, ?(ЗначениеЗаполнено(СтруктураДанные.ДатаОбработки), СтруктураДанные.ДатаОбработки, ТекущаяДатаСеанса())));
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", Справочники.СтавкиНДС.СтавкаНДС(СтруктураДанные.Организация.ВидСтавкиНДСПоУмолчанию, ?(ЗначениеЗаполнено(СтруктураДанные.ДатаОбработки), СтруктураДанные.ДатаОбработки, ТекущаяДатаСеанса())));
	КонецЕсли;
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) и СтруктураДанные.Номенклатура.ИспользоватьХарактеристики
		Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено
			Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если НЕ СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика",ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика), СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики",Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",СтруктураДанные.Номенклатура.ПроверятьЗаполнениеХарактеристики);
	КонецЕсли; 
	// Конец Характеристики
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
	Иначе
		СтруктураДанные.Вставить("Цена", 0);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидСкидкиНаценки") 
		И ЗначениеЗаполнено(СтруктураДанные.ВидСкидкиНаценки) Тогда
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки.Процент);
	Иначе	
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", 0);
	КонецЕсли;
		
	Если СтруктураДанные.Свойство("ПроцентСкидкиПоДисконтнойКарте") 
		И ЗначениеЗаполнено(СтруктураДанные.ДисконтнаяКарта) Тогда
		ТекПроцент = СтруктураДанные.ПроцентСкидкиНаценки;
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", ТекПроцент + СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
	КонецЕсли;
	
	СтруктураДанные.Вставить("НеобходимостьВводаАкцизнойМарки", СтруктураДанные.Номенклатура.ВидАлкогольнойПродукции.Маркируемый);
	СтруктураДанные.Вставить("НеобходимостьВводаКодаМаркировки", СтруктураДанные.Номенклатура.ТабачнаяПродукция);
	
	// Наборы
	НаборыСервер.ДобавитьИнформациюОНабореПриПолученииДанныхНоменклатуры(СтруктураДанные);
	// Конец Наборы
	
	//Партии
	СтруктураДанные.Вставить("ИспользоватьПартии",Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеПартий",Ложь);
	
	Если НЕ СтруктураДанные.Свойство("Партия") Тогда
		СтруктураДанные.Вставить("Партия", Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) и СтруктураДанные.Номенклатура.ИспользоватьПартии
		Тогда
		
		Если Не СтруктураДанные.Свойство("ВидОперации")
			Тогда
			ВидОперации = Неопределено
		Иначе
			ВидОперации = СтруктураДанные.ВидОперации
		КонецЕсли;
		
		Если СтруктураДанные.Свойство("СтатусПартии")
			Тогда
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура,СтруктураДанные.СтатусПартии);
		Иначе
			Если Не СтруктураДанные.Свойство("ВидОперации")
				Тогда
				ВидОперации = Неопределено
			Иначе
				ВидОперации = СтруктураДанные.ВидОперации
			КонецЕсли;
			
			СтатусПартии = НоменклатураВДокументахСервер.СоответствиеВидаОпреацииИлиХозОперацииСтатусуПартии(, ВидОперации);
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура,СтатусПартии);
		КонецЕсли;
		
		ПартияПоУмолчанию = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Если Не ЗначенияПартииПоУмолчанию = Неопределено
			Тогда
			ПартияПоУмолчанию = ЗначенияПартииПоУмолчанию;
		КонецЕсли;
		
		СтруктураДанные.Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия), СтруктураДанные.Партия, ПартияПоУмолчанию);
		
		СтруктураДанные.ПроверятьЗаполнениеПартий = СтруктураДанные.Номенклатура.ПроверятьЗаполнениеПартий;
		СтруктураДанные.ИспользоватьПартии = Истина;
		
	КонецЕсли;
	// Конец Партии
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

// Процедура заполняет данные при изменении номенклатуры.
//
&НаКлиенте
Процедура НоменклатураПриИзменении(СтрокаТабличнойЧасти)
	
	// МОТП
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();

	Если СтрокаТабличнойЧасти.МаркируемаяПродукция = 1 Тогда
		ПараметрыМаркировки = ИнтеграцияМОТПУНФКлиент.ИнициализироватьПараметрыОткрытияФормыВводаКодаМаркировки();
		ПараметрыМаркировки.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		Если СтрокаТабличнойЧасти.ТабачнаяПродукция = 1 Тогда
			ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табачная");
		Иначе
			ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная");
		КонецЕсли;
		ПараметрыМаркировки.Вставить("ВидПродукции", ВидПродукции);
		ПараметрыМаркировки.Вставить("МаркируемаяПродукция", Истина);
		ПараметрыМаркировки.Вставить("ПараметрыСканирования", ШтрихкодированиеИСКлиентСервер.ИнициализироватьПараметрыСканирования(ЭтотОбъект));
		ИнтеграцияМОТПУНФКлиент.ОткрытьФормуСчитыванияКодаМаркировки(ЭтотОбъект, ПараметрыМаркировки);
		Объект.Запасы.Удалить(СтрокаТабличнойЧасти);
		Возврат;
	КонецЕсли;
	// Конец МОТП
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураДанные.Вставить("Коэффициент", 1);
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
		
	КонецЕсли;
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ДисконтнаяКарта",  Объект.ДисконтнаяКарта);
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	// Конец ДисконтныеКарты
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	Если СтруктураДанные.ЭтоНабор И НЕ СтруктураДанные.ИспользоватьХарактеристики Тогда
		
		// Наборы
		ЗаменитьСтрокуЗапасовДаннымиНабора(ЭтотОбъект, СтрокаТабличнойЧасти, СтруктураДанные);
		// Конец Наборы
		// АвтоматическиеСкидки.
		СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
		// Конец АвтоматическиеСкидки
	
		ПересчитатьДокументНаКлиенте();
		
	Иначе
		
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Количество = 1;
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
		СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		СтрокаТабличнойЧасти.НеобходимостьВводаАкцизнойМарки = СтруктураДанные.НеобходимостьВводаАкцизнойМарки;
		СтрокаТабличнойЧасти.НеобходимостьВводаКодаМаркировки = СтруктураДанные.НеобходимостьВводаКодаМаркировки;
		// Наборы
		СтрокаТабличнойЧасти.ЭтоНабор = СтруктураДанные.ЭтоНабор;
		
		//Характеристики
		СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
		СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
		СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
		
		Если СтруктураДанные.ИспользоватьХарактеристики
			Тогда
			СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
		//Конец Характеристики
		
		//Партии
		СтрокаТабличнойЧасти.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
		СтрокаТабличнойЧасти.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
		
		Если СтруктураДанные.ИспользоватьПартии
			Тогда
			СтрокаТабличнойЧасти.Партия = СтруктураДанные.Партия;
		КонецЕсли;
		// Конец Партии
		
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		
		ОткрытьВводАкцизнойМарки(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры // НоменклатураПриИзменении()

// Получает набор данных с сервера для процедуры ХарактеристикаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные)
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			СтруктураДанные.Вставить("Коэффициент", СтруктураДанные.ЕдиницаИзмерения.Коэффициент);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли;
		
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	// Наборы
	НаборыСервер.ДобавитьИнформациюОНабореПриПолученииДанныхНоменклатуры(СтруктураДанные);
	// Конец Наборы
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеХарактеристикаПриИзменении()

// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницаИзмеренияПриИзменении(ТекущаяЕдиницаИзмерения = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	СтруктураДанные = Новый Структура();
	
	Если ТекущаяЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("ТекущийКоэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("ТекущийКоэффициент", ТекущаяЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЕдиницаИзмеренияПриИзменении()

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено, УстановитьОписание = Истина)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	Если ПараметрыРасчета=Неопределено Тогда
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны",Истина);
	КонецЕсли;	
	ПараметрыРасчета.Вставить("СуммаВключаетНДС",Объект.СуммаВключаетНДС);
	УправлениеНебольшойФирмойКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	// АвтоматическиеСкидки.
	ТребуетсяПересчет = СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти");
	
	// Если была изменена картинка, то фокус уходит из ТЧ и процедура ПересчитатьДокументНаКлиенте() не вызывается.
	Если ТребуетсяПересчет Тогда
		ПересчитатьДокументНаКлиенте();
		ДокументПересчитанНаКлиенте = Истина;
	Иначе
		ДокументПересчитанНаКлиенте = Ложь;
	КонецЕсли;
	// Конец АвтоматическиеСкидки

	// РМК
	Если УстановитьОписание Тогда
		УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
	// Серийные номера
	Если ИспользоватьСерийныеНомераОстатки<>Неопределено Тогда
		РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСерийныеНомераКоличество(Объект, СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

// Функция получает список товаров из временного хранилища
//
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	НоваяСтрока = Неопределено;
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаЗагрузки.Номенклатура, "ТипНоменклатуры, Вес, Объем, ЭтоНабор");
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначенияРеквизитов.ЭтоНабор Тогда
			
			// Наборы
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Организация", Объект.Организация);
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ЗначенияРеквизитов.ТипНоменклатуры);
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", СтрокаЗагрузки.Характеристика);
			СтруктураДанныеНоменклатуры.Вставить("ЕдиницаИзмерения", СтрокаЗагрузки.ЕдиницаИзмерения);
			СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
			СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", Объект.Дата);
			Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", Объект.Дата);
				СтруктураДанныеНоменклатуры.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
				СтруктураДанныеНоменклатуры.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
				СтруктураДанныеНоменклатуры.Вставить("ВидЦен", Объект.ВидЦен);
				СтруктураДанныеНоменклатуры.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
			КонецЕсли;
			
			// ДисконтныеКарты
			СтруктураДанныеНоменклатуры.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
			СтруктураДанныеНоменклатуры.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
			// Конец ДисконтныеКарты
			
			СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
			
			ЗаменитьСтрокуЗапасовДаннымиНабора(ЭтотОбъект, НоваяСтрока, СтруктураДанные);
			НоваяСтрока = Неопределено;
			
			ЗаполнитьПризнакиИспользованияХарактеристик();
			
			Продолжить;
			// Конец Наборы
			
		Иначе
				
			НоваяСтрока.СуммаСкидкиНаценки = (НоваяСтрока.Количество * НоваяСтрока.Цена) - НоваяСтрока.Сумма;
			НоваяСтрока.НоменклатураХарактеристикаИПартия = СокрЛП(НоваяСтрока.Номенклатура.Наименование)+?(НоваяСтрока.Характеристика.Пустая(), "", ". "+НоваяСтрока.Характеристика)+?(НоваяСтрока.Партия.Пустая(), "", ". "+НоваяСтрока.Партия);
			Если НоваяСтрока.СуммаСкидкиНаценки <> 0 Тогда
				ПроцентСкидки = Формат(НоваяСтрока.СуммаСкидкиНаценки * 100 / (НоваяСтрока.Количество * НоваяСтрока.Цена), "ЧДЦ=2");
				ТекстСкидки = ?(НоваяСтрока.СуммаСкидкиНаценки > 0, " - "+НоваяСтрока.СуммаСкидкиНаценки, " + "+(-НоваяСтрока.СуммаСкидкиНаценки))+" "+Объект.ВалютаДокумента
							  +" ("+?(НоваяСтрока.СуммаСкидкиНаценки > 0, " - "+ПроцентСкидки+"%)", " + "+(-ПроцентСкидки)+"%)");
			Иначе
				ТекстСкидки = "";
			КонецЕсли;
			НоваяСтрока.ДанныеПоСтроке = ""+НоваяСтрока.Цена+" "+Объект.ВалютаДокумента+" Х "+НоваяСтрока.Количество+" "+НоваяСтрока.ЕдиницаИзмерения+ТекстСкидки+" = "+НоваяСтрока.Сумма+" "+Объект.ВалютаДокумента;
			
			Если НоваяСтрока.НеобходимостьВводаАкцизнойМарки
				И ЗначениеЗаполнено(СтрокаЗагрузки.КодАкцизнойМарки) Тогда
				УправлениеНебольшойФирмойКлиентСервер.ЗаполнитьКлючСвязи(Объект[ИмяТабличнойЧасти], НоваяСтрока, "КлючСвязи");
				
				СтрокаАкцизнаяМарка = Объект.АкцизныеМарки.Добавить();
				СтрокаАкцизнаяМарка.КлючСвязи = НоваяСтрока.КлючСвязи;
				СтрокаАкцизнаяМарка.КодАкцизнойМарки = СтрокаЗагрузки.КодАкцизнойМарки;
			КонецЕсли;
			
			//Характеристики
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Организация", Объект.Организация);
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", СтрокаЗагрузки.Характеристика);
			СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
			
			СтатусПартии = Новый СписокЗначений;
			СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
			СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
			СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", Объект.Дата);
			
			СтруктураДанныеНоменклатуры.Вставить("СтатусПартии", СтатусПартии);
			
			СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
			
			НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
			НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
			НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
			
			Если СтруктураДанные.ИспользоватьХарактеристики
				Тогда
				НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
			КонецЕсли;
			// Конец Характеристики
			
			//Партии
			НоваяСтрока.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
			НоваяСтрока.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
			
			НоваяСтрока.Партия = ?(ЗначениеЗаполнено(СтрокаЗагрузки.Партия), СтрокаЗагрузки.Партия, СтруктураДанные.Партия);
			// Конец Партии
			
		КонецЕсли;
		
	КонецЦикла;
	
	// АвтоматическиеСкидки
	Если ТаблицаДляЗагрузки.Количество() > 0 Тогда
		СброситьФлагСкидкиРассчитаныСервер("ОбработкаПодбора");
		ОбновитьКартинкуДисконтнойКарты();
	КонецЕсли;

	ПоказатьСкрытьСдачуНаСервере(Ложь, Истина);
	
	Если НоваяСтрока <> Неопределено Тогда
		Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

// Процедура выполняет пересчет в табличной части документа после изменений 
// в форме "Цены и валюта".Выполняется пересчет колонок: цена, скидка, сумма,
// сумма НДС, всего.
//
&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПересчитатьЦены = Ложь)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТолькоПросмотр", 		  ЭтотОбъект.ТолькоПросмотр);
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  Объект.НалогообложениеНДС);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",	  Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НДСВключатьВСтоимость", Объект.НДСВключатьВСтоимость);
	СтруктураПараметров.Вставить("СпециальныйНалоговыйРежим", Объект.СпециальныйНалоговыйРежим);
	СтруктураПараметров.Вставить("Организация",			  Компания);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  Ложь);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	СтруктураПараметров.Вставить("ДоступностьВалютыДокумента", Ложь);
	СтруктураПараметров.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураПараметров.Вставить("ВидСкидки", Объект.ВидСкидкиНаценки);
	СтруктураПараметров.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуЦеныИВалютаЗавершение", ЭтотОбъект, Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением));
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаКлиенте
// Процедура-обработчик результата открытия формы "Цены и валюты"
//
Процедура ОткрытьФормуЦеныИВалютаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Затраты" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура")
	   И РезультатЗакрытия.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = РезультатЗакрытия.ВидЦен;
		Объект.ВидСкидкиНаценки = РезультатЗакрытия.ВидСкидки;
		// ДисконтныеКарты
		// В чеках не проверяем контрагента, т.к. все продажи обезличенные.
		Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
		Объект.ПроцентСкидкиПоДисконтнойКарте = РезультатЗакрытия.ПроцентСкидкиПоДисконтнойКарте;
		Если Объект.Контрагент <> РезультатЗакрытия.Контрагент Тогда
			Объект.Контрагент = РезультатЗакрытия.Контрагент;
		КонецЕсли;
		// Конец ДисконтныеКарты
		Объект.НалогообложениеНДС = РезультатЗакрытия.НалогообложениеНДС;
		Объект.СпециальныйНалоговыйРежим = РезультатЗакрытия.СпециальныйНалоговыйРежим;
		Объект.СуммаВключаетНДС = РезультатЗакрытия.СуммаВключаетНДС;
		Объект.НДСВключатьВСтоимость = РезультатЗакрытия.НДСВключатьВСтоимость;
		
		// Пересчитываем цены по виду цен.
		Если РезультатЗакрытия.ПерезаполнитьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы", Истина);
			ЗаполнитьСуммыСкидок();
		КонецЕсли;
		
		// Пересчитываем цены по валюте.
		Если НЕ РезультатЗакрытия.ПерезаполнитьЦены
			  И РезультатЗакрытия.ПересчитатьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтаФорма, ДополнительныеПараметры.ВалютаРасчетовПередИзменением, "Запасы", РезультатЗакрытия.КурсПересчетаЦен);
			ЗаполнитьСуммыСкидок();
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак Налогообложение НДС.
		Если РезультатЗакрытия.НалогообложениеНДС <> РезультатЗакрытия.ПредНалогообложениеНДС Тогда
			ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
			ЗаполнитьСуммыСкидок();
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак "Сумма включает НДС".
		Если НЕ РезультатЗакрытия.ПерезаполнитьЦены
			И НЕ РезультатЗакрытия.СуммаВключаетНДС = РезультатЗакрытия.ПредСуммаВключаетНДС Тогда
			УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтаФорма, "Запасы");
			ЗаполнитьСуммыСкидок();
		КонецЕсли;
		
		// ДисконтныеКарты
		Если РезультатЗакрытия.ПерезаполнитьСкидки И НЕ РезультатЗакрытия.ПерезаполнитьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПерезаполнитьСкидкиТабличнойЧастиПослеСчитыванияДисконтнойКарты(ЭтаФорма, "Запасы");
			ЗаполнитьСуммыСкидок();
		КонецЕсли;
		// Конец ДисконтныеКарты
		
		// АвтоматическиеСкидки
		Если РезультатЗакрытия.ПерезаполнитьСкидки ИЛИ РезультатЗакрытия.ПерезаполнитьЦены ИЛИ РезультатЗакрытия.ПересчитатьЦены Тогда
			СброситьФлагСкидкиРассчитаныКлиент("ПерезаполнениеПоДаннымФормыЦеныИВалюта");
		КонецЕсли;
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаКлиенте());
	
	// Обновим подвал документа
	ПересчитатьДокументНаКлиенте();
	
	// Обновим надписи для всех строк ТЧ Запасы.
	ЗаполнитьОписаниеДляТЧЗапасыНаКлиенте();
	
КонецПроцедуры // ОткрытьФормуЦеныИВалютаЗавершение()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуСвойстваСтруктурыРеквизитов()
	
	СтрокаСвойств = "ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, СпециальныйНалоговыйРежим, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте";
	Возврат СтрокаСвойств;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруНадписиЦеныИВалютаНаКлиенте()
	
	СтруктураНадписи = Новый Структура(ПолучитьСтрокуСвойстваСтруктурыРеквизитов(),
		Объект.ВидЦен,
		Объект.ВидСкидкиНаценки,
		Объект.ВалютаДокумента,
		Объект.ВалютаДокумента,
		Курс,
		КурсНациональнаяВалюта,
		Объект.СуммаВключаетНДС,
		УчетВалютныхОпераций,
		Объект.НалогообложениеНДС,
		Объект.СпециальныйНалоговыйРежим,
		Объект.ДисконтнаяКарта,
		Объект.ПроцентСкидкиПоДисконтнойКарте)
	;
	
	Возврат СтруктураНадписи;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруНадписиЦеныИВалютаНаСервере()
	
	СтруктураНадписи = Новый Структура(ПолучитьСтрокуСвойстваСтруктурыРеквизитов(),
		Объект.ВидЦен,
		Объект.ВидСкидкиНаценки,
		Объект.ВалютаДокумента,
		Объект.ВалютаДокумента,
		Курс,
		КурсНациональнаяВалюта,
		Объект.СуммаВключаетНДС,
		УчетВалютныхОпераций,
		Объект.НалогообложениеНДС,
		Объект.СпециальныйНалоговыйРежим,
		Объект.ДисконтнаяКарта,
		Объект.ПроцентСкидкиПоДисконтнойКарте)
	;
	
	Возврат СтруктураНадписи;
	
КонецФункции

// Функция возвращает текст надписи "Цены и валюта".
//
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта.
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ru = '%Валюта%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
	
	// Вид цен.
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%ВидЦен%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %ВидЦен%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
	КонецЕсли;
	
	// Вид скидки наценки.
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидСкидки) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%ВидСкидкиНаценки%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %ВидСкидкиНаценки%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидСкидкиНаценки%", СокрЛП(Строка(СтруктураНадписи.ВидСкидки)));
	КонецЕсли;
	
	// Дисконтная карта.
	Если ЗначениеЗаполнено(СтруктураНадписи.ДисконтнаяКарта) И ДисконтныеКартыВызовСервера.СтарыйМеханизмСкидок(СтруктураНадписи.ДисконтнаяКарта) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%ДисконтнаяКарта%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %ДисконтнаяКарта%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ДисконтнаяКарта%", Строка(СтруктураНадписи.ПроцентСкидкиПоДисконтнойКарте)+"% по карте"); //СокрЛП(Строка(СтруктураНадписи.ДисконтнаяКарта)));
	КонецЕсли;	
	
	// Налогообложение НДС.
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%НалогообложениеНДС%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %НалогообложениеНДС%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Специальный налоговый режим.
	Если ЗначениеЗаполнено(СтруктураНадписи.СпециальныйНалоговыйРежим)
		И СтруктураНадписи.СпециальныйНалоговыйРежим <> ПредопределенноеЗначение("Перечисление.СпециальныеНалоговыеРежимы.НеПрименяется") Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ru = '%СпециальныйНалоговыйРежим%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ru = ' • %СпециальныйНалоговыйРежим%'");
		КонецЕсли;	
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%СпециальныйНалоговыйРежим%", СокрЛП(Строка(СтруктураНадписи.СпециальныйНалоговыйРежим)));
	КонецЕсли;
	
	// Флаг сумма включает НДС.
	Если ПустаяСтрока(ТекстНадписи) Тогда	
		Если СтруктураНадписи.СуммаВключаетНДС Тогда	
			ТекстНадписи = НСтр("ru = 'Сумма включает НДС'");
		Иначе
			ТекстНадписи = НСтр("ru = 'Сумма не включает НДС'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

// Процедура формирует заголоок формы.
//
&НаСервере
Процедура СформироватьЗаголовок(СтруктураСостояниеКассовойСмены)
	
	Если СтруктураСостояниеКассовойСмены = Неопределено Тогда
		СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	КонецЕсли;
	
	Если СтруктураСостояниеКассовойСмены.СменаОткрыта И НЕ ЭтоМобильныйКилент Тогда
		ТекстСообщения = НСтр("ru='%ТорговаяТочка%, Смена № %НомерСмены%  %ВремяИзменения%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТорговаяТочка%", СокрЛП(СтруктураСостояниеКассовойСмены.СтруктурнаяЕдиница));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСмены%", СокрЛП(СтруктураСостояниеКассовойСмены.НомерКассовойСмены));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВремяИзменения%", Формат(СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса,"ДФ=dd.MM.yyyy"));
	Иначе
		Если ЭтоМобильныйКилент Тогда
			ТекстСообщения = НСтр("ru='Чек - %КассаККМ%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КассаККМ%", СокрЛП(КассаККМ.Наименование));
		Иначе
			ТекстСообщения = НСтр("ru='%ТорговаяТочка%'");
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.СтруктурнаяЕдиница) Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТорговаяТочка%", СокрЛП(СтруктураСостояниеКассовойСмены.СтруктурнаяЕдиница));
		Иначе
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТорговаяТочка%", СокрЛП(КассаККМ.СтруктурнаяЕдиница));
		КонецЕсли;
	КонецЕсли;
	Заголовок = ТекстСообщения;
	
КонецПроцедуры // СформироватьЗаголовок()

// Процедура формирует заголовок формы.
//
&НаКлиенте
Процедура СформироватьЗаголовокНаКлиенте(СтруктураСостояниеКассовойСмены)
	
	ТекстСообщения = НСтр("ru='%ТорговаяТочка%, Смена № %НомерСмены%  %ВремяИзменения%, %Ответственный%'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТорговаяТочка%", СокрЛП(СтруктураСостояниеКассовойСмены.СтруктурнаяЕдиница));
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСмены%", СокрЛП(СтруктураСостояниеКассовойСмены.НомерКассовойСмены));
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВремяИзменения%", Формат(СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса,"ДФ=dd.MM.yyyy"));
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ответственный%", Строка(Объект.Ответственный));
	
	Заголовок = ТекстСообщения;
	
КонецПроцедуры // СформироватьЗаголовок()

&НаСервере
Процедура НастроитьЭлементыДляМобильногоКлиента()
	
	Если НЕ ЭтоМобильныйКилент Тогда
		Элементы.ГруппаПродажаМК.Видимость = Ложь;
		Элементы.ГруппаФормаЗавершенияПродажи.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницыПродажаМК.ТекущаяСтраница = Элементы.ГруппаНетДанных;
	Элементы.ПечатьТоварногоЧека_МК.Видимость = Ложь;
	Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы.ГруппаПродажаМК;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущийЧекПоЗаказу(ПараметрыНовогоЧекаККМ)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.ЧекККМ"));
	ДокументОбъект.Заполнить(ПараметрыНовогоЧекаККМ);
	ДокументОбъект.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	ДокументОбъект.Заказ = ПараметрыНовогоЧекаККМ.Основание;
	ДокументОбъект.ОперацияСДенежнымиСредствами = Ложь;
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначенияКассоваяСмена

&НаСервере
Функция ПодготовитьДанныеДляПробитияЧека(ТранспортныйМодуль, ДанныеЕГАИСДостаточны, ЕстьАлкогольнаяПродукцияЕГАИС = Неопределено)
	
	ОбщиеПараметры = Документы.ЧекККМ.ПодготовитьДанныеДляПробитияЧека(Объект, Объект.Ссылка, ТранспортныйМодуль, ДанныеЕГАИСДостаточны, ЕстьАлкогольнаяПродукцияЕГАИС);
	Возврат ОбщиеПараметры;
	
КонецФункции

// Функция печати чека на фискальном регистраторе.
//
&НаКлиенте
Процедура ПробитьЧек(СформироватьТоварныйЧек = Ложь)
	
	БезОшибок = Истина;
	ОписаниеОшибки = "";
	
	Если Объект.НомерЧекаККМ <> 0
	И НЕ КассаККМИспользоватьБезПодключенияОборудования Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПоказыватьПредупреждение = Ложь;
	Если НЕ УправлениеНебольшойФирмойКлиент.ПроверитьВозможностьПечатиЧека(ЭтаФорма, ПоказыватьПредупреждение) Тогда
		Если ПоказыватьПредупреждение Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не удалось выполнить проведение документа'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	Если НЕ ИспользоватьПодключаемоеОборудование // Проверка на включенную ФО "Использовать ПО"
		ИЛИ КассаККМИспользоватьБезПодключенияОборудования Тогда
		
		// Внешнее оборудование не используется
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
		
		Если НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
			Объект.НомерЧекаККМ = 1;
		КонецЕсли;
		
		Модифицированность = Истина;
		
		Попытка
			РезультатПроведения = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			ПоказатьСкрытьСдачуНаКлиенте();
		Исключение
			ЗаполнитьОписаниеДляТЧЗапасыНаКлиенте();
			ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Не удалось выполнить проведение документа'"));
			Возврат;
		КонецПопытки;
		
		Если СформироватьТоварныйЧек И НЕ Объект.Ссылка.Пустая() Тогда
			
			ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
			ПараметрыОткрытия.ИмяМенеджераПечати = "Документ.ЧекККМ";
			ПараметрыОткрытия.ИменаМакетов		 = "ТоварныйЧек";
			МассивЧековККМ = Новый Массив;
			МассивЧековККМ.Добавить(Объект.Ссылка);
			ПараметрыОткрытия.ПараметрКоманды	 = МассивЧековККМ;
			ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
			
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
			
		КонецЕсли;
		ИнициализироватьНовыйЧек(Истина);
		ВывестиИнформациюНаДисплейПокупателя();
		Возврат;
	КонецЕсли;
		
	ИдентификаторУстройстваФР = ?(ЗначениеЗаполнено(ФискальныйРегистратор),
		ФискальныйРегистратор,
		Неопределено);
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		
		// Готовим данные
		ЕстьАлкогольнаяПродукцияЕГАИС = Неопределено;
		ТранспортныйМодуль = Неопределено;
		ДанныеЕГАИСДостаточны = Ложь;
		
		ОбщиеПараметры = ЗаблокироватьФормуИПодготовитьДанныеДляПробития(ТранспортныйМодуль, ДанныеЕГАИСДостаточны, ЕстьАлкогольнаяПродукцияЕГАИС);
		ОбщиеПараметры.ДатаВремя = ТекущаяДата();
		
		Контекст = Новый Структура();
		Контекст.Вставить("ЕстьАлкогольнаяПродукцияЕГАИС", ЕстьАлкогольнаяПродукцияЕГАИС);
		Контекст.Вставить("СформироватьТоварныйЧек", СформироватьТоварныйЧек);
		Контекст.Вставить("АдресТорговогоОбъекта", ОбщиеПараметры.АдресМагазина);
		
		Если ЕстьАлкогольнаяПродукцияЕГАИС Тогда
			Если НЕ ДанныеЕГАИСДостаточны Тогда
				Возврат;
			КонецЕсли;
			Контекст.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, Контекст);
		ПослеОткрытияЧека     = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека", ЭтотОбъект, Контекст);
		ПослеОшибкиПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
		
		МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(
			Оповещение, 
			УникальныйИдентификатор, 
			ОбщиеПараметры, 
			ИдентификаторУстройстваФР,
			,
			ПослеОткрытияЧека,
			ПослеОшибкиПечатиЧека
		);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Устройство для печати чеков не выбрано.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		БезОшибок = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПробитьЧек()

&НаСервере
Функция ЗаблокироватьФормуИПодготовитьДанныеДляПробития(ТранспортныйМодуль, ДанныеЕГАИСДостаточны, ЕстьАлкогольнаяПродукцияЕГАИС)
	
	ЭтаФорма.Доступность = Ложь;
	Возврат ПодготовитьДанныеДляПробитияЧека(ТранспортныйМодуль, ДанныеЕГАИСДостаточны, ЕстьАлкогольнаяПродукцияЕГАИС);
	
КонецФункции

&НаКлиенте
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ЕстьАлкогольнаяПродукцияЕГАИС Тогда
		
		НомерСмены = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыВыполнения.НомерСмены);
		Если НомерСмены = 0 Тогда
			НомерСмены = 1;
		КонецЕсли;
		
		НомерЧека = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыВыполнения.НомерЧека);
		Если НомерЧека = 0 Тогда
			НомерЧека = 1;
		КонецЕсли;
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("НомерСмены",    НомерСмены);
		ПараметрыОперации.Вставить("НомерЧека",     НомерЧека);
		ПараметрыОперации.Вставить("АдресТорговогоОбъекта", ДополнительныеПараметры.АдресТорговогоОбъекта);
		ПараметрыОперации.Вставить("СерийныйНомер", "");
		Если ПараметрыВыполнения.Свойство("ЗаводскойНомерФН") И ЗначениеЗаполнено(ПараметрыВыполнения.ЗаводскойНомерФН) Тогда
			ПараметрыОперации.СерийныйНомер = ПараметрыВыполнения.ЗаводскойНомерФН;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыОперации.СерийныйНомер) Тогда
			ПараметрыОперации.СерийныйНомер = "1";
		КонецЕсли;
		
		ИнтеграцияЕГАИСКлиент.ПередатьНемедленно(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ПередайтеДанные"),
			ПараметрыОперации,
			Новый ОписаниеОповещения("ПослеПередачиЧекаЕГАИС", ЭтотОбъект, ПараметрыВыполнения));
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт

	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	Попытка
		ШапкаЧека.НомерЧека = ШапкаЧека.НомерЧека + 1000000;
	Исключение
		ШапкаЧека.НомерЧека = 1000000;
	КонецПопытки;
	
	Если ШапкаЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств") Тогда
		ШапкаЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
	Иначе
		ШапкаЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	КонецЕсли;
	
	Если ДополнительныеПараметры.ЕстьАлкогольнаяПродукцияЕГАИС Тогда
		
		НомерСмены = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыВыполнения.НомерСмены);
		Если НомерСмены = 0 Тогда
			НомерСмены = 1;
		КонецЕсли;
		
		НомерЧека = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыВыполнения.НомерЧека);
		Если НомерЧека = 0 Тогда
			НомерЧека = 1;
		КонецЕсли;
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("НомерСмены",    НомерСмены);
		ПараметрыОперации.Вставить("НомерЧека",     НомерЧека + 1000000);
		ПараметрыОперации.Вставить("АдресТорговогоОбъекта", ДополнительныеПараметры.АдресТорговогоОбъекта);
		ПараметрыОперации.Вставить("СерийныйНомер", "");
		Если ПараметрыВыполнения.Свойство("ЗаводскойНомерФН") И ЗначениеЗаполнено(ПараметрыВыполнения.ЗаводскойНомерФН) Тогда
			ПараметрыОперации.СерийныйНомер = ПараметрыВыполнения.ЗаводскойНомерФН;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыОперации.СерийныйНомер) Тогда
			ПараметрыОперации.СерийныйНомер = "1";
		КонецЕсли;
		
		ИнтеграцияЕГАИСКлиент.ПередатьНемедленно(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ОтменитеОперацию"),
			ПараметрыОперации,
			Новый ОписаниеОповещения("ПослеПередачиОтменыЧекаЕГАИС", ЭтотОбъект, ПараметрыВыполнения));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПередачиЧекаЕГАИС(Изменения, ПараметрыВыполнения) Экспорт
	
	ЕстьОшибки = (Изменения.Количество() <> 1);
	
	Ошибки = Новый Массив;
	Для Каждого ЭлементДанных Из Изменения Цикл
		Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
			ЕстьОшибки = Истина;
			Ошибки.Добавить(ЭлементДанных.ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		Ошибки.Вставить(0, НСтр("ru = 'В процессе передачи данных в ЕГАИС возникли ошибки:'"));
	КонецЕсли;
	ОписаниеОшибки = СтрСоединить(Ошибки, Символы.ПС);
	
	ПараметрыВыполнения.ПродолжитьПечать = Не ЕстьОшибки;
	ПараметрыВыполнения.ОписаниеОшибки   = ОписаниеОшибки;
	
	ПараметрыВыполнения.Вставить("АдресЧека",   Изменения[0].ИдентификаторЗапроса);
	ПараметрыВыполнения.Вставить("ПодписьЧека", Изменения[0].Подпись);
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПередачиОтменыЧекаЕГАИС(Изменения, ПараметрыВыполнения) Экспорт
	
	ЕстьОшибки = (Изменения.Количество() <> 1);
	
	Ошибки = Новый Массив;
	Для Каждого ЭлементДанных Из Изменения Цикл
		Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
			ЕстьОшибки = Истина;
			Ошибки.Добавить(ЭлементДанных.ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		Ошибки.Вставить(0, НСтр("ru = 'В процессе передачи данных в ЕГАИС возникли ошибки:'"));
	КонецЕсли;
	ОписаниеОшибки = СтрСоединить(Ошибки, Символы.ПС);
	
	Если ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		
		// Установить полученное значение номера чека реквизиту документа.
		Если РезультатВыполнения.ВыходныеПараметры <> Неопределено Тогда
			Объект.НомерСменыККМ = РезультатВыполнения.ВыходныеПараметры[0];
			Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		КонецЕсли;
		
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
		
		Если НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
			Объект.НомерЧекаККМ = 1;
		КонецЕсли;
		
		Модифицированность = Истина;
		
		Попытка
			РезультатПроведения = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
			ПоказатьСкрытьСдачуНаКлиенте();
		Исключение
			ЗаполнитьОписаниеДляТЧЗапасыНаКлиенте();
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не удалось выполнить проведение документа'")); // Асинхронный метод!
			Возврат;
		КонецПопытки;
		
		Если Параметры.СформироватьТоварныйЧек И НЕ Объект.Ссылка.Пустая() Тогда
			
			ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
			ПараметрыОткрытия.ИмяМенеджераПечати = "Документ.ЧекККМ";
			ПараметрыОткрытия.ИменаМакетов		 = "ТоварныйЧек";
			МассивЧековККМ = Новый Массив;
			МассивЧековККМ.Добавить(Объект.Ссылка);
			ПараметрыОткрытия.ПараметрКоманды	 = МассивЧековККМ;
			ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
			
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
			
		КонецЕсли;
		ИнициализироватьНовыйЧек(Истина);
		ВывестиИнформациюНаДисплейПокупателя();
		
	Иначе
		
		ТекстСообщения = НСтр(
			"ru = 'При печати чека произошла ошибка.
			|Чек не напечатан на фискальном регистраторе.
			|Дополнительное описание:
			|%ДополнительноеОписание%'"
		);
		ТекстСообщения = СтрЗаменить(
			ТекстСообщения,
			"%ДополнительноеОписание%",
			РезультатВыполнения.ОписаниеОшибки
		);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	СформироватьЗаголовок(Неопределено);
	
КонецПроцедуры

// Функция выполняет получение состояния кассовой смены на сервере.
//
&НаСервереБезКонтекста
Функция ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ)
	
	Возврат РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
КонецФункции // ПолучитьСостояниеКассовойСменыНаСервере()

// Функция возвращает остаток денежных средств в кассе ККМ на сервере.
//
&НаСервереБезКонтекста
Функция ПолучитьОстатокДенежныхСредствВКассеККМНаСервере(КассаККМ)
	
	Возврат РозничныеПродажиСервер.ПолучитьОстатокДенежныхСредствВКассеККМ(КассаККМ);
	
КонецФункции // ПолучитьОстатокДенежныхСредствВКассеККМНаСервере()

// Процедура - обработчик события "ОткрытьКассовуюСмену".
//
&НаКлиенте
Процедура ОткрытьКассовуюСмену()
	
	ОписаниеОшибки = "";
	
	ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	ИспользоватьБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КассаККМ", КассаККМ);
	ДополнительныеПараметры.Вставить("СтруктурнаяЕдиница", ПараметрыКассыККМ.СтруктурнаяЕдиница);
	ДополнительныеПараметры.Вставить("Организация", ПараметрыКассыККМ.Организация);
	
	Если ИспользоватьПодключаемоеОборудование И НЕ ИспользоватьБезПодключенияОборудования И ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		
		ЭтаФорма.Доступность = Ложь;
		
		ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		
		РеквизитыКассира = РозничныеПродажиСервер.ПолучитьРеквизитыКассира(Объект.Автор);
		Если РеквизитыКассира.ИмяКассираИДолжность <> "" Тогда
			ПараметрыОперации.Кассир = РеквизитыКассира.ИмяКассираИДолжность;
			ПараметрыОперации.КассирИНН = РеквизитыКассира.КассирИНН;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ОткрытьКассовуюСменуЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(
			Оповещение,
			УникальныйИдентификатор,
			ПараметрыОперации,
			ИдентификаторУстройства,
			,
			ДополнительныеПараметры
		);
	Иначе
		Результат = ОткрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки);
		Если НЕ Результат Тогда
			ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка.
			                            |Смена не открыта.
			                            |Дополнительное описание:
			                            |%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		ОбновитьСостояниеКассовойСмены(КассаККМ);
	КонецЕсли;
	
КонецПроцедуры // ОткрытьКассовуюСмену()

&НаКлиенте
Процедура ОткрытьКассовуюСменуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	Если РезультатВыполнения.Результат Тогда 
		ОписаниеОшибки = "";
		Результат = ОткрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки); 
		Если НЕ Результат Тогда
			ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка. Смена не открыта.
							       |Дополнительное описание: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		ОбновитьСостояниеКассовойСмены(КассаККМ);
	Иначе
		ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка.
			                      |Смена не открыта на фискальном регистраторе.
			                      |%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеКассовойСмены(КассаККМ)
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
	СформироватьЗаголовокНаКлиенте(СтруктураСостояниеКассовойСмены);
	
КонецПроцедуры

// Функция выполняет открытие кассовой смены на сервере.
//
&НаСервере
Функция ОткрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки = "")
	
	Результат = РозничныеПродажиСервер.ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки);
	Возврат Результат;
	
КонецФункции // ОткрытьКассовуюСменуНаСервере()

// Процедура выполняет закрытие кассовой смены на сервере.
//
&НаСервере
Функция ЗакрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки = "", СсылкаНаОтчет = Неопределено)
	
	//Возврат Документы.ОтчетОРозничныхПродажах.СформироватьОтчетОРозничныхПродажахИВыполнитьАрхивацию(КассаККМ, ОписаниеОшибки);
	Возврат РозничныеПродажиСервер.ЗакрытьКассовуюСмену(КассаККМ, ОписаниеОшибки, СсылкаНаОтчет);
	
КонецФункции // ЗакрытьКассовуюСменуНаСервере()

// Процедура - обработчик команды "ВнесениеДенег".
//
&НаКлиенте
Процедура ВнесениеДенег(Команда)
	
	Если Не СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		ТекстСообщения = НСтр("ru = 'Внесение денег производится только при открытой кассовой смене'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
	ИспользоватьБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		ОткрытьФормуДляВыбораРасходаИзКассы(Истина);
	ИначеЕсли МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОткрытьФормуДляВыбораРасходаИзКассы(Ложь);
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "ВнесениеДенег".
//
&НаКлиенте
Процедура ВнесениеДенегЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено И ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	Иначе
		ОстатокВКассеСтрока = "" + ПолучитьОстатокДенежныхСредствВКассеККМНаСервере(КассаККМ);
	КонецЕсли;
	
	ВносимаяСумма = ?(Результат = Неопределено, ДополнительныеПараметры.ВносимаяСумма, Результат);
	
	Если (Результат <> Неопределено) Тогда
		
		ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
		ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
		ИспользоватьБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
		
		ЭтаФорма.Доступность = Ложь; // Блокируем интерфейс пользователя.
			
		Если ИдентификаторУстройства <> Неопределено Тогда
			ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыИнкассации();
			ПараметрыОперации.ТипИнкассации = 1;
			ПараметрыОперации.Сумма = ВносимаяСумма;
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ВнесениеДенег()

&НаКлиенте
Процедура ИнкассацияНаФискальномУстройствеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина; // Разблокировка интерфейса пользователя.
	
	Если НЕ РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка.
			                        |Чек не напечатан на фискальном устройстве.
			                        |Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Если Параметры <> Неопределено И Параметры.Свойство("СоздатьВыемкуНаличных") И Параметры.СоздатьВыемкуНаличных Тогда
		
		ДополнительныеПараметры = Новый Структура("ИзымаемаяСумма", Параметры.Сумма);
		
		Если Параметры.Свойство("ОповещениеЗакрытияСмены") Тогда
			ДополнительныеПараметры.Вставить("ОповещениеЗакрытияСмены", Параметры.ОповещениеЗакрытияСмены);
		КонецЕсли;
		
		Если Параметры.Свойство("ОповещениеПоступленияВКассу") Тогда
			ДополнительныеПараметры.Вставить("ОповещениеПоступленияВКассу", Параметры.ОповещениеПоступленияВКассу);
		КонецЕсли;
		
		СформироватьДокументВыемки(Параметры.Сумма, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РассчитатьСуммуВыемки(ОстатокВКассе, ПараметрыКассыККМ);
	
	СуммаВыемки = Макс(ОстатокВКассе - ПараметрыКассыККМ.МинимальныйОстатокВКассеККМ, 0);
	
	Возврат СуммаВыемки;
	
КонецФункции

// Процедура - обработчик команды "ИзъятиеДенег".
//
&НаКлиенте
Процедура ВыемкаДенег(Команда, ПараметрыКассыККМ = Неопределено, ОповещениеЗакрытияСмены = Неопределено)
	
	Если Не СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		ТекстСообщения = НСтр("ru = 'Выемка денег производится только при открытой кассовой смене'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыКассыККМ = Неопределено Тогда
		ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
	КонецЕсли;
	
	ИспользоватьБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	ИзымаемаяСумма = РассчитатьСуммуВыемки(ПолучитьОстатокДенежныхСредствВКассеККМНаСервере(КассаККМ), ПараметрыКассыККМ);
	ЗаголовокОкна = НСтр("ru='Сумма выемки, %Валюта%'");
	ЗаголовокОкна = СтрЗаменить(
		ЗаголовокОкна,
		"%Валюта%",
		СтруктураСостояниеКассовойСмены.ВалютаДокументаПредставление
	);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИзымаемаяСумма", ИзымаемаяСумма);
	ДополнительныеПараметры.Вставить("ОповещениеЗакрытияСмены", ОповещениеЗакрытияСмены);
	Если ОповещениеЗакрытияСмены <> Неопределено И ПараметрыКассыККМ.СоздаватьПоступлениеВКассу Тогда
		ОповещениеПоступленияВКассу = Новый ОписаниеОповещения("СоздатьПоступлениеВКассу", ЭтотОбъект, ПараметрыКассыККМ.КассаДляРозничнойВыручки);
		ДополнительныеПараметры.Вставить("ОповещениеПоступленияВКассу", ОповещениеПоступленияВКассу);
	КонецЕсли;
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		ПоказатьВводЧисла(Новый ОписаниеОповещения("СформироватьДокументВыемки", ЭтотОбъект, ДополнительныеПараметры), ИзымаемаяСумма, ЗаголовокОкна, 15, 2);
	ИначеЕсли МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ПоказатьВводЧисла(Новый ОписаниеОповещения("ВыемкаДенегЗавершение", ЭтотОбъект, ДополнительныеПараметры), ИзымаемаяСумма, ЗаголовокОкна, 15, 2);
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "ИзъятиеДенег".
//
&НаКлиенте
Процедура ВыемкаДенегЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИзымаемаяСумма = ?(Результат = Неопределено, ДополнительныеПараметры.ИзымаемаяСумма, Результат);
	
	Если (Результат <> Неопределено) И (Результат <> 0) Тогда
		
		ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
		ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
		ИспользоватьБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
		
		ЭтаФорма.Доступность = Ложь; // Блокируем интерфейс пользователя.
		
		Если ИдентификаторУстройства <> Неопределено Тогда
			ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыИнкассации();
			ПараметрыОперации.ТипИнкассации = 0;
			ПараметрыОперации.Сумма = ИзымаемаяСумма;
			ПараметрыОповещения = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыОперации);
			ПараметрыОповещения.Вставить("СоздатьВыемкуНаличных", Истина);
			Если ДополнительныеПараметры.Свойство("ОповещениеЗакрытияСмены") Тогда
				ПараметрыОповещения.Вставить("ОповещениеЗакрытияСмены", ДополнительныеПараметры.ОповещениеЗакрытияСмены);
			КонецЕсли;
			Если ДополнительныеПараметры.Свойство("ОповещениеПоступленияВКассу") Тогда
				ПараметрыОповещения.Вставить("ОповещениеПоступленияВКассу", ДополнительныеПараметры.ОповещениеПоступленияВКассу);
			КонецЕсли;
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект, ПараметрыОповещения);
			МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства);
		КонецЕсли;
		
	Иначе
		
		Если ДополнительныеПараметры.Свойство("ОповещениеЗакрытияСмены") И ДополнительныеПараметры.ОповещениеЗакрытияСмены <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗакрытияСмены, Результат);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ВыемкаДенегЗавершение()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуРеквизитыИсключения(МассивРеквизитовДляИнициализацииНовогоЧека = Неопределено)
	
	СтрокаИсключений = "Ответственный, Подразделение, ВидЦен, НалогообложениеНДС, СуммаВключаетНДС";
	
	Если ТипЗнч(МассивРеквизитовДляИнициализацииНовогоЧека) = Тип("Массив") Тогда
		МассивРеквизитовДляИнициализацииНовогоЧека.Добавить("ВидЦен");
		МассивРеквизитовДляИнициализацииНовогоЧека.Добавить("НалогообложениеНДС");
		МассивРеквизитовДляИнициализацииНовогоЧека.Добавить("СуммаВключаетНДС");
	КонецЕсли;
	
	Возврат СтрокаИсключений;
	
КонецФункции

// Процедура вызывается при нажатии кнопки НапечататьЧек командной панели.
//
&НаКлиенте
Процедура ПробитьЧекВыполнить(Команда, СформироватьТоварныйЧек = Ложь)
	
	Если ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.СтатусКассовойСмены) Тогда
		ЗаполнитьЗначенияСвойств(Объект, СтруктураСостояниеКассовойСмены,, ПолучитьСтрокуРеквизитыИсключения());
		Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
		ОстатокВКассе = СтруктураСостояниеКассовойСмены.НаличностьВКассе;
		ОстатокВКассеСтрока = "" + ОстатокВКассе;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если Объект.ПометкаУдаления Тогда
		
		ТекстОшибки = НСтр("ru='Документ помечен на удаление'");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Объект.СуммаДокумента > Объект.ПолученоНаличными + Объект.БезналичнаяОплата.Итог("Сумма") + Объект.Предоплата.Итог("СуммаРасчетов") Тогда
		
		ТекстОшибки = НСтр("ru='Сумма оплаты меньше суммы чека'");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Поле = "СуммаСдачи";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Объект.СуммаДокумента < Объект.БезналичнаяОплата.Итог("Сумма") + Объект.Предоплата.Итог("СуммаРасчетов") Тогда
		
		ТекстОшибки = НСтр("ru='Сумма оплаты платежными картами превышает сумму чека'");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Поле = "СуммаСдачи";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ Отказ И ПроверитьЗаполнение() Тогда
		
		// СтандартныеПодсистемы.ОценкаПроизводительности
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ПробитьЧек"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
		// СтандартныеПодсистемы.ОценкаПроизводительности
		
		ПробитьЧек(СформироватьТоварныйЧек);
		
		//СформироватьЗаголовок(Неопределено);
		СформироватьЗаголовокНаКлиенте(СтруктураСостояниеКассовойСмены);
		
	КонецЕсли;
	
КонецПроцедуры // ПробитьЧекВыполнить()

// Процедура печати X-отчёта.
//
&НаКлиенте
Процедура ПечатьОтчетаБезгашенияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция успешна завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Процедура - обработчик команды "ПечатьОтчетаБезГашения".
//
&НаКлиенте
Процедура ПечатьОтчетаБезГашенияВыполнить()
	
	ЭтаФорма.Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	РеквизитыКассира = РозничныеПродажиСервер.ПолучитьРеквизитыКассира(Объект.Автор);
	ФИОКассира = РеквизитыКассира.ИмяКассираИДолжность;
	Если ЗначениеЗаполнено(ФИОКассира) Тогда
		ПараметрыОперации.Кассир = ФИОКассира;
		ПараметрыОперации.КассирИНН = РеквизитыКассира.КассирИНН;
	Иначе
		ПараметрыОперации.Кассир = НСтр("ru='Администратор'");
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения("ПечатьОтчетаБезГашенияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(
		Оповещение,
		УникальныйИдентификатор,
		ПараметрыОперации
	);
	
КонецПроцедуры // ПечатьОтчетаБезГашенияВыполнить()

// Процедура - обработчик команды "ПечатьОтчетаБезГашения".
//
&НаКлиенте
Процедура ПечатьОтчетаБезГашенияВыполнитьМояКасса()
	
	ЭтаФорма.Доступность = Ложь;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	РеквизитыКассира = РозничныеПродажиСервер.ПолучитьРеквизитыКассира(Объект.Автор);
	ФИОКассира = РеквизитыКассира.ИмяКассираИДолжность;
	Если ЗначениеЗаполнено(ФИОКассира) Тогда
		ПараметрыОперации.Кассир = ФИОКассира;
		ПараметрыОперации.КассирИНН = РеквизитыКассира.КассирИНН;
	Иначе
		ПараметрыОперации.Кассир = НСтр("ru='Администратор'");
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения("ПечатьОтчетаБезГашенияЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьФормированиеОтчетаБезГашения(
		Оповещение,
		УникальныйИдентификатор,
		ПараметрыОперации
	);

КонецПроцедуры // ПечатьОтчетаБезГашенияВыполнить()

// Процедура - обработчик команды "ЗакрытьКассовуюСмену".
//
&НаКлиенте
Процедура ЗакрытьКассовуюСмену(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		ТекстОшибки = НСтр("ru='Выберите кассу ККМ!'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,
			,
			"КассаККМ"
		);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
	Если Не ПараметрыКассыККМ.СоздаватьВыемку Тогда
		ЗакрытьКассовуюСменуПродолжение(Истина, Новый Структура);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ЗакрытьКассовуюСменуПродолжение", ЭтотОбъект);
		ВыемкаДенег(Неопределено, ПараметрыКассыККМ, Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКассовуюСменуПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	ИспользоватьБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	СостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		СформироватьОтчетОРозничныхПродажах(ИспользоватьБезПодключенияОборудования);
	ИначеЕсли ИспользоватьПодключаемоеОборудование И ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		
		ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		РеквизитыКассира = РозничныеПродажиСервер.ПолучитьРеквизитыКассира(Объект.Автор);
		Если РеквизитыКассира.ИмяКассираИДолжность <> "" Тогда
			ПараметрыОперации.Кассир = РеквизитыКассира.ИмяКассираИДолжность;
			ПараметрыОперации.КассирИНН = РеквизитыКассира.КассирИНН;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПечатьФискальногоОтчетаЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(
			Оповещение, 
			УникальныйИдентификатор,
			ПараметрыОперации,
			ИдентификаторУстройства, 
			,
			СостояниеКассовойСмены.КассоваяСмена
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОРозничныхПродажах(ИспользоватьБезПодключенияОборудования) Экспорт
	
	ОписаниеОшибки = "";
	
	// 1. Заполнение отчета о розничных продажах.
	Документ = СформироватьОтчетОРозничныхПродажахНаСервере(КассаККМ, ОписаниеОшибки); 
	
	Если ЗначениеЗаполнено(ОписаниеОшибки)
	   И ИспользоватьБезПодключенияОборудования Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
	ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки)
		 И НЕ ИспользоватьБезПодключенияОборудования Тогда
		ТекстСообщения = НСтр(
			"ru = 'При формировании отчета о розничных продажах возникли ошибки.
			|Дополнительное описание:
			|%ДополнительноеОписание%'"
		);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// 2. Заполнение параметров кассовой смены.
	Результат = ЗакрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки); 
	Если НЕ Результат Тогда
		ТекстСообщения = НСтр("ru = 'При закрытии смены произошла ошибка.
		                            |Смена не закрыта.
		                            |Дополнительное описание:
		                            |%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// Все результирующие документы выводим пользователю.
	Если Документ <> Неопределено Тогда
		ОткрытьФорму("Документ.ОтчетОРозничныхПродажах.ФормаОбъекта", Новый Структура("Ключ", Документ));
		
		Если СверятьИтогиНаЭТПриЗакрытииСмены И ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговЗавершение", ЭтотОбъект);
			МенеджерОборудованияКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьНовыйЧек();
	Элементы.Список.Обновить();
	Оповестить("ОбновитьФормыПослеСнятияZОтчета");
	
КонецПроцедуры

// Процедура выполняет закрытие кассовой смены на сервере.
//
&НаСервере
Функция СформироватьОтчетОРозничныхПродажахНаСервере(КассаККМ, ОписаниеОшибки = "")
	
	Возврат Документы.ОтчетОРозничныхПродажах.СформироватьОтчетОРозничныхПродажахИВыполнитьАрхивацию(КассаККМ, ОписаниеОшибки);
	
КонецФункции // СформироватьОтчетОРозничныхПродажахНаСервере()

&НаКлиенте
Процедура ПечатьФискальногоОтчетаЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина; // Разблокировка интерфейса пользователя.
	
	Если РезультатВыполнения.Результат Тогда
		СформироватьОтчетОРозничныхПродажах(Ложь);
	Иначе
		ТекстСообщения = НСтр(
			"ru = 'При закрытии смены на фискальном регистраторе произошла ошибка.
			|""%ОписаниеОшибки%""
			|Отчет на фискальном регистраторе не сформирован.'"
		);
		ТекстСообщения = СтрЗаменить(
			ТекстСообщения,
			"%ОписаниеОшибки%",
			РезультатВыполнения.ОписаниеОшибки
		);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ИнициализироватьНовыйЧек();
		Элементы.Список.Обновить();
		Оповестить("ОбновитьФормыПослеСнятияZОтчета");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнийОтчетОРозничныхПродажахЗаЗакрытуюКассовуюСмену()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОтчетОРозничныхПродажах.Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Проведен
		|	И ОтчетОРозничныхПродажах.КассоваяСмена.Статус <> &СтатусКассовойСмены
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетОРозничныхПродажах.МоментВремени УБЫВ";
	
	Запрос.УстановитьПараметр("СтатусКассовойСмены", Перечисления.СтатусыКассовойСмены.Открыта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ОтчетОРозничныхПродажах.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьПоследнююЗакрытуюКассовуюСмену()

&НаСервере
Функция ПараметрыОперацииАннулированияЧекаККМ()
	
	// Подготовка таблицы общих параметров.
	ТипЧека = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыОперацииАннулированияЧека();
	ПараметрыОперации.ТипРасчета = ТипЧека;
	
	Возврат ПараметрыОперации;
	
КонецФункции

// Процедура аннулирования чека на фискальном регистраторе.
//
&НаКлиенте
Процедура АннулироватьЧекККМ(КассаККМ)
	
	ОписаниеОшибки = "";
	
	ПараметрыКассыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройстваФР              = ПараметрыКассыККМ.ИдентификаторУстройства;
	
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	Если НЕ ИспользоватьПодключаемоеОборудование 
		ИЛИ ИспользоватьКассуККМБезПодключенияОборудования Тогда
		Возврат;

	КонецЕсли;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		
		ЭтаФорма.Доступность = Ложь; // Блокируем интерфейс пользователя.
		
		ПараметрыОперацииАннулирования = ПараметрыОперацииАннулированияЧекаККМ();
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("АннулированиеЧекаЗавершение", ЭтотОбъект);
		
		МенеджерОборудованияКлиент.НачатьАннулированиеЧекаНаФискальномУстройстве(
			ОповещениеПриЗавершении, 
			УникальныйИдентификатор, 
			ПараметрыОперацииАннулирования, 
			ИдентификаторУстройстваФР);
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Не выбран фискальный регистратор.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура АннулированиеЧекаЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина; // Разблокировка интерфейса пользователя.
	
	Если НЕ РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр("ru = 'При аннулировании чека произошла ошибка. Чек не аннулирован на фискальном регистраторе.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
				"%ДополнительноеОписание%",
				РезультатВыполнения.ОписаниеОшибки
		);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды АннулированиеЧека формы.
//
&НаКлиенте
Процедура АннулированиеЧека(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("АннулированиеЧекаОтветНаВопрос", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Аннулировать последний чек?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Процедура - обработчик команды АннулированиеЧека формы. Вызывается полсе подтверждение аннулирования в окне вопроса.
//
&НаКлиенте
Процедура АннулированиеЧекаОтветНаВопрос(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		АннулироватьЧекККМ(КассаККМ);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды ПечатьКопииНаФискальномРегистраторе формы.
//
&НаКлиенте
Процедура ПечатьКопииНаФискальномРегистраторе(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПустаяСтрока(глПодключаемоеОборудование.ПоследнийСлипЧек) Тогда
		ЭтаФорма.Доступность = Ложь;
		Оповещение = Новый ОписаниеОповещения("НапечататьПоследнийСлипЧекЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, глПодключаемоеОборудование.ПоследнийСлипЧек);
	
	Иначе
		ТекстСообщения = НСтр("ru = 'Отсутствует последний слип чек.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды НапечататьПоследнийСлипЧек.
//
&НаКлиенте
Процедура НапечататьПоследнийСлипЧекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КассовыеСмены(Команда)
	
	ОткрытьФорму("Документ.КассоваяСмена.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировочныеЧеки(Команда)
	
	ОткрытьФорму("Документ.ЧекККМКоррекции.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДляВыбораРасходаИзКассы(БезПодключения = Истина)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Касса", КассаККМ);
	
	Если БезПодключения Тогда
		ОткрытьФорму("Документ.РасходИзКассы.Форма.ФормаВнесенияНаличных",
			ПараметрыОткрытия,
			ЭтотОбъект,,,,
			Новый ОписаниеОповещения("ВнесениеДенегБезОборудованияЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Документ.РасходИзКассы.Форма.ФормаВнесенияНаличных",
			ПараметрыОткрытия,
			ЭтотОбъект,,,,
			Новый ОписаниеОповещения("ВнесениеДенегЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнесениеДенегБезОборудованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОстатокВКассеСтрока = "" + ПолучитьОстатокДенежныхСредствВКассеККМНаСервере(КассаККМ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументВыемки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат <> 0 Тогда
		
		ДокументВыемка = СформироватьДокументВыемкиНаСервере(Результат, ДополнительныеПараметры.ИзымаемаяСумма);
		
		Если ДокументВыемка <> Неопределено Тогда
			ПоказатьОповещениеПользователя(НСтр("ru = 'Создан документ'"),
										   ПолучитьНавигационнуюСсылку(ДокументВыемка), ДокументВыемка);
			ОстатокВКассеСтрока = "" + ПолучитьОстатокДенежныхСредствВКассеККМНаСервере(КассаККМ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеПоступленияВКассу") И ДополнительныеПараметры.ОповещениеПоступленияВКассу <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПоступленияВКассу, ДокументВыемка);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеЗакрытияСмены") И ДополнительныеПараметры.ОповещениеЗакрытияСмены <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗакрытияСмены, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьДокументВыемкиНаСервере(Результат, ИзымаемаяСумма)
	
	СуммаДокумента = ?(Результат = Неопределено, ИзымаемаяСумма, Результат);
	
	Если Результат <> Неопределено Тогда
		
		ДокументВыемка = Документы.ВыемкаНаличных.СоздатьДокумент();
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Дата", ТекущаяДата());
		СтруктураЗаполнения.Вставить("СуммаДокумента", СуммаДокумента);
		СтруктураЗаполнения.Вставить("КассаККМ", КассаККМ);
		СтруктураЗаполнения.Вставить("ВалютаДенежныхСредств", КассаККМ.ВалютаДенежныхСредств);
		СтруктураЗаполнения.Вставить("Организация", КассаККМ.Владелец);
		СтруктураЗаполнения.Вставить("ОтчетОРозничныхПродажах", СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах);
		ДокументВыемка.Заполнить(СтруктураЗаполнения);
		ДокументВыемка.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат ДокументВыемка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПоступлениеВКассу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоступлениеВКассу = СоздатьПоступениеВКассуНаСервере(Результат, ДополнительныеПараметры);
	
	Если ПоступлениеВКассу <> Неопределено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Создан документ'"),
									   ПолучитьНавигационнуюСсылку(ПоступлениеВКассу), ПоступлениеВКассу);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПоступениеВКассуНаСервере(Основание, Касса)
	
	ЕстьПравоЧтения = ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеВКассу, Пользователи.ТекущийПользователь());
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПоступлениеВКассу = Документы.ПоступлениеВКассу.СоздатьДокумент();
	
	ПоступлениеВКассу.Заполнить(Основание);
	ПоступлениеВКассу.Касса = Касса;
	ПоступлениеВКассу.Дата = ТекущаяДатаСеанса();
	ПоступлениеВКассу.Записать(РежимЗаписиДокумента.Проведение);
	
	Если ЕстьПравоЧтения Тогда
		Возврат ПоступлениеВКассу.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура устанавливает режим Только просмотр.
//
Процедура УстановитьРежимТолькоПросмотр()
	
	ТолькоПросмотр = Истина; // Чек пробит. Изменение информации запрещено.
	Элементы.ПринятьОплату.Доступность = Ложь;
	Элементы.ЦеныИВалюта.Доступность = Ложь;
	Элементы.ЗапасыВес.Доступность = Ложь;
	Элементы.ЗапасыПодбор.Доступность = Ложь;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Доступность = Ложь;
	
КонецПроцедуры // УстановитьРежимТолькоПросмотр()

// Процедура устанавливает доступность печати чека.
//
&НаСервере
Процедура УстановитьДоступностьПечатиЧека()
	
	Если Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
	 ИЛИ Объект.КассаККМ.ИспользоватьБезПодключенияОборудования
	 ИЛИ КонтрольНаСкладеОтключен Тогда
		Элементы.ПринятьОплату.Доступность = Истина;
	Иначе
		Элементы.ПринятьОплату.Доступность = Истина; // Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьПечатиЧека()

// Процедура устанавливает заголовки кнопок и комбинации клавиш для команд формы.
//
&НаСервере
Процедура НастроитьКнопкиИКомандыМеню()
	
	Если Не ЗначениеЗаполнено(НастройкаРМК) Тогда
		// Сообщение выдаём в процедуре "ЗаполнитьБыстрыеТовары()".
		Возврат;
	КонецЕсли;
	
	// Удалим элементы
	МассивУдаляемыхЭлементов = Новый Массив;
	Для Каждого Элемент Из Элементы.ГруппаСлужебнаяКоманды.ПодчиненныеЭлементы Цикл
		МассивУдаляемыхЭлементов.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
		Попытка
			Элементы.Удалить(Элемент);
		Исключение КонецПопытки;
	КонецЦикла;
	// Конец Удалим элементы
	
	НеПоказыватьПриОткрытииФормуВыбораКассы = НастройкаРМК.НеПоказыватьПриОткрытииФормуВыбораКассы;
	СверятьИтогиНаЭТПриЗакрытииСмены = НастройкаРМК.СверятьИтогиНаЭТПриЗакрытииСмены;
	
	ПоискНоменклатурыПоШтрихКодуЗначениеНастройкиРМК = НастройкаРМК.ПоискНоменклатурыПоШтрихКоду;
	ПоискНоменклатурыПоШтрихКоду = ПоискНоменклатурыПоШтрихКодуЗначениеНастройкиРМК;
	Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду.Видимость = ПоискНоменклатурыПоШтрихКоду;
	Элементы.ЗначениеПоискаНоменклатуры.Видимость = Не ПоискНоменклатурыПоШтрихКоду;
	
	Для Каждого ТекущаяНастройкаКнопкиКоманды Из НастройкаРМК.КнопкиНижнейПанели Цикл
		Попытка
			Если ТекущаяНастройкаКнопкиКоманды.ИмяКнопки = "ЗначениеПоискаНоменклатуры" Тогда
				Если ЗначениеЗаполнено(ТекущаяНастройкаКнопкиКоманды.Клавиша) Тогда
					Элементы.ЗначениеПоискаНоменклатуры.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша[ТекущаяНастройкаКнопкиКоманды.Клавиша], ТекущаяНастройкаКнопкиКоманды.Alt,
						ТекущаяНастройкаКнопкиКоманды.Ctrl, ТекущаяНастройкаКнопкиКоманды.Shift);
					Элементы.ЗначениеПоискаНоменклатуры.ПодсказкаВвода = "Введите наименование, код или артикул "+ПредставлениеСочетанияКлавиш(Элементы.ЗначениеПоискаНоменклатуры.СочетаниеКлавиш, Ложь);
				Иначе
					Элементы.ЗначениеПоискаНоменклатуры.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Нет);
					Элементы.ЗначениеПоискаНоменклатуры.ПодсказкаВвода = "Введите наименование, код или артикул";
				КонецЕсли;
			Иначе
				ТекущаяКнопка = Элементы[ТекущаяНастройкаКнопкиКоманды.ИмяКнопки];
				ТекущаяКоманда = Команды[ТекущаяНастройкаКнопкиКоманды.ИмяКоманды];
				
				// Невидимый элементы, чтобы быстрые клавиши работали, когда дополнительная панель не активна.
				ИмяКнопки = ТекущаяНастройкаКнопкиКоманды.ИмяКнопки+"_НевидимаяКнопка";
				НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаСлужебнаяКоманды);
				НоваяКнопка.Отображение = ОтображениеКнопки.Текст;
				НоваяКнопка.ТолькоВоВсехДействиях = Истина;
				НоваяКнопка.Видимость = Истина;
				НоваяКнопка.ИмяКоманды = ТекущаяНастройкаКнопкиКоманды.ИмяКоманды;
				НоваяКнопка.Ширина = 1;
				НоваяКнопка.Высота = 1;
				Если ЗначениеЗаполнено(ТекущаяНастройкаКнопкиКоманды.Клавиша) Тогда
					НоваяКнопка.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша[ТекущаяНастройкаКнопкиКоманды.Клавиша], ТекущаяНастройкаКнопкиКоманды.Alt,
						ТекущаяНастройкаКнопкиКоманды.Ctrl, ТекущаяНастройкаКнопкиКоманды.Shift);
				Иначе
					НоваяКнопка.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Нет);
				КонецЕсли;
				// Конец Невидимый элемент
				
				Если ЗначениеЗаполнено(ТекущаяНастройкаКнопкиКоманды.ИмяКнопки) Тогда
					ТекущаяКнопка.Заголовок = ТекущаяНастройкаКнопкиКоманды.ЗаголовокКнопки;
					
					Если ТекущаяНастройкаКнопкиКоманды.ИмяКнопки = "ПоказатьЖурнал" Тогда
						Элементы.ПереключательЖурналБыстрыеТовары.СписокВыбора.Получить(0).Представление = ТекущаяНастройкаКнопкиКоманды.ЗаголовокКнопки;
					ИначеЕсли ТекущаяНастройкаКнопкиКоманды.ИмяКнопки = "ПоказатьБыстрыеТовары" Тогда
						Элементы.ПереключательЖурналБыстрыеТовары.СписокВыбора.Получить(1).Представление = ТекущаяНастройкаКнопкиКоманды.ЗаголовокКнопки;
					ИначеЕсли ТекущаяНастройкаКнопкиКоманды.ИмяКнопки = "ПоказатьМоюКассу" Тогда
						Элементы.ПереключательЖурналБыстрыеТовары.СписокВыбора.Получить(2).Представление = ТекущаяНастройкаКнопкиКоманды.ЗаголовокКнопки;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекущаяНастройкаКнопкиКоманды.Клавиша) Тогда
					ТекущаяКоманда.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша[ТекущаяНастройкаКнопкиКоманды.Клавиша], ТекущаяНастройкаКнопкиКоманды.Alt,
						ТекущаяНастройкаКнопкиКоманды.Ctrl, ТекущаяНастройкаКнопкиКоманды.Shift);
				Иначе
					ТекущаяКоманда.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Нет);
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Произошла ошибка при настройке кнопок и команд меню. "+ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента СвернутьРазвернутьБоковуюПанельПродаж формы.
//
&НаКлиенте
Процедура СвернутьРазвернутьБоковуюПанельПродажНажатие(Элемент)
	
	СвернутьРазвернутьБоковуюПанельПродажНажатиеНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента СвернутьРазвернутьБоковуюПанельПродаж на сервере.
//
&НаСервере
Процедура СвернутьРазвернутьБоковуюПанельПродажНажатиеНаСервере()
	
	Если Элементы.СвернутьРазвернутьБоковуюПанельПродаж.Заголовок = ">>" Тогда
		Элементы.БоковаяПанельПродажи.Видимость = Ложь;
		Элементы.СвернутьРазвернутьБоковуюПанельПродаж.Заголовок = "<<";
		Элементы.СвернутьРазвернутьБоковуюПанельПродаж.Картинка = БиблиотекаКартинок.РМК_РазвернутьДополнительнуюПанель;
	Иначе
		Элементы.БоковаяПанельПродажи.Видимость = Истина;
		Элементы.СвернутьРазвернутьБоковуюПанельПродаж.Заголовок = ">>";
		Элементы.СвернутьРазвернутьБоковуюПанельПродаж.Картинка = БиблиотекаКартинок.РМК_СвернутьДополнительнуюПанель;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента СвернутьБоковуюПанельВозвраты формы.
//
&НаКлиенте
Процедура СвернутьБоковуюПанельВозвратыНажатие(Элемент)
	
	СвернутьБоковуюПанельВозвратыНажатиеНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента СвернутьБоковуюПанельВозвраты на сервере.
//
&НаСервере
Процедура СвернутьБоковуюПанельВозвратыНажатиеНаСервере()
	
	Если Элементы.СвернутьБоковуюПанельВозвраты.Заголовок = ">>" Тогда
		Элементы.БоковаяПанельВозвраты.Видимость = Ложь;
		Элементы.СвернутьБоковуюПанельВозвраты.Заголовок = "<<";
		Элементы.СвернутьБоковуюПанельВозвраты.Картинка = БиблиотекаКартинок.РМК_РазвернутьДополнительнуюПанель;
	Иначе
		Элементы.БоковаяПанельВозвраты.Видимость = Истина;
		Элементы.СвернутьБоковуюПанельВозвраты.Заголовок = ">>";
		Элементы.СвернутьБоковуюПанельВозвраты.Картинка = БиблиотекаКартинок.РМК_СвернутьДополнительнуюПанель;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента СвернутьБоковуюПанельЗаказы формы.
//
&НаКлиенте
Процедура СвернутьБоковуюПанельЗаказыНажатие(Элемент)
	
	СвернутьБоковуюПанельЗаказыНажатиеНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента СвернутьБоковуюПанельЗаказы на сервере.
//
&НаСервере
Процедура СвернутьБоковуюПанельЗаказыНажатиеНаСервере()
	
	Если Элементы.СвернутьРазвернутьБоковуюПанельЗаказы.Заголовок = ">>" Тогда
		Элементы.ПраваяПанельСтраницы.Видимость = Ложь;
		Элементы.СвернутьРазвернутьБоковуюПанельЗаказы.Заголовок = "<<";
		Элементы.СвернутьРазвернутьБоковуюПанельЗаказы.Картинка = БиблиотекаКартинок.РМК_РазвернутьДополнительнуюПанель;
	Иначе
		Элементы.ПраваяПанельСтраницы.Видимость = Истина;
		Элементы.СвернутьРазвернутьБоковуюПанельЗаказы.Заголовок = ">>";
		Элементы.СвернутьРазвернутьБоковуюПанельЗаказы.Картинка = БиблиотекаКартинок.РМК_СвернутьДополнительнуюПанель;
	КонецЕсли;
	
КонецПроцедуры

// Процедура изменяет видимость страницы, на которой отображается СДАЧА.
//
&НаСервере
Процедура ПоказатьСкрытьСдачуНаСервере(Показать = Истина, Проверять = Ложь)
	
	Если Не Проверять ИЛИ Не Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке Тогда
		СдачаСтрока = "Сдача: "+Сдача+" "+УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(Объект.ВалютаДокумента, "СимвольноеПредставление");
		
		Если Показать Тогда
			Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаСдача;
		Иначе
			Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура изменяет видимость страницы, на которой отображается СДАЧА.
//
&НаКлиенте
Процедура ПоказатьСкрытьСдачуНаКлиенте(Показать = Истина, Проверять = Ложь)
	
	Если Не Проверять ИЛИ Не Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке Тогда
		СдачаСтрока = "Сдача: "+Сдача+" "+Объект.ВалютаДокумента;
		
		Если Показать Тогда
			Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаСдача;
		Иначе
			Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокЗаказовПокупателейПриСозданииНаСервере()
	
	Если НЕ ИспользоватьЗаказыВРозничнойТорговле Тогда
		Элементы.ПродажаПоЗаказам.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеОтмененногоЗаказа(
		СписокЗаказов.КомпоновщикНастроек.Настройки.УсловноеОформление
	);
	
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ОтборОплата.СписокВыбора.Добавить("Без оплаты", "Без оплаты");
	Элементы.ОтборОплата.СписокВыбора.Добавить("Оплачен частично", "Оплачен частично");
	Элементы.ОтборОплата.СписокВыбора.Добавить("Оплачен полностью", "Оплачен полностью");
	
	Элементы.ОтборОтгрузка.СписокВыбора.Добавить("Без отгрузки", "Без отгрузки");
	Элементы.ОтборОтгрузка.СписокВыбора.Добавить("Отгружен частично", "Отгружен частично");
	Элементы.ОтборОтгрузка.СписокВыбора.Добавить("Отгружен полностью", "Отгружен полностью");

	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу"));
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(СписокЗаказов,"ВидОперации",СписокЗначений,Истина,ВидСравненияКомпоновкиДанных.ВСписке);
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("АкутальнаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	
	УстановитьОтборТекущиеДела();
	КонтекстноеОткрытие = Параметры.Свойство("ТекущиеДела");
	
	Если Не КонтекстноеОткрытие Тогда
		// УНФ.ОтборыСписка
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокЗаказов);
		// Конец УНФ.ОтборыСписка
	КонецЕсли;
	
	ВосстановитьНастройкиОтборов();
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокЗаказов);
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокЗаказовКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ДанныеПанелиКонтактнойИнформации.ЦветФона = ЦветаСтиля.РабочееМестоКассираЦветДополнительнойПанели;
		Элементы.ДанныеПанелиКонтактнойИнформации.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОтборов()
	
	Если УчетПоКомпанииВЦелом Тогда
		//УНФ.ОтборыСписка
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокЗаказов, "СписокЗаказов");
		//Конец УНФ.ОтборыСписка
		
		Возврат
	КонецЕсли;
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("ЧекККМФормаРМКДопНастройки", "СтруктураНастроек");
	
	ИспользоватьНастройкиПоУмолчанию = Ложь;
	
	Если СтруктураНастроек = Неопределено Тогда
		
		ИспользоватьНастройкиПоУмолчанию = Истина;
		
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("ИспользоватьНастройкиПоУмолчанию", Истина);
		ХранилищеНастроекДанныхФорм.Сохранить("ЧекККМФормаРМКДопНастройки", "СтруктураНастроек", СтруктураНастроек);
		
	ИначеЕсли ТипЗнч(СтруктураНастроек) = Тип("Структура") 
		И СтруктураНастроек.Свойство("ИспользоватьНастройкиПоУмолчанию") Тогда
		ИспользоватьНастройкиПоУмолчанию = СтруктураНастроек.ИспользоватьНастройкиПоУмолчанию;
	КонецЕсли;
	
	Если ИспользоватьНастройкиПоУмолчанию Тогда
		
		СписокПолейИсключений = Новый СписокЗначений;
		СписокПолейИсключений.Добавить("Организация");
		
		//УНФ.ОтборыСписка
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокЗаказов, "СписокЗаказов",,,,,,СписокПолейИсключений);
		//Конец УНФ.ОтборыСписка
		
		УстановитьМеткуИОтборСписка("Организация", "ГруппаОтборОрганизация", КассаККМ.Владелец);
		
	Иначе
		
		//УНФ.ОтборыСписка
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокЗаказов, "СписокЗаказов");
		//Конец УНФ.ОтборыСписка
		
	КонецЕсли;
	
	Элементы.ОтборОрганизацияКонтекстноеМенюОрганизацияИзККМ.Пометка = ИспользоватьНастройкиПоУмолчанию;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОрганизациюПоВладельцуККМ()
	
	Если Не УчетПоКомпанииВЦелом И ИспользоватьНастройкиПоУмолчанию Тогда
		
		ПараметрыОтбора = Новый Структура("ИмяПоляОтбора", "Организация");
		
		НайденныеСтроки = ДанныеМеток.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ДанныеМеток.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КассаККМ) Тогда
			УстановитьМеткуИОтборСписка("Организация", "ГруппаОтборОрганизация", КассаККМ.Владелец);
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользоватьАвторизациюПоОтветственному = ?(ЗначениеЗаполнено(КассаККМ.ИспользоватьАвторизациюПоОтветственному), КассаККМ.ИспользоватьАвторизациюПоОтветственному, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКилент = УправлениеНебольшойФирмойСервер.ЭтоМобильныйКлиент();
	
	УстановитьУсловноеОформлениеФормы();
	
	// Заказы покупателей в Рознице
	ИспользоватьЗаказыВРозничнойТорговле = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле");
	ИспользоватьРезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	// Конец Заказы покупателей в Рознице
	
	УчетПоКомпанииВЦелом = Константы.УчетПоКомпании.Получить();
	
	Элементы.ОтборОрганизацияКонтекстноеМенюОрганизацияИзККМ.Видимость = Не УчетПоКомпанииВЦелом;
	
	// РМК
	
	КассаТерминал = РабочееМестоКассираВызовСервера.ПолучитьКассуККМИТерминалПоУмолчанию();
	Если параметры.ЗначенияЗаполнения.Свойство("КассаККМ") Тогда
		КассаККМ = Параметры.ЗначенияЗаполнения.КассаККМ;
	Иначе
		КассаККМ = КассаТерминал.КассаККМ;
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ПредыдущаяКассаККМ = КассаККМ;
	КассаККМИспользоватьБезПодключенияОборудования = КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЭквайринговыйТерминал") Тогда
		Объект.ЭквайринговыйТерминал = Параметры.ЗначенияЗаполнения.ЭквайринговыйТерминал;
	Иначе
		Объект.ЭквайринговыйТерминал = КассаТерминал.ЭквайринговыйТерминал;
	КонецЕсли;
	
	ИнициализацияФормы();
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		ЭтаФорма.Доступность = Ложь;
	КонецЕсли;
	
	// Восстановим настройки
	ИмяКлючаОбъекта = "РМКНаНачальнойСтранице";
	СтруктураДляОткрытияНаНачальнойСтранице = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ДляНачальнойСтраницы");
	Если СтруктураДляОткрытияНаНачальнойСтранице <> Неопределено Тогда
		КассаККМИзНастроек = СтруктураДляОткрытияНаНачальнойСтранице.КассаККМ;
		ЭквайринговыйТерминалИзНастроек = СтруктураДляОткрытияНаНачальнойСтранице.ЭквайринговыйТерминал;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект, Истина);
	КонецЕсли;
	
	ИспользоватьПредоплату = ПолучитьФункциональнуюОпцию("ИспользоватьПредоплатуВЧекахККМ");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																"СписокКонтекстноеМенюЗаполнитьПоЧеку",
																"Видимость",
																 ИспользоватьПредоплату);
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокЗаказовКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	УстановитьВидимостьДоговора(Элементы, Объект.Контрагент);
	
	НастроитьЭлементыДляМобильногоКлиента();
	
	// МОТП
	КонтролироватьСтатусыКодовМаркировкиВРозницеМОТП = ПолучитьФункциональнуюОпцию("ВестиУчетТабачнойПродукцииМОТП")
		И ПолучитьФункциональнуюОпцию("КонтролироватьСтатусыКодовМаркировкиВРозницеМОТП");
	// Конец МОТП
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользоватьАвторизациюПоОтветственному = ?(ЗначениеЗаполнено(КассаККМ.ИспользоватьАвторизациюПоОтветственному), КассаККМ.ИспользоватьАвторизациюПоОтветственному, Ложь);
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПолучитьСписокВыбораВидовПлатежныхКарт();
	
	// Наборы
	ОбновитьДанныеКартинокНаборов(Объект.Запасы, Объект.ДобавленныеНаборы); 
	ОбновитьПризнакиНабора(Объект.Запасы);
	// Конец Наборы
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИспользоватьАвторизациюПоОтветственному Тогда
		АвторизацияПоОтветственному();
	КонецЕсли;
	
	Окна = ПолучитьОкна();
	
	Для Каждого мОкно из Окна Цикл
		Если мОкно.НачальнаяСтраница Тогда
			Если мОкно.Содержимое[0].ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента_РМК" Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода,ДисплейПокупателя");
	// Конец ПодключаемоеОборудование
	
	ЗаполнитьСуммыСкидок();
	
	ПересчитатьДокументНаКлиенте();
	
	Если КассаККМ.Пустая() Тогда
		ЗначенияЗаполнения = РабочееМестоКассираВызовСервера.ПолучитьКассуККМИТерминалПоУмолчанию();
		
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
		
		Если РабочееМестоКассираКлиент.ТребуетсяОткрытьОкноВыбораКассы(ЗначенияЗаполнения) Тогда
			
			РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
			Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось определить рабочее место для работы с подключаемым оборудованием!";
				Сообщение.Сообщить();
			КонецЕсли;
			
			ВВидеСтруктуры = Истина;
			НастройкаРМКСтруктура = РабочееМестоКассираВызовСервера.ПолучитьНастройкуРМК(РабочееМесто, ВВидеСтруктуры);
			Если Объект.КассаККМ.Пустая() Тогда
				Если Не ЗначениеЗаполнено(НастройкаРМКСтруктура.Ссылка) Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не удалось получить настройки РМК для текущего рабочего места!";
					Сообщение.Сообщить();
				Иначе
					НеПоказыватьПриОткрытииФормуВыбораКассы = НастройкаРМКСтруктура.НеПоказыватьПриОткрытииФормуВыбораКассы;
					СверятьИтогиНаЭТПриЗакрытииСмены = НастройкаРМКСтруктура.СверятьИтогиНаЭТПриЗакрытииСмены;
				КонецЕсли;
			Иначе
				Если ЗначенияЗаполнения.КоличествоЭквайринговыхТерминалов < 2 Тогда
					НеПоказыватьПриОткрытииФормуВыбораКассы = Истина;
					СверятьИтогиНаЭТПриЗакрытииСмены = Ложь;
				Иначе
					НеПоказыватьПриОткрытииФормуВыбораКассы = НастройкаРМКСтруктура.НеПоказыватьПриОткрытииФормуВыбораКассы;
					СверятьИтогиНаЭТПриЗакрытииСмены = НастройкаРМКСтруктура.СверятьИтогиНаЭТПриЗакрытииСмены;
				КонецЕсли;
			КонецЕсли;
			
			Если НеПоказыватьПриОткрытииФормуВыбораКассы И НЕ КассаККМИзНастроек.Пустая() Тогда
				КассаККМВыбрана(
					Новый Структура("КассаККМ, ЭквайринговыйТерминал", КассаККМИзНастроек, ЭквайринговыйТерминалИзНастроек),
					Неопределено
				);
			ИначеЕсли НеПоказыватьПриОткрытииФормуВыбораКассы Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось определить кассу ККМ для открытия РМК. Удалите РМК с начальной страницы и отройте РМК из раздела ""Продажи""!";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			Иначе
				//
				ОткрытьФорму(
					"Документ.ЧекККМ.Форма.ФормаДокумента_РМК_ОкноВыбораКассы",
					Новый Структура("ОткрытаДляПодбора", Истина),
					,
					,
					,
					,
					Новый ОписаниеОповещения("КассаККМВыбрана", ЭтотОбъект),
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс
				);
			КонецЕсли;
		Иначе
			КассаККМВыбрана(ЗначенияЗаполнения, Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьОтображениеКолонокВРазрезеЗапасов();
	УстановитьГорячиеКлавишиПоискаПоШК();
	
	Если ИспользоватьАвторизациюПоОтветственному Тогда
		ПодключитьОбработчикОжидания("ОповеститьОбОткрытииФормы", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОповеститьОбОткрытииФормы()
	Оповестить("РМКОткрыт");
КонецПроцедуры

// Процедура - обработчик события ПередЗаписьюНаСервере формы.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Дата = УправлениеНебольшойФирмойВызовСервера.ДатаСеанса();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Неоперативный;
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПредоплатуВЧекахККМ") Тогда
			ТекстСообщения = "";
			Справочники.ДоговорыКонтрагентов.ПроверитьСоответствиеДоговораУсловиямДокумента(
				ТекстСообщения,
				Объект.Договор,
				Объект.Ссылка,
				Объект.Организация,
				Объект.Контрагент,
				Отказ);
		
			Если ТекстСообщения <> "" Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ?(Отказ, НСтр("ru = 'Документ не проведен! '") + ТекстСообщения, ТекстСообщения);
				
				Если Отказ Тогда
					Сообщение.ПутьКДанным = "Объект";
					Сообщение.Поле = "Договор";
					Сообщение.Сообщить();
					Возврат;
				Иначе
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура вызывается после закрытия формы вопроса. Форма вопроса вызывается из процедуры ПередЗакрытием.
//
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт

	//

КонецПроцедуры // ПередЗакрытиемЗавершение()

// Процедура - обработчик события ПриЗакрытии формы.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// АвтоматическиеСкидки
	// Выведем сообщение о рассчёте скидок, если нажата кнопка "Провести и закрыть" или форма закрывается по крестику, с сохранением изменений.
	Если ИспользоватьАвтоматическиеСкидки И СкидкиРассчитаныПередЗаписью Тогда
		ПоказатьОповещениеПользователя("Изменение:", 
										ПолучитьНавигационнуюСсылку(Объект.Ссылка), 
										Строка(Объект.Ссылка)+". Автоматические скидки (наценки) рассчитаны!", 
										БиблиотекаКартинок.Информация32);
	КонецЕсли;
	// Конец АвтоматическиеСкидки

	// РМК
	РабочееМестоКассираВызовСервера.ОбновитьНастройкиРМК(НастройкаРМК, НеПоказыватьПриОткрытииФормуВыбораКассы, СверятьИтогиНаЭТПриЗакрытииСмены);
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	//УНФ.ОтборыСписка
	СохранитьНастройкиОтборов();
	//Конец УНФ.ОтборыСписка
		
КонецПроцедуры // ПриЗакрытии()

// Процедура - обработчик события ПередЗаписью формы.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// АвтоматическиеСкидки
	СкидкиРассчитаныПередЗаписью = Ложь;
	// Если документ проводится, проверим рассчитанность скидок.
	Если ИспользоватьАвтоматическиеСкидки Тогда
		Если Не Объект.СкидкиРассчитаны И СкидкиИзменились() Тогда
			РассчитатьСкидкиНаценкиКлиент();
			РассчиталиСкидки = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Рассчитаны автоматические скидки (наценки)!";
			Сообщение.КлючДанных = Объект.Ссылка;
			Сообщение.Сообщить();
			
			СкидкиРассчитаныПередЗаписью = Истина;
		Иначе
			Объект.СкидкиРассчитаны = Истина;
			ОбновитьКартинкуАвтоСкидкиПослеЗаписи = Истина;
		КонецЕсли;
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// АвтоматическиеСкидки
	Если СкидкиРассчитаныПередЗаписью Тогда
		ПересчитатьДокументНаКлиенте();
	КонецЕсли;
	
	Оповестить("ОбновитьФормуСпискаДокументовЧекККМ");
	
	// Наборы
	ОбновитьДанныеКартинокНаборов(Объект.Запасы, Объект.ДобавленныеНаборы); 
	// Конец Наборы
	
КонецПроцедуры // ПослеЗаписи()

// Процедура - обработчик события ПослеЗаписиНаСервере формы.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// АвтоматическиеСкидки
	Если ОбновитьКартинкуАвтоСкидкиПослеЗаписи Тогда
		Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
		ОбновитьКартинкуАвтоСкидкиПослеЗаписи = Ложь;
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
	// Наборы
	ОбновитьПризнакиНабора(Объект.Запасы);
	// Конец Наборы
	
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаОповещения формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	РаботаСФормойКлиент.СписокЗаказовОбработкаОповещенияФрагмент(ЭтотОбъект, ИмяСобытия, "СписокЗаказов");
	
	Если Не БылаАвторизация Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование"
			И ВводДоступен() И Не СчитанаДисконтнаяКарта Тогда
			Если ИмяСобытия = "ScanData" Тогда
				//Преобразуем предварительно к ожидаемому формату
				Данные = Новый Массив();
				Если Параметр[1] = Неопределено Тогда
					Штрихкод = Параметр[0];
				Иначе
					Штрихкод = Параметр[1][1]; // Достаем штрихкод из дополнительных данных
				КонецЕсли;
				
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Штрихкод, 1));
				
				ПолученыШтрихкоды(Данные);
				
			КонецЕсли;
		КонецЕсли;
		// Конец ПодключаемоеОборудование
		
	Иначе
		БылаАвторизация = Ложь;
	КонецЕсли;
	
	// ДисконтныеКарты
	Если СчитанаДисконтнаяКарта Тогда
		СчитанаДисконтнаяКарта = Ложь;
	КонецЕсли;
	// Конец ДисконтныеКарты
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор Тогда
		
		АдресЗапасовВХранилище = Параметр;
		
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, "Запасы", Истина, Истина);
		
		ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
		
		ПересчитатьДокументНаКлиенте();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьФормуСпискаДокументовЧекККМ" Тогда
		Элементы.Список.Обновить();
		
		Если НЕ (ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("НеОбновлятьОстатокВКассе") И Параметр.НеОбновлятьОстатокВКассе) Тогда
			ОстатокВКассеСтрока = "" + ПолучитьОстатокДенежныхСредствВКассеККМНаСервере(КассаККМ);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ДобавленаНоменклатураИзРМК" И ЗначениеЗаполнено(Параметр) Тогда
		ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
				ТекущиеДанные.Номенклатура = Параметр;
				НоменклатураПриИзменении(ТекущиеДанные);
				ПересчитатьДокументНаКлиенте();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ИзмененаНастройкаРМК" Тогда
		Если НастройкаРМК = Параметр Тогда
			ЗаполнитьБыстрыеТовары();
			НастроитьКнопкиИКомандыМеню();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "РМК_Запись_ПриходнаяНакладнаяВозврат" Тогда
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.ЦветТекста = ?(ЧекНеПредъявлен, WebЦвета.Серый, Новый Цвет);
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.ЦветТекста = Новый Цвет;
		ПриходнаяНакладнаяНаВозврат = Параметр.Ссылка;
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Параметр.Номер, Истина, Истина);
		Элементы.ДекорацияПриходнаяНакладная.Заголовок = "Прих. нак-я №"+НомерДокумента+" от "+Формат(Параметр.Дата, "ДФ=dd.MM.yyyy");
		Элементы.ДекорацияПриходнаяНакладная.Видимость = Истина;
	ИначеЕсли ИмяСобытия = "РМК_Запись_РКО" Тогда
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.ЦветТекста = ?(ЧекНеПредъявлен, WebЦвета.Серый, Новый Цвет);
		РКО = Параметр.Ссылка;
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Параметр.Номер, Истина, Истина);
		Элементы.ДекорацияРКО.Заголовок = "РКО №"+СокрЛП(НомерДокумента)+" от "+Формат(Параметр.Дата, "ДФ=dd.MM.yyyy");
		Элементы.ДекорацияРКО.Видимость = Истина;
	ИначеЕсли ИмяСобытия = "РМК_Запись_ЧекККМВозврат" Тогда
		ЧекККМНаВозврат = Параметр.Ссылка;
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Параметр.Номер, Истина, Истина);
		Элементы.ДекорацияЧекККМНаВозврат.Заголовок = "Чек ККМ на возврат №"+НомерДокумента+" от "+Формат(Параметр.Дата, "ДФ=dd.MM.yyyy");
		Элементы.СоздатьЧекККМНаВозврат.ЦветТекста = WebЦвета.Серый;
	ИначеЕсли ИмяСобытия = "Запись_ЧекККМ_с_ЗаказомПокупателя" Тогда
		Элементы.СписокЗаказов.Обновить();
		ЧекККМ = Параметр.Ссылка;
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Параметр.Номер, Истина, Истина);
		Элементы.ДекорацияЧекККМ.Заголовок = "Чек ККМ на возврат №"+НомерДокумента+" от "+Формат(Параметр.Дата, "ДФ=dd.MM.yyyy");
		Элементы.СоздатьЧекККМНаОснованииЗаказа.ЦветТекста = WebЦвета.Серый;
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		ИзменилосьКоличество = ПолучитьСерийныеНомераИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Если ИзменилосьКоличество Тогда
			РассчитатьСуммуВСтрокеТабличнойЧасти();
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьФормыПослеСнятияZОтчета" Тогда
		ОбновитьВидимостьНадписиИстеклоБолее24Часов();
		СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	КонецЕсли;
	
	// УНФ.ПанельКонтактнойИнформации
	Если ИспользоватьЗаказыВРозничнойТорговле И КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
	
	// Наборы
	Если НаборыКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Источник) Тогда
		ОбновитьСоставНабора(Параметр.НоменклатураНабора, Параметр.ХарактеристикаНабора, Параметр.Количество, Параметр.СоставНабора);
		ПересчитатьДокументНаКлиенте();
	КонецЕсли; 
	// Конец Наборы
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ОбновитьВидимостьНадписиИстеклоБолее24Часов(СтруктураСостояниеКассовойСмены = Неопределено)

	Дата = ТекущаяДатаСеанса();
	
	Если СтруктураСостояниеКассовойСмены = Неопределено Тогда
		СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	КонецЕсли;
	
	УстановитьВидимостьНадписи = Ложь;
	Если СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		ТекстСообщения = НСтр("ru='Кассовая смена открыта'");
		Если НЕ РозничныеПродажиСервер.СменаОткрыта(Объект.КассоваяСмена, Дата, ТекстСообщения) Тогда
			Если СтрНайти(ТекстСообщения, "24") > 0 Тогда
				Элементы.НадписьСМоментаОткрытияСменыПрошлоБолее24Часов.Заголовок = ТекстСообщения;
				УстановитьВидимостьНадписи = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Элементы.НадписьСМоментаОткрытияСменыПрошлоБолее24Часов.Видимость = УстановитьВидимостьНадписи;
	Элементы.ЗакрытьСменуМК.Видимость = УстановитьВидимостьНадписи;
	
КонецПроцедуры

// Процедура - обработчик события ПередЗагрузкойДанныхИзНастроекНаСервере.
//
&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЭтоМобильныйКилент Тогда
		Возврат;
	КонецЕсли;
	
	СписокДляСохранения = Настройки.Получить("СписокДляСохраненияНастроек");
	Если ТипЗнч(СписокДляСохранения) = Тип("СписокЗначений") Тогда
		// Восстановление периодов.
		ВидПериода = СписокДляСохранения.Получить(0).Значение;
		Если ВидПериода = ЗаПроизвольныйПериод Тогда
			ДатаНачала = СписокДляСохранения.Получить(1).Значение;
			ДатаОкончания = СписокДляСохранения.Получить(2).Значение;
			Если ВидПериода <> ВидПериодаЖурналаПеречисление ИЛИ Элементы.Список.Период.ДатаНачала <> ДатаНачала ИЛИ Элементы.Список.Период.ДатаОкончания <> ДатаОкончания Тогда
				УстановитьПериодНаСервере(ВидПериода, "Список", Новый СтандартныйПериод(ДатаНачала, ДатаОкончания));
			КонецЕсли;
		ИначеЕсли ВидПериода <> ВидПериодаЖурналаПеречисление Тогда
			УстановитьПериодНаСервере(ВидПериода, "Список");
		КонецЕсли;
		
		ВидПериода = СписокДляСохранения.Получить(3).Значение;
		Если ВидПериода = ЗаПроизвольныйПериод Тогда
			ДатаНачала = СписокДляСохранения.Получить(4).Значение;
			ДатаОкончания = СписокДляСохранения.Получить(5).Значение;
			Если ВидПериода <> ВидПериодаЧековККМПеречисление ИЛИ Элементы.СписокЧековККМ.Период.ДатаНачала <> ДатаНачала ИЛИ Элементы.СписокЧековККМ.Период.ДатаОкончания <> ДатаОкончания Тогда
				УстановитьПериодНаСервере(ВидПериода, "СписокЧековККМ", Новый СтандартныйПериод(ДатаНачала, ДатаОкончания));
			КонецЕсли;
		ИначеЕсли ВидПериода <> ВидПериодаЧековККМПеречисление Тогда
			УстановитьПериодНаСервере(ВидПериода, "СписокЧековККМ");
		КонецЕсли;
		
		ВидПериода = СписокДляСохранения.Получить(6).Значение;
		Если ВидПериода = ЗаПроизвольныйПериод Тогда
			ДатаНачала = СписокДляСохранения.Получить(7).Значение;
			ДатаОкончания = СписокДляСохранения.Получить(8).Значение;
			Если ВидПериода <> ВидПериодаЧековККМНаВозвратПеречисление ИЛИ Элементы.СписокЧековККМНаВозврат.Период.ДатаНачала <> ДатаНачала ИЛИ Элементы.СписокЧековККМНаВозврат.Период.ДатаОкончания <> ДатаОкончания Тогда
				УстановитьПериодНаСервере(ВидПериода, "СписокЧековККМНаВозврат", Новый СтандартныйПериод(ДатаНачала, ДатаОкончания));
			КонецЕсли;
		ИначеЕсли ВидПериода <> ВидПериодаЧековККМНаВозвратПеречисление Тогда
			УстановитьПериодНаСервере(ВидПериода, "СписокЧековККМНаВозврат");
		КонецЕсли;
		
		Если СписокДляСохранения.Количество() > 10 Тогда
			ДатаНачала = СписокДляСохранения.Получить(10).Значение;
			ДатаОкончания = СписокДляСохранения.Получить(11).Значение;
			Если Элементы.СписокЗаказов.Период.ДатаНачала <> ДатаНачала ИЛИ Элементы.СписокЗаказов.Период.ДатаОкончания <> ДатаОкончания Тогда
				УстановитьПериодНаСервере(ЗаПроизвольныйПериод, "СписокЗаказов", Новый СтандартныйПериод(ДатаНачала, ДатаОкончания));
			КонецЕсли;
		КонецЕсли;
		
		// Восстановление текущей страницы.
		Если ЭтоМобильныйКилент Тогда
			Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы.ГруппаПродажаМК;
		Иначе
			ИмяТекущейСтраницы = СписокДляСохранения.Получить(9).Значение;
			Если ЗначениеЗаполнено(ИмяТекущейСтраницы) Тогда
				Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы[ИмяТекущейСтраницы];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриСохраненииДанныхВНастройкахНаСервере.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Если ЭтоМобильныйКилент Тогда
		Возврат;
	КонецЕсли;
	
	СписокДляСохраненияНастроек = Новый СписокЗначений;
	// Настройки периодов. Элементы 0 - 8.
	СписокДляСохраненияНастроек.Добавить(ВидПериодаЖурналаПеречисление);
	СписокДляСохраненияНастроек.Добавить(Элементы.Список.Период.ДатаНачала);
	СписокДляСохраненияНастроек.Добавить(Элементы.Список.Период.ДатаОкончания);
	СписокДляСохраненияНастроек.Добавить(ВидПериодаЧековККМПеречисление);
	СписокДляСохраненияНастроек.Добавить(Элементы.СписокЧековККМ.Период.ДатаНачала);
	СписокДляСохраненияНастроек.Добавить(Элементы.СписокЧековККМ.Период.ДатаОкончания);
	СписокДляСохраненияНастроек.Добавить(ВидПериодаЧековККМНаВозвратПеречисление);
	СписокДляСохраненияНастроек.Добавить(Элементы.СписокЧековККМНаВозврат.Период.ДатаНачала);
	СписокДляСохраненияНастроек.Добавить(Элементы.СписокЧековККМНаВозврат.Период.ДатаОкончания);
	// Текущая страница. Элемент 9.
	Если Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница <> Неопределено Тогда
		СписокДляСохраненияНастроек.Добавить(Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница.Имя);
	Иначе
		СписокДляСохраненияНастроек.Добавить("ГруппаПродажа");
	КонецЕсли;
	
	СписокДляСохраненияНастроек.Добавить(Элементы.СписокЗаказов.Период.ДатаНачала);
	СписокДляСохраненияНастроек.Добавить(Элементы.СписокЗаказов.Период.ДатаОкончания);
	
	Настройки.Вставить("СписокДляСохраненияНастроек", СписокДляСохраненияНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы(пПриСозданииНаСервере = Истина)
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	ЗаполнитьЗначенияСвойств(Объект, СтруктураСостояниеКассовойСмены);
	Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
	ОстатокВКассе = СтруктураСостояниеКассовойСмены.НаличностьВКассе;
	ОстатокВКассеСтрока = "" + ОстатокВКассе;
	
	Объект.КассаККМ = КассаККМ;
	Объект.СтруктурнаяЕдиница = КассаККМ.СтруктурнаяЕдиница;
	Если КассаККМ.СтруктурнаяЕдиница.РозничныйВидЦен.Пустая() Тогда
		Объект.ВидЦен = Справочники.ВидыЦен.Оптовая; // Значение заполнения реквизита ВидЦен в документе ОтчетОРозничныхПродажах.
	Иначе
		Объект.ВидЦен = КассаККМ.СтруктурнаяЕдиница.РозничныйВидЦен;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Объект.ВалютаДокумента = КассаККМ.ВалютаДенежныхСредств;
	КонецЕсли;
	// При оформлении первого чека по выбранной кассе.
	Если НЕ ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.КассоваяСмена) Тогда
		Если НЕ Объект.ВидЦен.Пустая() Тогда
			Объект.СуммаВключаетНДС = УправлениеНебольшойФирмойСервер.ЗначениеРеквизитаОбъекта(Объект.ВидЦен, "ЦенаВключаетНДС");
		КонецЕсли;
	КонецЕсли;
	
	Объект.Организация = Объект.КассаККМ.Владелец;
	Объект.Подразделение = Объект.КассаККМ.Подразделение;
	Объект.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
	
	ЕстьПравоОформлятьРКО = ПравоДоступа("Добавление", Метаданные.Документы.РасходИзКассы);
	// Конец РМК
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	// Временно.
	Объект.НДСВключатьВСтоимость = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПолучитьСписокВыбораВидовПлатежныхКарт();
	КонецЕсли;
	
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	
	КонтрольНаСкладеОтключен = НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить()
						   ИЛИ НЕ Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Получить();
	
	Элементы.СнятьРезервирование.Видимость = НЕ КонтрольНаСкладеОтключен;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДокумента));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.НациональнаяВалюта.Получить()));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И (НЕ Параметры.Свойство("ЗначениеКопирования")
			ИЛИ НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования)) Тогда
		
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	ИначеЕсли Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда	
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
	Иначе
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница)
		И НЕ ЗначениеЗаполнено(Объект.СпециальныйНалоговыйРежим) Тогда
		Объект.СпециальныйНалоговыйРежим = УправлениеНебольшойФирмойСервер.СпециальныйНалоговыйРежим(Объект.Организация, Объект.СтруктурнаяЕдиница, Объект.Дата);
		
		Если Объект.СпециальныйНалоговыйРежим = Перечисления.СпециальныеНалоговыеРежимы.ПСН Тогда
			Если Не ЗначениеЗаполнено(Объект.Патент) Тогда
				Объект.Патент = Справочники.Патенты.ПолучитьПатентПоУмолчанию(Объект.Организация, Объект.Дата);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаСервере());
	
	КассаККМИспользоватьБезПодключенияОборудования = Объект.КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	ИспользуетсяРегистрацияРозничныхПродажВЕГАИС = ИнтеграцияЕГАИСУНФВызовСервера.ИспользуетсяРегистрацияРозничныхПродажВЕГАИС();
	ИспользуетсяМаркировкаТабачнойПродукции = ПолучитьФункциональнуюОпцию("ВестиУчетТабачнойПродукцииМОТП");
	
	УстановитьДоступностьПечатиЧека();
	
	Элементы.ЗапасыСуммаСкидкиНаценки.Видимость = Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить();
	
	Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит
	И НЕ КассаККМИспользоватьБезПодключенияОборудования Тогда
		УстановитьРежимТолькоПросмотр();
	КонецЕсли;
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	ПродажаСоСклада = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад;
	
	Элементы.ЗапасыЦена.ТолькоПросмотр 					= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСумма.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыПроцентСкидкиНаценки.ТолькоПросмотр  = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаСкидкиНаценки.ТолькоПросмотр 	= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаНДС.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов;
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	// ПодборНоменклатурыВДокументах
	ПодборНоменклатурыВДокументах.НазначитьФормуПодбора(ПараметрыОткрытияПодбора, Объект.Ссылка.Метаданные().Имя, "Запасы");
	// Конец ПодборНоменклатурыВДокументах
	
	// АвтоматическиеСкидки.
	АвтоматическиеСкидкиПриСозданииНаСервере();
	
	// РМК
	СменаОткрыта = Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта;
	
	Список.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	Список.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	Список.Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	СформироватьЗаголовок(СтруктураСостояниеКассовойСмены);
	
	// Быстрые товары и настройки кнопок и команд меню.
	ЗаполнитьБыстрыеТовары(пПриСозданииНаСервере);
	НастроитьКнопкиИКомандыМеню();
	
	ЦветВажныхКнопок = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
	
	// Виды периодов.
	ЗаТекущуюСмену = Перечисления.ВидыПериодовРМК.ЗаТекущуюСмену;
	ЗаПроизвольныйПериод = Перечисления.ВидыПериодовРМК.ЗаПроизвольныйПериод;
	ЗаВчерашнийДень = Перечисления.ВидыПериодовРМК.ЗаВчерашнийДень;
	ЗаВесьПериод = Перечисления.ВидыПериодовРМК.ЗаВесьПериод;
	ЗаПрошлуюСмену = Перечисления.ВидыПериодовРМК.ЗаПрошлуюСмену;
	
	ЗаполнитьСпискиВидыПериодов();
	
	УстановитьПериодНаСервере(ЗаТекущуюСмену, "СписокЧековККМ");
	УстановитьПериодНаСервере(ЗаТекущуюСмену, "СписокЧековККМНаВозврат");
	УстановитьПериодНаСервере(ЗаТекущуюСмену, "Список");
	УстановитьПериодНаСервере(ЗаПроизвольныйПериод, "СписокЗаказов", Новый СтандартныйПериод);
	
	ПереключательЖурналБыстрыеТовары = 1;
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(Список);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокЧековККМНаВозврат);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокЗаказов);
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	ОбновитьВидимостьНадписиИстеклоБолее24Часов(СтруктураСостояниеКассовойСмены);
	
	ТипНоменклатурыЗапас = Перечисления.ТипыНоменклатуры.Запас;
	ТипНоменклатурыУслуга = Перечисления.ТипыНоменклатуры.Услуга;
	
	ТипыДенежныхСредствБезналичные = Перечисления.ТипыДенежныхСредств.Безналичные;
	ТипыДенежныхСредствНаличные = Перечисления.ТипыДенежныхСредств.Наличные;
	// Конец РМК
	
	// Заказы покупателей в Рознице
	НастроитьСписокЗаказовПокупателейПриСозданииНаСервере();
	// Конец Заказы покупателей в Рознице
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	
	// Наборы
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьДанныеКартинокНаборов(Объект.Запасы, Объект.ДобавленныеНаборы);
		ОбновитьПризнакиНабора(Объект.Запасы);
	КонецЕсли;
	// Конец Наборы
	
	УправлениеФормой(ЭтотОбъект);
	
	УправлениеВидимостьюЗакладок();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЗакладок()
	
	Если ЭтоМобильныйКилент Тогда
		Элементы.ГруппаПродажаИВозврат.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Элементы.ГруппаПродажа.Видимость = Ложь;
		Элементы.ГруппаВозврат.Видимость = Ложь;
		Элементы.ПродажаПоЗаказам.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМВыбрана(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	КассаККМ = Результат.КассаККМ;
	Объект.ЭквайринговыйТерминал = Результат.ЭквайринговыйТерминал;
	
	ЭтаФорма.Доступность = Истина;
	ИнициализацияФормы(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АкцизныеМарки(Команда)
	
	ДобавленныеВидыПродукции = ВидыПродукцииВЗапасахСервер();
	ТабачнаяПродукция    = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табачная");
	
	Если ДобавленныеВидыПродукции.Количество() > 0 Тогда
		
		Если ДобавленныеВидыПродукции.НайтиПоЗначению(ТабачнаяПродукция)  <> Неопределено Тогда
			ОткрытьФормуСканированияТабачнойПродукции();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события Действие команды Подбор
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти = "Запасы";
	
	Если НЕ ПустаяСтрока(ПараметрыОткрытияПодбора[ИмяТабличнойЧасти]) Тогда
		
		ПодборНоменклатурыВДокументахКлиент.ОткрытьПодбор(ЭтаФорма, ИмяТабличнойЧасти, ПараметрыОткрытияПодбора[ИмяТабличнойЧасти]);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Компания);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",		Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ВидСкидкиНаценки",		Объект.ВидСкидкиНаценки);
	ПараметрыПодбора.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	ПараметрыПодбора.Вставить("ВидЦен",					Объект.ВидЦен);
	ПараметрыПодбора.Вставить("Валюта",					Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("НалогообложениеНДС",		Объект.НалогообложениеНДС);
	ПараметрыПодбора.Вставить("СуммаВключаетНДС",		Объект.СуммаВключаетНДС);
	ПараметрыПодбора.Вставить("ОрганизацияДокумента",	Объект.Организация);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",	Истина);
	ПараметрыПодбора.Вставить("ДоступноИзменениеЦены",	НЕ Элементы.ЗапасыЦена.ТолькоПросмотр);
	
	Если ТипСтруктурнойЕдиницы = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад") Тогда
		
		ПараметрыПодбора.Вставить("ИспользуетсяРезервирование", Истина);
		
	Иначе
		
		ПараметрыПодбора.Вставить("ЗапросПоСкладу", Истина);
		
	КонецЕсли;
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры // ПодборВыполнить()

// Процедура - обработчик команды ПоказатьЖурнал формы. Обходной путь для реализации быстрых клавиш для переключателя.
//
&НаКлиенте
Процедура ПоказатьЖурнал(Команда)
	
	ПереключательЖурналБыстрыеТовары = 1;
	ПереключательЖурналБыстрыеТоварыПриИзменении(Элементы.ПереключательЖурналБыстрыеТовары);
	
КонецПроцедуры

// Процедура - обработчик команды ПоказатьБыстрыеТовары формы. Обходной путь для реализации быстрых клавиш для переключателя.
//
&НаКлиенте
Процедура ПоказатьБыстрыеТовары(Команда)
	
	ПереключательЖурналБыстрыеТовары = 2;
	ПереключательЖурналБыстрыеТоварыПриИзменении(Элементы.ПереключательЖурналБыстрыеТовары);
	
КонецПроцедуры

// Процедура - обработчик команды ПоказатьМоюКассу формы. Обходной путь для реализации быстрых клавиш для переключателя.
//
&НаКлиенте
Процедура ПоказатьМоюКассу(Команда)
	
	ПереключательЖурналБыстрыеТовары = 3;
	ПереключательЖурналБыстрыеТоварыПриИзменении(Элементы.ПереключательЖурналБыстрыеТовары);
	
КонецПроцедуры

// Процедура - обработчик команды НастройкаБыстрыхТоваров формы
//
&НаКлиенте
Процедура НастройкаБыстрыхТоваров(Команда)
	
	НастройкаБыстрыхТоваровОбработкаКоманды("НастройкаБыстрыхТоваров_2");
	
КонецПроцедуры

// Процедура - обработчик команды НастройкаБыстрыхТоваров формы
//
&НаКлиенте
Процедура НастройкаБыстрыхТоваровЖурнал(Команда)
	
	НастройкаБыстрыхТоваровОбработкаКоманды("НастройкаБыстрыхТоваров");
	
КонецПроцедуры

// Процедура - обработчик команды СоздатьПриходнуюНакладнуюНаВозврат формы
//
&НаКлиенте
Процедура СоздатьПриходнуюНакладнуюНаВозврат(Команда)
	
	Если ЧекНеПредъявлен Тогда
		// СтандартныеПодсистемы.ОценкаПроизводительности
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыПриходнаяНакладнаяВозврат");
		// СтандартныеПодсистемы.ОценкаПроизводительности
		ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", Новый Структура("РМК, ВидОперацииВозврат", Истина, Истина), ЭтотОбъект, УникальныйИдентификатор);
	Иначе
		ТекущиеДанные = Элементы.СписокЧековККМ.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыПриходнаяНакладнаяВозврат");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", Новый Структура("Основание, РМК", ТекущиеДанные.Ссылка, Истина), ЭтотОбъект, УникальныйИдентификатор);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не выбран чек ККМ!";
			Сообщение.Поле = "СписокЧековККМ";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды СоздатьЧекККМНаВозврат формы
//
&НаКлиенте
Процедура СоздатьЧекККМНаВозврат(Команда)
	
	Если НЕ ЧекККМНаВозврат.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чек на возврат уже создан.";
		Сообщение.Поле = "Элементы.СоздатьЧекККМНаВозврат";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	Иначе
		ПроверитьСостояниеКассовойСмены();
		ТекущиеДанные = Элементы.СписокЧековККМ.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ОткрытьФорму("Документ.ЧекККМВозврат.ФормаОбъекта", Новый Структура("Основание", ТекущиеДанные.Ссылка), ЭтотОбъект);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не выбран чек ККМ!";
			Сообщение.Поле = "СписокЧековККМ";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды СоздатьЧекККМНаВозврат формы
//
&НаКлиенте
Процедура СоздатьЧекККМНаОснованииЗаказа(Команда)
	
	ПроверитьСостояниеКассовойСмены();
	
	Если НЕ ЧекККМ.Пустая() И ЕстьПередачаТоваров Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Ранее по заказу уже оформлялись чеки: '") + Элементы.ДекорацияЧекККМ.Заголовок;
		Сообщение.Поле = "Элементы.СоздатьЧекККМНаОснованииЗаказа";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ОрганизацияЗаказаПодходит(ТекущиеДанные.Ссылка) Тогда
			ПараметрыНовогоЧекаККМ = Новый Структура("Основание, КассаККМ, РМК", ТекущиеДанные.Ссылка, КассаККМ, Истина);
			ЗаполнитьТекущийЧекПоЗаказу(ПараметрыНовогоЧекаККМ);
			Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы.ГруппаПродажа;
			Элементы.СтраницыЖурналИБыстрыеТовары.ТекущаяСтраница = Элементы.ОсновныеРеквизиты;
			ПереключательЖурналБыстрыеТовары = 3;
			УстановитьВидимостьДоговора(Элементы, Объект.Контрагент);
			ПересчитатьДокументНаКлиенте();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Организация заказа не соответствует организации РМК. Измените организацию в РМК, чтобы создать чек по выбранному заказу
			|или включите учет по компании в целом.'");
			Сообщение.Поле = "Элементы.СоздатьЧекККМНаОснованииЗаказа";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбран заказ!'");
		Сообщение.Поле = "СписокЗаказов";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды СоздатьРКОНаОснованииПриходнойНакладной формы
//
&НаКлиенте
Процедура СоздатьРКОНаОснованииПриходнойНакладной(Команда)
	
	Если ПриходнаяНакладнаяНаВозврат.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В первую очередь нужно создать приходную накладную на возврат.";
		Сообщение.Поле = "СоздатьПриходнуюНакладнуюНаВозврат";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	Иначе
		ТекущиеДанные = Элементы.СписокЧековККМ.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено ИЛИ ЧекНеПредъявлен Тогда
			ОткрытьФорму("Документ.РасходИзКассы.ФормаОбъекта", Новый Структура("Основание, РМК", ПриходнаяНакладнаяНаВозврат, Истина), ЭтотОбъект, УникальныйИдентификатор);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не выбран чек ККМ!";
			Сообщение.Поле = "СписокЧековККМ";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаВозврата(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОтвета.Значение = "ПН" Тогда
		
		СоздатьПриходнуюНакладнуюНаВозврат(Неопределено);
		
	ИначеЕсли РезультатОтвета.Значение = "Чек" Тогда
		
		СоздатьЧекККМНаВозврат(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеКассовойСмены(ПоказыватьПредупреждение = Ложь)
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	Если НЕ СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		ОткрытьКассовуюСмену();
	ИначеЕсли ПоказыватьПредупреждение Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Кассовая смена уже открыта'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	
	ПроверитьСостояниеКассовойСмены(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОплату(Команда)
	
	Если Команда.Имя = "ПринятьПредоплату" Тогда
		
		Объект.ОперацияСДенежнымиСредствами = Истина;
		Оплатить("");
		
	Иначе
		
		Объект.ОперацияСДенежнымиСредствами = Ложь;
		Оплатить("");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОплатуНаличными(Команда)
	Оплатить(ТипыДенежныхСредствНаличные);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОплатуКартой(Команда)
	Оплатить(ТипыДенежныхСредствБезналичные);
КонецПроцедуры

// Процедура - обработчик команды ПринятьОплату формы.
//
&НаКлиенте
Процедура Оплатить(ТипыДенежныхСредств)
	
	ПроверитьСостояниеКассовойСмены();
	
	// Бонусы
	Если Не Объект.ОперацияСДенежнымиСредствами Тогда
		РассчитатьБонусыНаКлиенте();
	КонецЕсли;
	// Конец Бонусы
	
	Если ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.СтатусКассовойСмены) Тогда
		ЗаполнитьЗначенияСвойств(Объект, СтруктураСостояниеКассовойСмены,, ПолучитьСтрокуРеквизитыИсключения());
		Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
	КонецЕсли;
	
	Если Объект.ОперацияСДенежнымиСредствами Тогда
		СуммаДляПроверки = Объект.СуммаДокумента;
	Иначе
		СуммаДляПроверки = Объект.Запасы.Итог("Всего");
	КонецЕсли;
	
	СуммаДоРасчетаАвтоСкидок = СуммаДляПроверки;
	Если ИспользоватьАвтоматическиеСкидки Тогда
		Если Объект.Запасы.Количество() > 0 И Не Объект.СкидкиРассчитаны Тогда
			РассчитатьСкидкиНаценки(Команды.РассчитатьСкидкиНаценки);
		КонецЕсли;
	КонецЕсли;
	
	// Вызовем проверку документа, т.к. есть ещё более специфичные проверки, например, серийных номеров.
	НужноОбновитьФормуСписка = Ложь;
	Если НЕ ПроверкаЗаполненияПрошлаУспешно(НужноОбновитьФормуСписка) Тогда
		Возврат;
	КонецЕсли;
	Если НужноОбновитьФормуСписка Тогда
		ПараметрОповещения = Новый Структура("НеОбновлятьОстатокВКассе", Истина);
		Оповестить("ОбновитьФормуСпискаДокументовЧекККМ", ПараметрОповещения);
	КонецЕсли;
	
	Если Объект.ОперацияСДенежнымиСредствами Тогда
		Объект.Предоплата.Очистить();
	КонецЕсли;
	
	Если СуммаДляПроверки <= 0 И Не Объект.ОперацияСДенежнымиСредствами Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОплатитьОбработкаОтветаНаВопрос", ЭтотОбъект, Новый Структура("СуммаДоРасчетаАвтоСкидок, ТипыДенежныхСредств", СуммаДоРасчетаАвтоСкидок, ТипыДенежныхСредств)),
			НСтр("ru = 'Сумма к оплате = 0! Уверены, что нужно продолжить?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Запрос о подтверждении действия'"));
	Иначе
		ОплатитьФрагмент(СуммаДоРасчетаАвтоСкидок, ТипыДенежныхСредств);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПроверкаЗаполненияПрошлаУспешно(НужноОбновитьФормуСписка)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗаполнения = ДокОбъект.ПроверитьЗаполнение();
	Если РезультатЗаполнения Тогда
		Если Не КонтрольНаСкладеОтключен Тогда
			Если Не ЗарезервироватьНаСервере() Тогда
				ОбщегоНазначения.СообщитьПользователю("Не удалось выполнить резервирование!");
				Если Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница <> Элементы.СтраницаДанныеПоСтроке Тогда
					Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке;
				КонецЕсли;
				Возврат Ложь;
			Иначе
				ЗаполнитьОписаниеДляТЧЗапасыНаСервере();
			КонецЕсли;
			
			НужноОбновитьФормуСписка = Истина;
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОплатитьОбработкаОтветаНаВопрос(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		ОплатитьФрагмент(ДополнительныеПараметры.СуммаДоРасчетаАвтоСкидок, ДополнительныеПараметры.ТипыДенежныхСредств);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды ПринятьОплату формы.
//
&НаКлиенте
Процедура ОплатитьФрагмент(СуммаДоРасчетаАвтоСкидок, ТипыДенежныхСредств)
	
	Оповещение = Новый ОписаниеОповещения("ОплатитьЗавершение", ЭтаФорма);
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("Объект", Объект);
	СтруктураПараметров.Вставить("БезналичнаяОплата", Объект.БезналичнаяОплата);
	СтруктураПараметров.Вставить("СуммаДокумента", Объект.СуммаДокумента);
	СтруктураПараметров.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("ВидыКарт", Элементы.ОплатаПлатежнымиКартамиВидПлатежнойКарты.СписокВыбора);
	СтруктураПараметров.Вставить("КассаККМ", КассаККМ);
	СтруктураПараметров.Вставить("ИспользоватьПодключаемоеОборудование", ИспользоватьПодключаемоеОборудование);
	СтруктураПараметров.Вставить("ЭквайринговыйТерминал", Объект.ЭквайринговыйТерминал);
	СтруктураПараметров.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	СтруктураПараметров.Вставить("СуммаДоРасчетаАвтоСкидок", СуммаДоРасчетаАвтоСкидок);
	СтруктураПараметров.Вставить("ТипыДенежныхСредств", ТипыДенежныхСредств);
	СтруктураПараметров.Вставить("Заказ", Объект.Заказ);
	
	ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаОплаты", СтруктураПараметров, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

// Процедура обновляет данные основного реквизита формы после закрытия формы оплаты.
//
&НаСервере
Процедура ОбновитьДокументНаСервере(ПараметрОбъект)
	
	ЗначениеВДанныеФормы(ДанныеФормыВЗначение(ПараметрОбъект, Тип("ДокументОбъект.ЧекККМ")), Объект);
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка, , УникальныйИдентификатор);
		Исключение
			//
		КонецПопытки;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.Запасы Цикл
		УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, ТекущаяСтрока);
	КонецЦикла;
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
КонецПроцедуры

// Процедура - обработчик команды ПринятьОплату. Вызывается после закрытия формы оплаты.
//
&НаКлиенте
Процедура ОплатитьЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		// Были оплаты пластиковыми картами или отмены оплат пластиковыми картами и в этом случае документ был записан или проведён.
		ОбновитьДокументНаСервере(Результат.Объект);
		
		Если Результат.Кнопка = "Пробить чек" Тогда
		
			Объект.ПолученоНаличными = Результат.Наличными;
			
			// Заполним реквизит "ФормаОплаты".
			Если Объект.ПолученоНаличными > 0 И Объект.БезналичнаяОплата.Количество() = 0 Тогда
				Объект.ФормаОплаты = ТипыДенежныхСредствНаличные;
			ИначеЕсли Объект.ПолученоНаличными = 0 И Объект.БезналичнаяОплата.Количество() > 0 Тогда
				Объект.ФормаОплаты = ТипыДенежныхСредствБезналичные;
			Иначе
				Объект.ФормаОплаты = Неопределено;
			КонецЕсли;
			
			Сдача = Формат(Результат.Сдача, "ЧДЦ=2");
			Если ЗначениеЗаполнено(Результат.Бонусы) Тогда
				НачисленныеБонусы = СтрШаблон(НСтр("ru = 'Начислено бонусов: %1 б.'"), Результат.Бонусы);
			Иначе
				НачисленныеБонусы = "";
			КонецЕсли;
			
			ПоказатьСтраницуДанныеПоСтроке = Ложь;
			ПересчитатьДокументНаКлиенте(ПоказатьСтраницуДанныеПоСтроке);
			
			СформироватьТоварныйЧек = Результат.СформироватьТоварныйЧек;
			
			ПробитьЧекВыполнить(Команды.ПробитьЧек, СформироватьТоварныйЧек);
			
			Если ИспользоватьАвторизациюПоОтветственному Тогда
				АвторизацияПоОтветственному();
			КонецЕсли;
			
		ИначеЕсли Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница <> Элементы.СтраницаДанныеПоСтроке Тогда
			
			Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьНадписьКнопкиКОплатеНаКлиенте();
	ОбновитьКартинкуДисконтнойКарты();
	
	ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
	
КонецПроцедуры

// Процедура - обработчик команды ПечатьТоварногоЧека формы
//
&НаКлиенте
Процедура ПечатьТоварногоЧека(Команда)
	РозничныеПродажиКлиент.НапечататьТоварныйЧек(ЭтотОбъект);
КонецПроцедуры


&НаКлиенте
Процедура ПечатьТоварногоЧека_МК(Команда)
	РозничныеПродажиКлиент.НапечататьТоварныйЧек(ЭтотОбъект, СсылкаНаЧек_МК);
КонецПроцедуры


// Процедура - обработчик команды СтруктураПодчиненности формы
//
&НаКлиенте
Процедура СтруктураПодчиненности(Команда)
	
	ТекущийДокумент = Элементы.СписокЧековККМ.ТекущаяСтрока;
	
	Если ТекущийДокумент <> Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности",Новый Структура("ДокументСсылка", ТекущийДокумент),
					ЭтотОбъект,
					ТекущийДокумент.УникальныйИдентификатор(),
					Неопределено
					);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите документ!";
		Сообщение.Поле = "СписокЧековККМ";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды Зарезервировать на сервере.
&НаСервере
Функция ЗарезервироватьНаСервере(ОтменаРезервирования = Ложь)
	
	ВозвращаемоеЗначение = Ложь;
	Если ОтменаРезервирования Тогда
		ТекущийДокумент = Элементы.Список.ТекущаяСтрока;
		Если ЗначениеЗаполнено(ТекущийДокумент) И ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ДокОбъект = ТекущийДокумент.ПолучитьОбъект();
			
			СтарыйСтатус = ДокОбъект.Статус;
			
			ДокОбъект.Статус = Неопределено;
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			
			Попытка
				ДокОбъект.Записать(РежимЗаписи);
				Если Не ДокОбъект.Проведен Тогда
					ВозвращаемоеЗначение = Истина;
					// Если проводим объект, с которым работаем в форме, то нужно обновить объект формы.
					// Такая ситуация возникает в следующем случае. 
					// Включен контроль остатков.
					// 1. Нажать кнопку "Принять оплату". Документ будет записан, т.к. будет выполнено резервирование.
					// 2. В форме оплаты нажать кнопку "Отмена".
					// 3. В списке выбрать текущий документ и выбрать "Еще..."-"Снять резерв".
					// 4. Нажать кнопку "Принять оплату".
					Если ДокОбъект.Ссылка = Объект.Ссылка Тогда
						ЗначениеВДанныеФормы(ДокОбъект, Объект);
					КонецЕсли;
				КонецЕсли;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Поле = "Список";
				Сообщение.Сообщить();
			КонецПопытки;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не выбран чек ККМ!";
			Сообщение.Поле = "Список";
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		СтарыйСтатус = Объект.Статус;
		
		Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован;
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
		Попытка
			Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписи)) Тогда
				Объект.Статус = СтарыйСтатус;
			Иначе
				ВозвращаемоеЗначение = Истина;
			КонецЕсли;
		Исключение
			Объект.Статус = СтарыйСтатус;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось выполнить проведение документа!";
			Сообщение.Сообщить();
			
			ОписаниеОшибки = ОписаниеОшибки();
			Если СтрНайти(ОписаниеОшибки, НСтр("ru='Не удалось провести'")) = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Описание ошибки: "+ОписаниеОшибки;
				Сообщение.Сообщить();
			КонецЕсли;
		КонецПопытки;
		
		УстановитьДоступностьПечатиЧека();
	КонецЕсли;
	
	ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции // ЗарезервироватьНаСервере()

// Процедура - обработчик команды СнятьРезервирование.
//
&НаКлиенте
Процедура СнятьРезервирование(Команда)
	
	ЗарезервироватьНаСервере(Истина);
	
	Оповестить("ОбновитьФормуСпискаДокументовЧекККМ");
	
КонецПроцедуры // СнятьРезервирование()

&НаКлиенте
Процедура ВыбратьВариантПоУмолчанию(Команда)
	
	Если ЭтоПолноправныйПользователь() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьВариантВозврата", ЭтотОбъект);
		ОткрытьФорму("Обработка.НастройкаПрограммы.Форма",
			Новый Структура("РазделПоУмолчанию", "Продажи"),
			ЭтотОбъект,
			Ложь,,,
			ОписаниеОповещения);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Эта настройка доступна только администратору'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВариантВозврата(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Элементы.СписокЧековККМ.ТекущаяСтрока) Тогда
		ЗаполнитьСоставЧекаИСсылкиНаДокументыНаСервере(Элементы.СписокЧековККМ.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВариантВозврата()
	
	Возврат Константы.ВариантВозвратаПоЗакрытойСмене.Получить();
	
КонецФункции

&НаСервере
Функция ЭтоПолноправныйПользователь()
	
	Возврат Пользователи.ЭтоПолноправныйПользователь();
	
КонецФункции

&НаСервере
Функция ЗаполненПоЧекуНаСервере(СсылкаНаДокумент)
	
	ТекстСообщения = НСтр("ru = 'Заполнение возможно только на основании чека ККМ по предоплате'");
	
	Если ТипЗнч(СсылкаНаДокумент) <> Тип("ДокументСсылка.ЧекККМ") Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не СсылкаНаДокумент.ОперацияСДенежнымиСредствами Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваДляКопирования = "
	|ДисконтнаяКарта,
	|ЕстьЗаказы,
	|Заказ,
	|КонтактноеЛицоПодписант,
	|Контрагент,
	|Договор,
	|Подразделение,
	|ПроцентСкидкиПоДисконтнойКарте,
	|СуммаДокумента,
	|Телефон,
	|ХозяйственнаяОперация";
	
	ЗаполнитьЗначенияСвойств(Объект, СсылкаНаДокумент, СвойстваДляКопирования);
	Объект.Запасы.Загрузить(СсылкаНаДокумент.Запасы.Выгрузить());
	Объект.СерийныеНомера.Загрузить(СсылкаНаДокумент.СерийныеНомера.Выгрузить());
	Объект.ДобавленныеНаборы.Загрузить(СсылкаНаДокумент.ДобавленныеНаборы.Выгрузить());
	СтрокаПредоплаты = Объект.Предоплата.Добавить();
	СтрокаПредоплаты.Документ = СсылкаНаДокумент;
	СтрокаПредоплаты.Заказ = СсылкаНаДокумент.Заказ;
	СтрокаПредоплаты.СуммаРасчетов = СсылкаНаДокумент.СуммаДокумента;
	СтрокаПредоплаты.Курс = СсылкаНаДокумент.Курс;
	СтрокаПредоплаты.Кратность = СсылкаНаДокумент.Кратность;
	СтрокаПредоплаты.СуммаПлатежа = СсылкаНаДокумент.СуммаДокумента;
	
	Объект.ОперацияСДенежнымиСредствами = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоЧеку(Команда)
	
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		ЧекЗаполнен = ЗаполненПоЧекуНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
		Если ЧекЗаполнен Тогда
			УстановитьВидимостьДоговора(Элементы, Объект.Контрагент);
			ПересчитатьДокументНаКлиенте();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйПоискПоШК(Команда)
	ПоискНоменклатурыПоШтрихКоду = Истина;
	Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду.Видимость = ПоискНоменклатурыПоШтрихКоду;
	Элементы.ЗначениеПоискаНоменклатуры.Видимость = Не ПоискНоменклатурыПоШтрихКоду;
	
	ОбновитьСправочникНастройкиРМК();
	
	УстановитьГорячиеКлавишиПоискаПоШК();
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйПоискПоРеквизитам(Команда)
	ПоискНоменклатурыПоШтрихКоду = Ложь;
	Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду.Видимость = ПоискНоменклатурыПоШтрихКоду;
	Элементы.ЗначениеПоискаНоменклатуры.Видимость = Не ПоискНоменклатурыПоШтрихКоду;
	
	ОбновитьСправочникНастройкиРМК();
	
	УстановитьГорячиеКлавишиПоискаПоШК();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГорячиеКлавишиПоискаПоШК()
	
	ПустоеСочетание = Новый СочетаниеКлавиш(Клавиша.Нет);
	СочетаниеПоиск = Новый СочетаниеКлавиш(Клавиша.F,Истина,Ложь,Ложь); 
	
	Если Элементы.ЗначениеПоискаНоменклатуры.Видимость Тогда
		Элементы.ЗначениеПоискаНоменклатуры.СочетаниеКлавиш = СочетаниеПоиск;
		Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду.СочетаниеКлавиш = ПустоеСочетание;
	Иначе
		Элементы.ЗначениеПоискаНоменклатуры.СочетаниеКлавиш = ПустоеСочетание;
		Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду.СочетаниеКлавиш = СочетаниеПоиск;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события ПриИзменении поля ввода ЗначениеПоискаНоменклатуры.
//
&НаКлиенте
Процедура ЗначениеПоискаНоменклатурыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЗначениеПоискаНоменклатуры) Тогда
		
		СтруктураДанныеНоменклатуры = Новый Структура();
		СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ЗначениеПоискаНоменклатуры);
		СтруктураДанныеНоменклатуры.Вставить("Характеристика", Неопределено);
		СтруктураДанныеНоменклатуры.Вставить("Организация", Объект.Организация);
		СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", Объект.Дата);
		
		СтатусПартии = Новый СписокЗначений;
		СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
		
		СтруктураДанныеНоменклатуры.Вставить("СтатусПартии", СтатусПартии);
		
		СтруктураДанныеНоменклатуры = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
		
		// Если требуется ввод акцизной марки, то нужно добавлять отдельную строку?
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, НоменклатураНабора");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтруктураДанныеНоменклатуры);
		
		МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрокТЧ.Количество() = 0
			ИЛИ (ИспользуетсяРегистрацияРозничныхПродажВЕГАИС И СтруктураДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки) 
			ИЛИ (ИспользуетсяМаркировкаТабачнойПродукции И СтруктураДанныеНоменклатуры.НеобходимостьВводаКодаМаркировки) Тогда
			
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = ЗначениеПоискаНоменклатуры;
			НоменклатураПриИзменении(НоваяСтрока);
			
		Иначе
			
			НоваяСтрока = МассивСтрокТЧ[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + 1;
			РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
			
		КонецЕсли;
		
		ЗначениеПоискаНоменклатуры = Неопределено;
		ЭтаФорма.Модифицированность = Истина;
		
		ТекущийЭлемент = Элементы.ЗначениеПоискаНоменклатуры;
		Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.Запасы.ТекущийЭлемент = Элементы.ЗапасыКоличество;
		
		ПересчитатьДокументНаКлиенте();
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(СтруктураДанныеНоменклатуры, ЗначениеПоискаНоменклатуры);
		КонецЕсли
		
	КонецЕсли;
	
	НастроитьЗакладкиПродажиМК();
	
	ПодключитьОбработчикОжидания("СпозиционироватьНаПоискеНоменклатура", 0.1, Истина);
	
КонецПроцедуры // ЗначениеПоискаНоменклатурыПриИзменении()

&НаКлиенте
Процедура ЗначениеПоискаНоменклатурыПоШтрихКодуПриИзменении(Элемент)
	
	ТекШтрихкод = ЗначениеПоискаНоменклатурыПоШтрихКоду;
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		
		Данные = Новый Массив();
		Данные.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1)); 
		
		ПолученыШтрихкоды(Данные);
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("СпозиционироватьНаПоискеШК", 0.1, Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ЧекНеПредъявлен формы.
//
&НаКлиенте
Процедура ЧекНеПредъявленПриИзменении(Элемент)
	
	ЧекНеПредъявленПриИзмененииНаСервере();
	
	Если Не ЧекНеПредъявлен Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьПриходнуюНакладнуюНаВозврат", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьРКОНаОснованииПриходнойНакладной", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьЧекККМНаВозврат", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоманднаяПанельВозврата", "Видимость", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ЧекНеПредъявлен на сервере.
//
&НаСервере
Процедура ЧекНеПредъявленПриИзмененииНаСервере()
	
	Если ЧекНеПредъявлен Тогда
		ПриходнаяНакладнаяНаВозврат = "";
		РКО = "";
		
		Элементы.ДекорацияЗаголовокЧекиККМ.Заголовок = "Создайте приходную накладную и РКО";
		
		Элементы.ДекорацияПриходнаяНакладная.Заголовок = "";
		Элементы.ДекорацияРКО.Заголовок = "";
		
		Элементы.ДекорацияЧекККМНаВозврат.Видимость = Ложь;
		Элементы.ДекорацияПриходнаяНакладная.Видимость = Истина;
		Элементы.ДекорацияРКО.Видимость = Истина;
		
		Элементы.СоздатьЧекККМНаВозврат.Видимость = Ложь;
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.Видимость = Истина;
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.Видимость = Истина И ЕстьПравоОформлятьРКО;
		
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.ЦветТекста = Новый Цвет;
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.ЦветТекста = ?(ЧекНеПредъявлен, WebЦвета.Серый, Новый Цвет);
		Элементы.КоманднаяПанельВозврата.Видимость = Ложь;
		
		Элементы.СтраницыСписокЧековККМ_и_СоставЧекаККМ_и_СтраницаСНадписью.ТекущаяСтраница = Элементы.СтраницаСПустойНадписью;
	Иначе
		Элементы.ДекорацияЗаголовокЧекиККМ.Заголовок = "Выберите основание для возврата";
		
		Элементы.СтраницыСписокЧековККМ_и_СоставЧекаККМ_и_СтраницаСНадписью.ТекущаяСтраница = Элементы.СтраницаСписокЧековККМ_и_СоставЧекаККМ;
	КонецЕсли;
	
КонецПроцедуры

// Функция получает связанные документы определенного вида, помещает их во временное хранилище
// и возвращает адрес
//
&НаСервере
Функция ПоместитьСвязанныеДокументыВХранилище(ЧекККМ, Вид)
	
	// Заполним ссылки на документы.
	Запрос = Новый Запрос;
	
	Если Вид = "ПриходнаяНакладная" Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриходнаяНакладная.Ссылка КАК СвязанныйДокумент
			|ИЗ
			|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
			|ГДЕ
			|	ПриходнаяНакладная.Проведен
			|	И ПриходнаяНакладная.ЧекККМ = &ЧекККМ";
	ИначеЕсли Вид = "РасходИзКассы" Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриходнаяНакладная.Ссылка,
			|	ПриходнаяНакладная.Номер,
			|	ПриходнаяНакладная.Дата
			|ПОМЕСТИТЬ ПриходнаяНакладная
			|ИЗ
			|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
			|ГДЕ
			|	ПриходнаяНакладная.Проведен
			|	И ПриходнаяНакладная.ЧекККМ = &ЧекККМ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходИзКассы.Ссылка КАК СвязанныйДокумент
			|ИЗ
			|	Документ.РасходИзКассы КАК РасходИзКассы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриходнаяНакладная КАК ПриходнаяНакладная
			|		ПО РасходИзКассы.ДокументОснование = ПриходнаяНакладная.Ссылка
			|ГДЕ
			|	РасходИзКассы.Проведен";
	ИначеЕсли Вид = "ЧекККМВозврат" Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЧекККМВозврат.Ссылка КАК СвязанныйДокумент
			|ИЗ
			|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
			|ГДЕ
			|	ЧекККМВозврат.Проведен
			|	И ЧекККМВозврат.ЧекККМ = &ЧекККМ";
	ИначеЕсли Вид = "ЧекККМ" Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЧекККМЗапасы.Ссылка КАК СвязанныйДокумент
			|ИЗ
			|	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
			|ГДЕ
			|	ЧекККМЗапасы.Ссылка.Проведен
			|	И ЧекККМЗапасы.Заказ = &ЧекККМ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЧекККМВозвратЗапасы.Ссылка
			|ИЗ
			|	Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозвратЗапасы
			|ГДЕ
			|	ЧекККМВозвратЗапасы.Ссылка.Проведен
			|	И ЧекККМВозвратЗапасы.Заказ = &ЧекККМ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПриходнаяНакладнаяЗапасы.Ссылка
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			|ГДЕ
			|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И ПриходнаяНакладнаяЗапасы.Заказ = &ЧекККМ
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЧекККМ", ЧекККМ);
	
	Результат = Запрос.Выполнить();
	
	Возврат ПоместитьВоВременноеХранилище(
		Результат.Выгрузить(),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьДокументыОснованияВХранилище()

// Процедура - обработчик события Нажатие элемента ДекорацияПриходнаяНакладная формы.
//
&НаКлиенте
Процедура ДекорацияПриходнаяНакладнаяНажатие(Элемент)
	
	Если ЧекНеПредъявлен Тогда
		Если Не ПриходнаяНакладнаяНаВозврат.Пустая() Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыПриходнаяНакладнаяВозврат");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", Новый Структура("Ключ", ПриходнаяНакладнаяНаВозврат));
		КонецЕсли;
	Иначе
		ТекЧекККМ = Элементы.СписокЧековККМ.ТекущаяСтрока;
		Если ТекЧекККМ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		АдресВХранилищеСвязанныхДокументов = ПоместитьСвязанныеДокументыВХранилище(ТекЧекККМ, "ПриходнаяНакладная");
		ПараметрыФормы = Новый Структура("АдресВХранилищеСвязанныхДокументов", АдресВХранилищеСвязанныхДокументов);
		ОткрытьФорму("Документ.ЧекККМ.Форма.СвязанныеДокументы", ПараметрыФормы
			,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента ДекорацияРКО формы.
//
&НаКлиенте
Процедура ДекорацияРКОНажатие(Элемент)
	
	Если ЧекНеПредъявлен Тогда
		Если Не РКО.Пустая() Тогда
			ОткрытьФорму("Документ.РасходИзКассы.ФормаОбъекта", Новый Структура("Ключ", РКО));
		КонецЕсли;
	Иначе
		ТекЧекККМ = Элементы.СписокЧековККМ.ТекущаяСтрока;
		Если ТекЧекККМ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		АдресВХранилищеСвязанныхДокументов = ПоместитьСвязанныеДокументыВХранилище(ТекЧекККМ, "РасходИзКассы");
		ПараметрыФормы = Новый Структура("АдресВХранилищеСвязанныхДокументов", АдресВХранилищеСвязанныхДокументов);
		ОткрытьФорму("Документ.ЧекККМ.Форма.СвязанныеДокументы", ПараметрыФормы
			,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента ДекорацияЧекККМНаВозврат формы.
//
&НаКлиенте
Процедура ДекорацияЧекККМНаВозвратНажатие(Элемент)
		
	ТекЧекККМ = Элементы.СписокЧековККМ.ТекущаяСтрока;
	Если ТекЧекККМ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	АдресВХранилищеСвязанныхДокументов = ПоместитьСвязанныеДокументыВХранилище(ТекЧекККМ, "ЧекККМВозврат");
	ПараметрыФормы = Новый Структура("АдресВХранилищеСвязанныхДокументов", АдресВХранилищеСвязанныхДокументов);
	ОткрытьФорму("Документ.ЧекККМ.Форма.СвязанныеДокументы", ПараметрыФормы
		,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЧекККМНажатие(Элемент)
	
	ТекЗаказ = Элементы.СписокЗаказов.ТекущаяСтрока;
	Если ТекЗаказ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	АдресВХранилищеСвязанныхДокументов = ПоместитьСвязанныеДокументыВХранилище(ТекЗаказ, "ЧекККМ");
	ПараметрыФормы = Новый Структура("АдресВХранилищеСвязанныхДокументов", АдресВХранилищеСвязанныхДокументов);
	ОткрытьФорму("Документ.ЧекККМ.Форма.СвязанныеДокументы", ПараметрыФормы
		,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ПереключательЖурналБыстрыеТовары формы.
//
&НаКлиенте
Процедура ПереключательЖурналБыстрыеТоварыПриИзменении(Элемент)
	
	Если ПереключательЖурналБыстрыеТовары = 1 Тогда // Журнал
		Элементы.СтраницыЖурналИБыстрыеТовары.ТекущаяСтраница = Элементы.Журнал;
	ИначеЕсли ПереключательЖурналБыстрыеТовары = 2 Тогда // Быстрые товары
		Элементы.СтраницыЖурналИБыстрыеТовары.ТекущаяСтраница = Элементы.БыстрыеТовары;
	Иначе // Основные реквизиты
		Элементы.СтраницыЖурналИБыстрыеТовары.ТекущаяСтраница = Элементы.ОсновныеРеквизиты;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриСменеСтраницы элемента ГруппаПродажаИВозврат формы.
//
&НаКлиенте
Процедура ГруппаПродажаИВозвратПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыЖурналИБыстрыеТоварыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.СтраницыЖурналИБыстрыеТовары.ТекущаяСтраница = Элементы.Журнал Тогда // Журнал
		ПереключательЖурналБыстрыеТовары = 1;
	ИначеЕсли Элементы.СтраницыЖурналИБыстрыеТовары.ТекущаяСтраница = Элементы.БыстрыеТовары Тогда // Быстрые товары
		ПереключательЖурналБыстрыеТовары = 2;
	Иначе // Основные реквизиты
		ПереключательЖурналБыстрыеТовары = 3;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элемент.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		КонтрагентАктивнойСтроки = ?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.Контрагент);
		ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСпискаЗаказов", 0.2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборВидЗаказаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ВидЗаказа", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СостояниеЗаказа", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОплатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтатусОплаты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтгрузкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Если ВыбранноеЗначение = "Отгружен полностью" Тогда
		СтатусОтгрузки = 0;
	ИначеЕсли ВыбранноеЗначение = "Отгружен частично" Тогда
		СтатусОтгрузки = 1;
	ИначеЕсли ВыбранноеЗначение = "Без отгрузки" Тогда
		СтатусОтгрузки = 2;
	Иначе
		возврат;
	КонецЕсли;	
	
	УстановитьМеткуИОтборСписка("СтатусОтгрузки", Элемент.Родитель.Имя, СтатусОтгрузки, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиницаРезерв", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийРеквизитовШапки

// Процедура - обработчик события ПриИзменении поля ЭквайринговыйТерминал формы.
//
&НаКлиенте
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	
	ЭквайринговыйТерминалПриИзмененииНаСервере();
	
КонецПроцедуры // ЭквайринговыйТерминалПриИзменении()

// Процедура - обработчик события ПриИзменении поля ЭквайринговыйТерминал на сервере.
//
&НаСервере
Процедура ЭквайринговыйТерминалПриИзмененииНаСервере()
	
	ПолучитьСсылкиНаОборудование();
	ПолучитьСписокВыбораВидовПлатежныхКарт();
	
КонецПроцедуры // ЭквайринговыйТерминалПриИзмененииНаСервере()

// Процедура - обработчик события ПриИзменении поля КассаККМ.
//
&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	Если КассаККМ.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Касса ККМ не может быть пустой";
		Сообщение.Поле = "КассаККМ";
		Сообщение.Сообщить();
		
		КассаККМ = ПредыдущаяКассаККМ;
		Возврат;
	КонецЕсли;
	
	Если КассаККМ = ПредыдущаяКассаККМ Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущаяКассаККМ = КассаККМ;
	Объект.КассаККМ = КассаККМ;
	
	ПараметрыКассы = Новый Структура("ВалютаДенежныхСредств");
	КассаККМПриИзмененииНаСервере(ПараметрыКассы);
	
	Если Объект.Запасы.Количество() > 0 Тогда
		УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы", Истина);
		УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтаФорма, ПараметрыКассы.ВалютаДенежныхСредств, "Запасы");
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтаФорма, "Запасы");
		
		ЗаполнитьСуммыСкидок();
		
		ПересчитатьДокументНаКлиенте();
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаКлиенте());
	
	УстановитьОрганизациюПоВладельцуККМ();
	
	Если ИспользоватьАвторизациюПоОтветственному Тогда
		АвторизацияПоОтветственному();
	КонецЕсли;
	
КонецПроцедуры // КассаККМПриИзменении()

// Процедура - обработчик события ПриИзменении поля КассаККМ на сервере.
//
&НаСервере
Процедура КассаККМПриИзмененииНаСервере(ПараметрыКассы)
	
	ПараметрыКассы.Вставить("ВалютаДенежныхСредств", ПредыдущаяКассаККМ.ВалютаДенежныхСредств);
	
	КассаККМИспользоватьБезПодключенияОборудования = КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	Объект.ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Объект.КассаККМ);
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	ЗаполнитьЗначенияСвойств(Объект, СтруктураСостояниеКассовойСмены);
	Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
	
	Элементы.СнятьРезервирование.Видимость = НЕ КонтрольНаСкладеОтключен;
	
	ОбновитьВидимостьНадписиИстеклоБолее24Часов(СтруктураСостояниеКассовойСмены);
	
	ОстатокВКассе = СтруктураСостояниеКассовойСмены.НаличностьВКассе;
	ОстатокВКассеСтрока = "" + ОстатокВКассе;
	
	Объект.КассаККМ = КассаККМ;
	Объект.СтруктурнаяЕдиница = КассаККМ.СтруктурнаяЕдиница;
	Объект.ВидЦен = КассаККМ.СтруктурнаяЕдиница.РозничныйВидЦен;
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Объект.ВалютаДокумента = КассаККМ.ВалютаДенежныхСредств;
	КонецЕсли;
	Объект.Организация = Объект.КассаККМ.Владелец;
	Объект.Подразделение = Объект.КассаККМ.Подразделение;
	Объект.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);

	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПолучитьСписокВыбораВидовПлатежныхКарт();
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДокумента));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.НациональнаяВалюта.Получить()));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаСервере());
	
	КассаККМИспользоватьБезПодключенияОборудования = Объект.КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	УстановитьДоступностьПечатиЧека();
	
	Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит
	И НЕ КассаККМИспользоватьБезПодключенияОборудования Тогда
		УстановитьРежимТолькоПросмотр();
	КонецЕсли;
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	ПродажаСоСклада = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад;
	
	Элементы.ЗапасыЦена.ТолькоПросмотр 					= НЕ РазрешеноРедактированиеЦенДокументов; // ИЛИ НЕ ПродажаСоСклада;
	Элементы.ЗапасыСумма.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов; // ИЛИ НЕ ПродажаСоСклада; 
	Элементы.ЗапасыПроцентСкидкиНаценки.ТолькоПросмотр  = НЕ РазрешеноРедактированиеЦенДокументов;
	
	Элементы.ЗапасыСуммаСкидкиНаценки.ТолькоПросмотр	= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаНДС.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов; // ИЛИ НЕ ПродажаСоСклада;
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	Список.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	Список.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	Список.Параметры.УстановитьЗначениеПараметра("Статус", Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("Статус", Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("Статус", Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	СформироватьЗаголовок(СтруктураСостояниеКассовойСмены);
	
	УстановитьПериодНаСервере(ВидПериодаЧековККМПеречисление, "СписокЧековККМ", 
							  Новый СтандартныйПериод(Элементы.СписокЧековККМ.Период.ДатаНачала, Элементы.СписокЧековККМ.Период.ДатаОкончания));
	УстановитьПериодНаСервере(ВидПериодаЧековККМНаВозвратПеречисление, "СписокЧековККМНаВозврат", 
							  Новый СтандартныйПериод(Элементы.СписокЧековККМНаВозврат.Период.ДатаНачала, Элементы.СписокЧековККМНаВозврат.Период.ДатаОкончания));
	УстановитьПериодНаСервере(ВидПериодаЖурналаПеречисление, "Список", 
							  Новый СтандартныйПериод(Элементы.Список.Период.ДатаНачала, Элементы.Список.Период.ДатаОкончания));
	
	// Пересчёт ТЧ Запасы
	СброситьФлагСкидкиРассчитаныСервер("ИзменениеКассыККМ");
	
КонецПроцедуры // КассаККМПриИзмененииНаСервере()

// Процедура - обработчик события ПриИзменении поля Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	
	// Сформируем надпись цены и валюты.
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаКлиенте());
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении флага НеПоказыватьПриОткрытииФормуВыбораКассы.
//
&НаКлиенте
Процедура НеПоказыватьПриОткрытииФормуВыбораКассыПриИзменении(Элемент)
	
	// РМК
	РабочееМестоКассираВызовСервера.ОбновитьНастройкиРМК(НастройкаРМК, НеПоказыватьПриОткрытииФормуВыбораКассы, СверятьИтогиНаЭТПриЗакрытииСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийТекущегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьВидимостьДоговора(Элементы, Объект.Контрагент);
	Объект.Договор = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.Договор);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыВыбора(Документ, Организация, Контрагент, Договор)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийРеквизитовТабличнойЧасти

// Процедура - обработчик события ПриИзменении колонки Номенклатура ТЧ Запасы.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	ЗапасыНоменклатураПриИзмененииОбработчик("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении_МК(Элемент)
	ЗапасыНоменклатураПриИзмененииОбработчик("ЗапасыМК");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзмененииОбработчик(ИмяТЧ)
	
	// МОТП
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	// Конец МОТП
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	
	// МОТП
	Если СтрокаТабличнойЧасти.МаркируемаяПродукция = 1 Тогда
		ПараметрыМаркировки = ИнтеграцияМОТПУНФКлиент.ИнициализироватьПараметрыОткрытияФормыВводаКодаМаркировки();
		ПараметрыМаркировки.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		Если СтрокаТабличнойЧасти.ТабачнаяПродукция = 1 Тогда
			ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табачная");
		Иначе
			ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная");
		КонецЕсли;
		ПараметрыМаркировки.Вставить("ВидПродукции", ВидПродукции);
		ПараметрыМаркировки.Вставить("МаркируемаяПродукция", Истина);
		ПараметрыМаркировки.Вставить("ПараметрыСканирования", ШтрихкодированиеИСКлиентСервер.ИнициализироватьПараметрыСканирования(ЭтотОбъект));
		ИнтеграцияМОТПУНФКлиент.ОткрытьФормуСчитыванияКодаМаркировки(ЭтотОбъект, ПараметрыМаркировки);
		Объект.Запасы.Удалить(СтрокаТабличнойЧасти);
		Возврат;
	КонецЕсли;
	// Конец МОТП
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураДанные.Вставить("Коэффициент", 1);
		СтруктураДанные.Вставить("Содержание", "");
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
		
	КонецЕсли;
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	// Конец ДисконтныеКарты
	
	СтатусПартии = Новый СписокЗначений;
	СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
	СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
	
	СтруктураДанные.Вставить("СтатусПартии", СтатусПартии);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	Если СтруктураДанные.ЭтоНабор И НЕ СтруктураДанные.ИспользоватьХарактеристики Тогда
		
		// Наборы
		ЗаменитьСтрокуЗапасовДаннымиНабора(ЭтотОбъект, СтрокаТабличнойЧасти, СтруктураДанные);
		
		ЗаполнитьПризнакиИспользованияХарактеристик();
		
		// АвтоматическиеСкидки.
		СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
		// Конец АвтоматическиеСкидки
	
		#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		Элементы[ИмяТЧ].ЗакончитьРедактированиеСтроки(Истина);
		#КонецЕсли 
		
		ПересчитатьДокументНаКлиенте();
		
	Иначе
		
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Количество = 1;
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
		СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		СтрокаТабличнойЧасти.НеобходимостьВводаАкцизнойМарки = СтруктураДанные.НеобходимостьВводаАкцизнойМарки;
		СтрокаТабличнойЧасти.НеобходимостьВводаКодаМаркировки = СтруктураДанные.НеобходимостьВводаКодаМаркировки;
		// Наборы
		СтрокаТабличнойЧасти.ЭтоНабор = СтруктураДанные.ЭтоНабор;
		
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		
		//Серийные номера
		Для каждого ВыделеннаяСтрока Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
			ТекущиеДанныеСтроки = Элементы[ИмяТЧ].ДанныеСтроки(ВыделеннаяСтрока);
			РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
		КонецЦикла;
		
		//Характеристики
		СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
		СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
		СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
		
		Если СтруктураДанные.ИспользоватьХарактеристики
			Тогда
			СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
		КонецЕсли;
		//Конец Характеристики
		
		//Партии
		СтрокаТабличнойЧасти.ИспользоватьПартии = СтруктураДанные.ИспользоватьПартии;
		СтрокаТабличнойЧасти.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
		
		Если СтруктураДанные.ИспользоватьПартии
			Тогда
			СтрокаТабличнойЧасти.Партия = СтруктураДанные.Партия;
		КонецЕсли;
		// Конец Партии
		
		//ОткрытьВводАкцизнойМарки(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(СтруктураДанные, СтрокаТабличнойЧасти.Номенклатура);
	КонецЕсли
	
КонецПроцедуры

// Процедура - обработчик события ПриНачалеРедактирования табличной части Запасы формы.
//
&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование И
		(Элемент.ТекущиеДанные.ПроцентАвтоматическойСкидки <> 0 ИЛИ Элемент.ТекущиеДанные.СуммаАвтоматическойСкидки <> 0) Тогда
		Элемент.ТекущиеДанные.ПроцентАвтоматическойСкидки = 0;
		Элемент.ТекущиеДанные.СуммаАвтоматическойСкидки = 0;
		РассчитатьСуммуВСтрокеТабличнойЧасти();
	ИначеЕсли ИспользоватьАвтоматическиеСкидки И НоваяСтрока И Копирование Тогда
		// Автоматические скидки стали неактуальны.
		СброситьФлагСкидкиРассчитаныКлиент("ПриНачалеРедактирования");
	КонецЕсли;
	
	// МОТП
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
		Элемент.ТекущиеДанные.КодМаркировки = "";
		Элемент.ТекущиеДанные.КоличествоАкцизныхМарок = 0;
		АкцизныеМаркиКлиентСервер.ЗаполнитьИндексАкцизнойМарки(Элемент.ТекущиеДанные);
	ИначеЕсли Копирование Тогда
		Элемент.ТекущиеДанные.КоличествоАкцизныхМарок = 0;
		АкцизныеМаркиКлиентСервер.ЗаполнитьИндексАкцизнойМарки(Элемент.ТекущиеДанные);
	КонецЕсли;
	// Конец МОТП
	
КонецПроцедуры

// Процедура - обработчик события ПриОкончанииРедактирования строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры // ЗапасыПриОкончанииРедактирования()

// Процедура - обработчик события ПередУдалением строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	ЗапасыПередУдалениемОбработчикСобытия("Запасы", Отказ);
	
КонецПроцедуры

// Процедура - обработчик события ПередУдалением строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПередУдалением_МК(Элемент, Отказ)
	
	ЗапасыПередУдалениемОбработчикСобытия("ЗапасыМК", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалениемОбработчикСобытия(ИмяТЧ, Отказ)
	
	// Наборы
	Если Элементы[ИмяТЧ].ВыделенныеСтроки.Количество()= Объект.Запасы.Количество() Тогда
		// Если выделены все строки - проверки удаления наборов не выполняются
		Объект.ДобавленныеНаборы.Очистить();
	Иначе
		ДанныеНабора = Новый Структура("НоменклатураНабора, ХарактеристикаНабора");
		Для каждого ВыделеннаяСтрока Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
			ТекущиеДанныеСтроки = Элементы[ИмяТЧ].ДанныеСтроки(ВыделеннаяСтрока);
			Если ДанныеНабора.НоменклатураНабора=Неопределено Тогда
				ДанныеНабора.НоменклатураНабора = ТекущиеДанныеСтроки.НоменклатураНабора;
				ДанныеНабора.ХарактеристикаНабора = ТекущиеДанныеСтроки.ХарактеристикаНабора;
			ИначеЕсли ДанныеНабора.НоменклатураНабора<>ТекущиеДанныеСтроки.НоменклатураНабора 
				ИЛИ ДанныеНабора.ХарактеристикаНабора<>ТекущиеДанныеСтроки.ХарактеристикаНабора Тогда
				// Выделены строки разных наборов
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Действие недоступно для наборов!'");
				Сообщение.Поле = "Объект.Запасы";
				Сообщение.Сообщить();
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Отказ И ЗначениеЗаполнено(ДанныеНабора.НоменклатураНабора) Тогда
			// Набор можно удалить только целиком
			Отказ = Истина;
			ДобавленныеНаборы = Объект.ДобавленныеНаборы.НайтиСтроки(ДанныеНабора);
			Оповещение = Новый ОписаниеОповещения("ЗапасыПередУдалениемЗавершение", ЭтотОбъект, ДанныеНабора);
			СписокКнопок = Новый СписокЗначений;
			Если ДобавленныеНаборы.Количество()>0 И ДобавленныеНаборы[0].Количество>1 Тогда
				// в ТЧ есть несколько одинаковых наборов
				ТекстВопроса = НСтр("ru = 'Набор можно удалить только целиком. В табличную часть добавлено несколько экземпляров данного набора'");
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Удалить все'"));
				СписокКнопок.Добавить("УдалитьОдин", НСтр("ru = 'Удалить один экземпляр'"));
			Иначе
				ТекстВопроса = НСтр("ru = 'Набор можно удалить только целиком'");
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Удалить'"));
			КонецЕсли; 
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Редактировать состав'"));
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, 0, КодВозвратаДиалога.Да);
		КонецЕсли; 
	КонецЕсли; 
	// Конец Наборы
	
	Если НЕ Отказ Тогда
		ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
		УправлениеНебольшойФирмойКлиентСервер.УдалитьСтрокиПоКлючуСвязи(Объект.АкцизныеМарки, ТекущиеДанные);
		УправлениеНебольшойФирмойКлиентСервер.УдалитьСтрокиПоКлючуСвязи(Объект.СкидкиНаценки, ТекущиеДанные);
		// Серийные номера
		Для каждого ВыделеннаяСтрока Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
			ТекущиеДанныеСтроки = Элементы[ИмяТЧ].ДанныеСтроки(ВыделеннаяСтрока);
			РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
		КонецЦикла;
	КонецЕсли;
	
	// МОТП
	ДанныеУдаляемыхСтрокМаркировка = Новый Массив;
	ВыделенныеСтроки = Элементы.Запасы.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.Запасы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		ДанныеОтбора = Новый Структура;
		ДанныеОтбора.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		ДанныеОтбора.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		ДанныеОтбора.Вставить("Партия", ПредопределенноеЗначение("Справочник.ПартииНоменклатуры.ПустаяСсылка"));
		ДанныеОтбора.Вставить("Количество",  0);
		ДанныеОтбора.Вставить("НомерСтроки", 0);
		ЗаполнитьЗначенияСвойств(ДанныеОтбора, СтрокаТЧ);
		ДанныеОтбора.Вставить("Серия", ?(ЗначениеЗаполнено(ДанныеОтбора.Партия), ДанныеОтбора.Партия, Неопределено));
		ДанныеОтбора.Удалить("Партия");
		ДанныеУдаляемыхСтрокМаркировка.Добавить(ДанныеОтбора);
	КонецЦикла;
	
	Если ДанныеУдаляемыхСтрокМаркировка <> Неопределено Тогда
		УдалитьАкцизныеМарки(ДанныеУдаляемыхСтрокМаркировка, Отказ);
	КонецЕсли;
	// Конец МОТП
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалениемЗавершение(Результат, ДанныеНабора) Экспорт
	
	// Наборы
	Если Результат=Неопределено ИЛИ Результат=КодВозвратаДиалога.Отмена Тогда
		Возврат
	КонецЕсли;
	
	СтрокиНабора = Объект.Запасы.НайтиСтроки(ДанныеНабора);
	Если СтрокиНабора.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаТабличнойЧасти = СтрокиНабора[0];
	
	Если Результат=КодВозвратаДиалога.Нет Тогда
		
		РедактироватьСоставНабора(СтрокаТабличнойЧасти);
		
	ИначеЕсли Результат=КодВозвратаДиалога.Да Тогда
		
		Для каждого Стр Из СтрокиНабора Цикл
			РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, Стр, , ИспользоватьСерийныеНомераОстатки);
		КонецЦикла; 
		НаборыКлиент.УдалитьСтрокиНабора(СтрокаТабличнойЧасти.НоменклатураНабора, СтрокаТабличнойЧасти.ХарактеристикаНабора, , Объект.Запасы, Объект.ДобавленныеНаборы);
		
		Модифицированность = Истина;
		ВыполнитьДействияПослеУдаленияСтрокиЗапасов();
		
	ИначеЕсли Результат="УдалитьОдин" Тогда
		
		ДобавленныеСтроки = Объект.ДобавленныеНаборы.НайтиСтроки(ДанныеНабора);
		Если ДобавленныеСтроки.Количество()=0 ИЛИ ДобавленныеСтроки[0].Количество<=1 Тогда
			Для каждого Стр Из СтрокиНабора Цикл
				РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, Стр, , ИспользоватьСерийныеНомераОстатки);
			КонецЦикла; 
			НаборыКлиент.УдалитьСтрокиНабора(СтрокаТабличнойЧасти.НоменклатураНабора, СтрокаТабличнойЧасти.ХарактеристикаНабора, , Объект.Запасы, Объект.ДобавленныеНаборы);
		Иначе
			СтароеКоличество = ДобавленныеСтроки[0].Количество;
			ДобавленныеСтроки[0].Количество = СтароеКоличество-1;
			НаборыКлиентСервер.УдалитьЭкземплярНабора(СтрокаТабличнойЧасти.НоменклатураНабора, СтрокаТабличнойЧасти.ХарактеристикаНабора, , Объект.Запасы, , СтароеКоличество);
			НаборыКлиент.УдалитьЛишниеСтрокиПодчиненнойТЧ(Объект.Запасы, Объект.СерийныеНомера);
			СтрокиНабора = Объект.Запасы.НайтиСтроки(ДанныеНабора);
			Для каждого Стр Из СтрокиНабора Цикл
				РассчитатьСуммуВСтрокеТабличнойЧасти(Стр);
			КонецЦикла;
		КонецЕсли;
		
		Модифицированность = Истина;
		ВыполнитьДействияПослеУдаленияСтрокиЗапасов();
		
	КонецЕсли; 
	// Конец Наборы
	
КонецПроцедуры

// Процедура - обработчик события ПослеУдаления строки списка Запасы.
//
&НаКлиенте
Процедура ЗапасыПослеУдаления(Элемент)
	
	ВыполнитьДействияПослеУдаленияСтрокиЗапасов();
	
КонецПроцедуры // ТоварыПослеУдаления()

&НаКлиенте
Процедура ВыполнитьДействияПослеУдаленияСтрокиЗапасов()
	
	ПересчитатьДокументНаКлиенте();
	
	// АвтоматическиеСкидки.
	СброситьФлагСкидкиРассчитаныКлиент("УдалениеСтроки");
	
	Если РежимОстаткиИРезервы Тогда
		Если ЗначениеЗаполнено(НоменклатураУдаленнойСтроки) Тогда
			ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(,НоменклатураУдаленнойСтроки);
		Иначе
			ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Характеристика.
//
&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	ХарактеристикаПриИзмененииОбработчикСобытия("Запасы");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Характеристика.
//
&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении_МК(Элемент)
	
	ХарактеристикаПриИзмененииОбработчикСобытия("ЗапасыМК");
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзмененииОбработчикСобытия(ИмяТЧ)

	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура",	 СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика",	 СтрокаТабличнойЧасти.Характеристика);
		
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки",	 	Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента",	 	Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", 	Объект.СуммаВключаетНДС);
		
		СтруктураДанные.Вставить("СтавкаНДС", 			СтрокаТабличнойЧасти.СтавкаНДС);
		СтруктураДанные.Вставить("Цена",			 	СтрокаТабличнойЧасти.Цена);
		
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		
	КонецЕсли;
	
	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	Если СтруктураДанные.ЭтоНабор Тогда
		
		// Наборы
		ЗаменитьСтрокуЗапасовДаннымиНабора(ЭтотОбъект, СтрокаТабличнойЧасти, СтруктураДанные);
		
		// АвтоматическиеСкидки.
		СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
		// Конец АвтоматическиеСкидки
	
		#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		Элементы[ИмяТЧ].ЗакончитьРедактированиеСтроки(Истина);
		#КонецЕсли 
		
		ПересчитатьДокументНаКлиенте();
		
		ЗаполнитьПризнакиИспользованияХарактеристик();
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
		КонецЕсли
		
	Иначе
		
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
		
		РассчитатьСуммуВСтрокеТабличнойЧасти();
		
		СтрокаТабличнойЧасти.НоменклатураХарактеристикаИПартия = СокрЛП(""+СтрокаТабличнойЧасти.Номенклатура)+?(СтрокаТабличнойЧасти.Характеристика.Пустая(), "", ". "+СтрокаТабличнойЧасти.Характеристика)+
			?(СтрокаТабличнойЧасти.Партия.Пустая(), "", ". "+СтрокаТабличнойЧасти.Партия);
			
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияОстатковПоНоменклатуре(СтрокаТабличнойЧасти);
		КонецЕсли
			
	КонецЕсли;
	
КонецПроцедуры // ЗапасыХарактеристикаПриИзменении()

// Процедура - обработчик события ПриИзменении колонки Партия ТЧ Запасы.
//
&НаКлиенте
Процедура ДокументЧекККМЗапасыПартияПриИзменении(Элемент)
	ТЧПартияПриИзменении("Запасы");
КонецПроцедуры

// Процедура - обработчик события ПриИзменении колонки Партия ТЧ Запасы.
//
&НаКлиенте
Процедура ДокументЧекККМЗапасыПартияПриИзменении_МК(Элемент)
	ТЧПартияПриИзменении("ЗапасыМК");
КонецПроцедуры

&НаКлиенте
Процедура ТЧПартияПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		СтрокаТабличнойЧасти.НоменклатураХарактеристикаИПартия = "" + СтрокаТабличнойЧасти.Номенклатура + ?(СтрокаТабличнойЧасти.Характеристика.Пустая(), "", ". "+СтрокаТабличнойЧасти.Характеристика)+
			?(СтрокаТабличнойЧасти.Партия.Пустая(), "", ". "+СтрокаТабличнойЧасти.Партия);
	КонецЕсли;
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковПоНоменклатуре(СтрокаТабличнойЧасти)
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
	Если РежимОстаткиИРезервы Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
		ЗаполнитьЗначенияОстатковПоНоменклатуре(СтрокаТабличнойЧасти)
	КонецЕсли;
	
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении_МК(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.ЗапасыМК.ТекущиеДанные);
	
	Если РежимОстаткиИРезервы Тогда
		
		СтрокаТабличнойЧасти = Элементы.ЗапасыМК.ТекущиеДанные;
		
		Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
		ЗаполнитьЗначенияОстатковПоНоменклатуре(СтрокаТабличнойЧасти)
	КонецЕсли;
	
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТЧЕдиницаИзмеренияОбработкаВыбора("Запасы", ВыбранноеЗначение);
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора_МК(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТЧЕдиницаИзмеренияОбработкаВыбора("ЗапасыМК", ВыбранноеЗначение);
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

&НаКлиенте
Процедура ТЧЕдиницаИзмеренияОбработкаВыбора(ИмяТЧ, ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение
		ИЛИ СтрокаТабличнойЧасти.Цена = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	// Цена.
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
	КонецЕсли;
	
КонецПроцедуры // ЗапасыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события ПриИзменении поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияПриИзменении(Элемент)
	ТЧЕдиницаИзмеренияПриИзменении("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура ТЧЕдиницаИзмеренияПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти,, Ложь);
	УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, СтрокаТабличнойЧасти);
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковПоНоменклатуре(СтрокаТабличнойЧасти)
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ЕдиницаИзмерения.
//
&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияПриИзменении_МК(Элемент)
	ТЧЕдиницаИзмеренияПриИзменении("ЗапасыМК");
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	РассчитатьСуммуВСтрокеТабличнойЧасти();
КонецПроцедуры // ЗапасыЦенаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении_МК(Элемент)
	РассчитатьСуммуВСтрокеТабличнойЧасти(Элементы.ЗапасыМК.ТекущиеДанные);
КонецПроцедуры // ЗапасыЦенаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ПроцентСкидкиНаценки.
//
&НаКлиенте
Процедура ЗапасыПроцентСкидкиНаценкиПриИзменении(Элемент)
	ТЧПроцентСкидкиНаценкиПриИзменении("Запасы");
КонецПроцедуры // ЗапасыПроцентСкидкиНаценкиПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ПроцентСкидкиНаценки.
//
&НаКлиенте
Процедура ЗапасыПроцентСкидкиНаценкиПриИзменении_МК(Элемент)
	ТЧПроцентСкидкиНаценкиПриИзменении("ЗапасыМК");
КонецПроцедуры // ЗапасыПроцентСкидкиНаценкиПриИзменении()

&НаКлиенте
Процедура ТЧПроцентСкидкиНаценкиПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	ПараметрыРасчета = Новый Структура("РассчитатьСуммуСкидки, СброситьФлагСкидкиРассчитаны", Истина, Истина);
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
КонецПроцедуры // ЗапасыПроцентСкидкиНаценкиПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СуммаСкидкиНаценки.
//
&НаКлиенте
Процедура ЗапасыСуммаСкидкиНаценкиПриИзменении(Элемент)
	ТЧСуммаСкидкиНаценкиПриИзменении("Запасы");
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СуммаСкидкиНаценки.
//
&НаКлиенте
Процедура ЗапасыСуммаСкидкиНаценкиПриИзменении_МК(Элемент)
	ТЧСуммаСкидкиНаценкиПриИзменении("ЗапасыМК");
КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаСкидкиНаценкиПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	ПараметрыРасчета = Новый Структура("РассчитатьПроцентСкидки, СброситьФлагСкидкиРассчитаны", Истина, Истина);
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ПараметрыРасчета);	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	ТЧСуммаПриИзменении("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении_МК(Элемент)
	ТЧСуммаПриИзменении("ЗапасыМК");
КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	ПараметрыРасчета = Новый Структура("РассчитатьСуммуСкидки, СброситьФлагСкидкиРассчитаны, РассчитатьЦену", Истина, Истина, Истина);
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
КонецПроцедуры // ЗапасыСуммаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	ТЧСтавкаНДСПриИзменении("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении_МК(Элемент)
	ТЧСтавкаНДСПриИзменении("ЗапасыМК");
КонецПроцедуры

&НаКлиенте
Процедура ТЧСтавкаНДСПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	УправлениеНебольшойФирмойКлиент.РассчитатьСуммуНДСИВсего(СтрокаТабличнойЧасти, Новый Структура("СуммаВключаетНДС",Объект.СуммаВключаетНДС));
	
КонецПроцедуры // ЗапасыСтавкаНДСПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	ТЧСуммаНДСПриИзменении("Запасы");
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении_МК(Элемент)
	ТЧСуммаНДСПриИзменении("ЗапасыМК");
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

&НаКлиенте
Процедура ТЧСуммаНДСПриИзменении(ИмяТЧ)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	Если Не Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаДанныеПоСтроке Тогда
		ПоказатьСкрытьСдачуНаКлиенте(Ложь);
	КонецЕсли;
	
	НастроитьЗакладкиПродажиМК();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗакладкиПродажиМК()
	
	Если ЭтоМобильныйКилент Тогда
		Если Объект.Запасы.Количество() = 0
			И Элементы.ГруппаСтраницыПродажаМК.ТекущаяСтраница = Элементы.ГруппаТЧ Тогда
			Элементы.ГруппаСтраницыПродажаМК.ТекущаяСтраница = Элементы.ГруппаНетДанных;
		ИначеЕсли Объект.Запасы.Количество() > 0
			И Элементы.ГруппаСтраницыПродажаМК.ТекущаяСтраница = Элементы.ГруппаНетДанных Тогда
			Элементы.ГруппаСтраницыПродажаМК.ТекущаяСтраница = Элементы.ГруппаТЧ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.ЭтоНабор Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ХарактеристикиНабора(СтрокаТабличнойЧасти.Номенклатура, Текст);
	КонецЕсли;                              
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТЧХарактеристикаНачалоВыбора("Запасы", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаНачалоВыбора_МК(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТЧХарактеристикаНачалоВыбора("ЗапасыМК", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧХарактеристикаНачалоВыбора(ИмяТЧ, Элемент, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТЧ].ТекущиеДанные;
	Если СтрокаТабличнойЧасти.ЭтоНабор Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("НоменклатураНабора", СтрокаТабличнойЧасти.Номенклатура);
		СтруктураОткрытия.Вставить("РежимВыбора", Истина);
		СтруктураОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
		ОткрытьФорму("РегистрСведений.СоставНаборов.Форма.ФормаРедактированияСостава", СтруктураОткрытия, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;                              
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийДинамическихСписоков

// Процедура - обработчик события ПриАктивизацииСтроки элемента СписокЧековККМ.
//
&НаКлиенте
Процедура СписокЧековККМПриАктивизацииСтроки(Элемент)
	
	// Лучше период немного побольше сделать, иначе пользователь не будет успевать ввести номер в поле поиска.
	ПодключитьОбработчикОжидания("СписокЧековККМПриАктивизацииСтрокиОбработкаОжидания", 0.3, Истина);
	
КонецПроцедуры

// Процедура обновляет информацию о составе, гиперссылках и настраивает кнопки подвала на закладке Возврат.
//
&НаКлиенте
Процедура СписокЧековККМПриАктивизацииСтрокиОбработкаОжидания()
	
	ТекЧекККМ = Элементы.СписокЧековККМ.ТекущаяСтрока;
	Если ТекЧекККМ <> Неопределено Тогда
		ЗаполнитьСоставЧекаИСсылкиНаДокументыНаСервере(ТекЧекККМ);
	Иначе
		СоставЧека = "";
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("СписокЧековККМПриАктивизацииСтрокиОбработкаОжидания");
	
КонецПроцедуры

// Процедура заполняет информацию о составе ТЧ текущего чека ККМ в элементе СписокЧековККМ.
//
&НаСервере
Процедура ЗаполнитьСоставЧекаИСсылкиНаДокументыНаСервере(ЧекККМ)
	
	// Заполним состав чека.
	ЭтоПерваяСтрока = Истина;
	Для Каждого ТекСтрока Из ЧекККМ.Запасы Цикл
		Если ЭтоПерваяСтрока Тогда
			ЭтоПерваяСтрока = Ложь;
			СоставЧека = ""+ТекСтрока.Номенклатура+". "+Символы.ПС+Символы.Таб+ПолучитьОписаниеДляСтрокиТЧЗапасыНаСервере(ТекСтрока);
		Иначе
			СоставЧека = СоставЧека+Символы.ПС+ТекСтрока.Номенклатура+". "+Символы.ПС+Символы.Таб+ПолучитьОписаниеДляСтрокиТЧЗапасыНаСервере(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним ссылки на документы.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриходнаяНакладная.Ссылка,
	|	ПриходнаяНакладная.Номер,
	|	ПриходнаяНакладная.Дата
	|ПОМЕСТИТЬ ПриходнаяНакладная
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Проведен
	|	И ПриходнаяНакладная.ЧекККМ = &ЧекККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриходнаяНакладная.Ссылка,
	|	ПриходнаяНакладная.Номер,
	|	ПриходнаяНакладная.Дата
	|ИЗ
	|	ПриходнаяНакладная КАК ПриходнаяНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходИзКассы.Ссылка,
	|	РасходИзКассы.Дата,
	|	РасходИзКассы.Номер
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходИзКассы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриходнаяНакладная КАК ПриходнаяНакладная
	|		ПО РасходИзКассы.ДокументОснование = ПриходнаяНакладная.Ссылка
	|ГДЕ
	|	РасходИзКассы.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМВозврат.Ссылка,
	|	ЧекККМВозврат.Номер,
	|	ЧекККМВозврат.Дата
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.Проведен
	|	И ЧекККМВозврат.ЧекККМ = &ЧекККМ";
	Запрос.УстановитьПараметр("ЧекККМ", ЧекККМ);
	
	МРезультатов = Запрос.ВыполнитьПакет();
	
	ЕстьПН  = Не МРезультатов[1].Пустой();
	ЕстьРКО = Не МРезультатов[2].Пустой();
	ЕстьЧек = Не МРезультатов[3].Пустой();
	
	#Область ПН_РКО
	Если ЕстьПН Тогда // Приходная накладная
		
		// Включение кнопок
		Элементы.ДекорацияПриходнаяНакладная.Видимость				= Истина;
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.Видимость		= Истина;
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.Видимость	= Истина;
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.ЦветТекста		= WebЦвета.Серый;
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.ЦветТекста	= Новый Цвет;
		
		// Заполнение ссылок и декораций
		Выборка = МРезультатов[1].Выбрать();
		Выборка.Следующий();
		ПриходнаяНакладнаяНаВозврат = Выборка.Ссылка;
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
		Элементы.ДекорацияПриходнаяНакладная.Заголовок = "Прих. нак-я №"+СокрЛП(НомерДокумента)+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Пока Выборка.Следующий() Цикл
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
			Элементы.ДекорацияПриходнаяНакладная.Заголовок = Элементы.ДекорацияПриходнаяНакладная.Заголовок + "; "+" №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		КонецЦикла;
		
		// Выключение лишних элементов
		Элементы.КоманднаяПанельВозврата.Видимость	= Ложь;
		Элементы.ДекорацияЧекККМНаВозврат.Видимость	= Ложь;
		Элементы.СоздатьЧекККМНаВозврат.Видимость	= Ложь;
		ЧекККМНаВозврат								= Документы.ЧекККМВозврат.ПустаяСсылка();
		Элементы.ДекорацияРКО.Видимость				= Ложь;
		РКО											= Документы.РасходИзКассы.ПустаяСсылка();
		
	КонецЕсли;
	
	Если ЕстьРКО Тогда // Расход из кассы
		
		// Включение кнопок
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.ЦветТекста	= WebЦвета.Серый;
		Элементы.ДекорацияРКО.Видимость								= Истина;
		
		// Заполнение ссылок и декораций
		Выборка = МРезультатов[2].Выбрать();
		Выборка.Следующий();
		РКО = Выборка.Ссылка;
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
		Элементы.ДекорацияРКО.Заголовок = "РКО №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Пока Выборка.Следующий() Цикл
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
			Элементы.ДекорацияРКО.Заголовок = Элементы.ДекорацияРКО.Заголовок + "; "+" №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		КонецЦикла;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Чек
	Если ЕстьЧек Тогда // Чек ККМ
		
		// Включение кнопок
		Элементы.ДекорацияЧекККМНаВозврат.Видимость	= Истина;
		Элементы.СоздатьЧекККМНаВозврат.Видимость	= Истина;
		Элементы.СоздатьЧекККМНаВозврат.ЦветТекста	= WebЦвета.Серый;
		
		// Заполнение ссылок и декораций
		Выборка = МРезультатов[3].Выбрать();
		Выборка.Следующий();
		ЧекККМНаВозврат = Выборка.Ссылка;
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
		Элементы.ДекорацияЧекККМНаВозврат.Заголовок = "Чек ККМ на возврат №"+СокрЛП(НомерДокумента)+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Пока Выборка.Следующий() Цикл
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
			Элементы.ДекорацияЧекККМНаВозврат.Заголовок = Элементы.ДекорацияЧекККМНаВозврат.Заголовок + "; "+" №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		КонецЦикла;
		
		// Выключение лишних элементов
		Элементы.КоманднаяПанельВозврата.Видимость					= Ложь;
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.Видимость		= Ложь;
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.Видимость	= Ложь;
		Элементы.ДекорацияПриходнаяНакладная.Видимость				= Ложь;
		Элементы.ДекорацияРКО.Видимость								= Ложь;
		ПриходнаяНакладнаяНаВозврат									= Документы.ПриходнаяНакладная.ПустаяСсылка();
		РКО															= Документы.РасходИзКассы.ПустаяСсылка();
		
	КонецЕсли;
	#КонецОбласти
	
	#Область НетДокументов	
	Если Не (ЕстьПН ИЛИ ЕстьРКО ИЛИ ЕстьЧек) Тогда
		
		ПриходнаяНакладнаяНаВозврат	= Документы.ПриходнаяНакладная.ПустаяСсылка();
		РКО							= Документы.РасходИзКассы.ПустаяСсылка();
		ЧекККМНаВозврат				= Документы.ЧекККМВозврат.ПустаяСсылка();
		
		Элементы.ДекорацияПриходнаяНакладная.Видимость	= Ложь;
		Элементы.ДекорацияРКО.Видимость					= Ложь;
		Элементы.ДекорацияЧекККМНаВозврат.Видимость		= Истина;
		Элементы.ДекорацияЧекККМНаВозврат.Заголовок		= "";
		
		Элементы.СоздатьПриходнуюНакладнуюНаВозврат.Видимость		= Ложь;
		Элементы.СоздатьРКОНаОснованииПриходнойНакладной.Видимость	= Ложь;
		Элементы.СоздатьЧекККМНаВозврат.Видимость					= Ложь;
		Элементы.КоманднаяПанельВозврата.Видимость					= Ложь;
		
		// Получим вариант оформления возврата
		ВариантВозврата = ПолучитьВариантВозврата();
		
		Если ЧекККМ.КассоваяСмена.КассоваяСмена.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта") Тогда
			
			Элементы.СоздатьЧекККМНаВозврат.Видимость	= Истина;
			Элементы.СоздатьЧекККМНаВозврат.ЦветТекста	= Новый Цвет;
			
		ИначеЕсли ВариантВозврата = ПредопределенноеЗначение("Перечисление.ВариантыВозвратаПоЗакрытойСмене.ПН") Тогда
			
			Элементы.СоздатьПриходнуюНакладнуюНаВозврат.Видимость		= Истина;
			Элементы.СоздатьРКОНаОснованииПриходнойНакладной.Видимость	= Истина;
			
			Элементы.СоздатьПриходнуюНакладнуюНаВозврат.ЦветТекста		= Новый Цвет;
			Элементы.СоздатьРКОНаОснованииПриходнойНакладной.ЦветТекста	= WebЦвета.Серый;
			
		ИначеЕсли ВариантВозврата = ПредопределенноеЗначение("Перечисление.ВариантыВозвратаПоЗакрытойСмене.Чек") Тогда
			
			Элементы.СоздатьЧекККМНаВозврат.Видимость	= Истина;
			Элементы.СоздатьЧекККМНаВозврат.ЦветТекста	= Новый Цвет;
			
		ИначеЕсли ВариантВозврата = ПредопределенноеЗначение("Перечисление.ВариантыВозвратаПоЗакрытойСмене.ПН_Чек") Тогда
			
			Элементы.КоманднаяПанельВозврата.Видимость = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

// Процедура заполняет информацию о составе ТЧ текущего заказа покупателя в элементе СписокЗаказов.
//
&НаСервере
Процедура ЗаполнитьСоставЗаказаИСсылкиНаДокументыНаСервере(Заказ)
	
	ЗаказОсновнойВариант = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ОсновнойВариантКП");
	
	// Заполним состав чека.
	ЭтоПерваяСтрока = Истина;
	Для Каждого ТекСтрока Из Заказ.Запасы Цикл
		
		Если ТекСтрока.ЭтоРазделитель ИЛИ ТекСтрока.НомерВариантаКП <> ЗаказОсновнойВариант Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоПерваяСтрока Тогда
			ЭтоПерваяСтрока = Ложь;
			СоставЗаказа = ""+ТекСтрока.Номенклатура+". "+Символы.ПС+Символы.Таб+ПолучитьОписаниеДляСтрокиТЧЗапасыНаСервере(ТекСтрока);
		Иначе
			СоставЗаказа = СоставЗаказа+Символы.ПС+ТекСтрока.Номенклатура+". "+Символы.ПС+Символы.Таб+ПолучитьОписаниеДляСтрокиТЧЗапасыНаСервере(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним ссылки на документы.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЧекККМЗапасы.Ссылка КАК Ссылка,
		|	ЧекККМЗапасы.Ссылка.Номер КАК Номер,
		|	ЧекККМЗапасы.Ссылка.Дата КАК Дата,
		|	НЕ ЧекККМЗапасы.Ссылка.ОперацияСДенежнымиСредствами КАК ПередачаТоваров,
		|	1 КАК Порядок
		|ИЗ
		|	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
		|ГДЕ
		|	ЧекККМЗапасы.Заказ = &Заказ
		|	И ЧекККМЗапасы.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка,
		|	ПриходнаяНакладнаяЗапасы.Ссылка.Номер,
		|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата,
		|	ИСТИНА,
		|	2
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Заказ = &Заказ
		|	И ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
		|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = &ВидОперацииВозратОтПокупателя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЧекККМВозвратЗапасы.Ссылка,
		|	ЧекККМВозвратЗапасы.Ссылка.Номер,
		|	ЧекККМВозвратЗапасы.Ссылка.Дата,
		|	НЕ ЧекККМВозвратЗапасы.Ссылка.ОперацияСДенежнымиСредствами,
		|	3
		|ИЗ
		|	Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозвратЗапасы
		|ГДЕ
		|	ЧекККМВозвратЗапасы.Заказ = &Заказ
		|	И ЧекККМВозвратЗапасы.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ВидОперацииВозратОтПокупателя", Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя);
	
	Результат = Запрос.Выполнить();
	
	// Определим видимость кнопок и гиперссылок.
	Выборка = Результат.Выбрать();
	Если НЕ Результат.Пустой() Тогда
		
		Элементы.ДекорацияЧекККМ.Заголовок = "";
		
		ЕстьПередачаТоваров = Ложь;
		
		Пока Выборка.Следующий() Цикл
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
			Если Выборка.Порядок = 1 Тогда
				ЧекККМ = Выборка.Ссылка;
				
				ПредставлениеДокумента = "Чек ККМ №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
			ИначеЕсли Выборка.Порядок = 2 Тогда
				ПредставлениеДокумента = "Прих. накл. (возврат) №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
			ИначеЕсли Выборка.Порядок = 3 Тогда
				ПредставлениеДокумента = "Чек ККМ на возврат №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			Если Элементы.ДекорацияЧекККМ.Заголовок <> "" Тогда
				Элементы.ДекорацияЧекККМ.Заголовок = Элементы.ДекорацияЧекККМ.Заголовок + "; ";
			КонецЕсли;
			Элементы.ДекорацияЧекККМ.Заголовок = Элементы.ДекорацияЧекККМ.Заголовок + ПредставлениеДокумента;
			
			ЕстьПередачаТоваров = ЕстьПередачаТоваров ИЛИ Выборка.ПередачаТоваров;
			
		КонецЦикла;
		
		Если ЕстьПередачаТоваров Тогда
			Элементы.СоздатьЧекККМНаОснованииЗаказа.ЦветТекста = WebЦвета.Серый;
		Иначе
			Элементы.СоздатьЧекККМНаОснованииЗаказа.ЦветТекста = Новый Цвет;
		КонецЕсли;
		
	Иначе
		ЧекККМ = Документы.ЧекККМ.ПустаяСсылка();
		Элементы.ДекорацияЧекККМ.Заголовок = "";
		Элементы.СоздатьЧекККМНаОснованииЗаказа.ЦветТекста = Новый Цвет;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
		Элементы.ДекорацияЧекККМ.Заголовок = Элементы.ДекорацияЧекККМ.Заголовок + "; "+" №"+НомерДокумента+" от "+Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	КонецЦикла;
	
	Элементы.СоздатьЧекККМНаОснованииЗаказа.Видимость = Истина;
	
	Элементы.ДекорацияЧекККМ.Видимость = Истина;
	
КонецПроцедуры

// Процедура - обработчик события ВыборЗначения элемента Список.
//
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыЧекККМ");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ЧекККМ.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Ссылка));
		ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыЧекККМВозврат");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ЧекККМВозврат.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Ссылка));
		ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыОтчетОРозничныхПродажах");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ОтчетОРозничныхПродажах.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Ссылка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

// Процедура - обработчик команды ЗагрузитьДанныеИзТСД.
//
&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтаФорма);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()

// Процедура - обработчик события Действие команды ПолучитьВес
//
&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НеобходимостьВводаАкцизнойМарки
			ИЛИ ТекущиеДанные.НеобходимостьВводаКодаМаркировки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Действие недоступно для маркируемой продукции!";
			Сообщение.Поле = "Объект.Запасы";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		// Наборы
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураНабора) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Действие недоступно для наборов!";
			Сообщение.Поле = "Объект.Запасы";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		// Конец Наборы
	КонецЕсли;
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтаФорма, "Запасы");
	
КонецПроцедуры // ПолучитьВес()

// Процедура - обработчик команды ПолучитьВес формы. Выполняется после получения веса от электронных весов.
//
&НаКлиенте
Процедура ПолучитьВесЗавершение(Параметры) Экспорт
	
	СтрокаТабличнойЧасти = Параметры;
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ЗапасыПриОкончанииРедактирования(Элементы.Запасы, Ложь, Ложь);
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента ЦеныИВалюта формы.
//
&НаКлиенте
Процедура РедактироватьЦеныИВалюту(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	
КонецПроцедуры // РедактироватьЦеныИВалюту()

// Процедура - обработчик команды УвиличитьКоличество формы.
//
&НаКлиенте
Процедура УвеличитьКоличество(Команда)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НеобходимостьВводаАкцизнойМарки
			ИЛИ ТекущиеДанные.НеобходимостьВводаКодаМаркировки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Действие недоступно для маркируемой продукции!";
			Сообщение.Поле = "Объект.Запасы";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		// Наборы
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураНабора) Тогда
			РедактироватьСоставНабора(ТекущиеДанные);
			Возврат;
		КонецЕсли;
		// Конец Наборы
		ТекущиеДанные.Количество = ТекущиеДанные.Количество + 1;
		РассчитатьСуммуВСтрокеТабличнойЧасти();
		ПересчитатьДокументНаКлиенте();
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияОстатковПоНоменклатуре(ТекущиеДанные)
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка!";
		Сообщение.Поле = "Объект.Запасы";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды УменьшитьКоличество формы.
//
&НаКлиенте
Процедура УменьшитьКоличество(Команда)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НеобходимостьВводаАкцизнойМарки
			ИЛИ ТекущиеДанные.НеобходимостьВводаКодаМаркировки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Действие недоступно для маркируемой продукции!";
			Сообщение.Поле = "Объект.Запасы";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		// Наборы
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураНабора) Тогда
			РедактироватьСоставНабора(ТекущиеДанные);
			Возврат;
		КонецЕсли;
		// Конец Наборы
		ТекущиеДанные.Количество = ТекущиеДанные.Количество - 1;
		РассчитатьСуммуВСтрокеТабличнойЧасти();
		ПересчитатьДокументНаКлиенте();
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияОстатковПоНоменклатуре(ТекущиеДанные)
		КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка!";
		Сообщение.Поле = "Объект.Запасы";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды ИзменитьКоличествоСПомощьюКалькулятора формы.
//
&НаКлиенте
Процедура ИзменитьКоличествоСПомощьюКалькулятора(Команда)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НеобходимостьВводаАкцизнойМарки
			ИЛИ ТекущиеДанные.НеобходимостьВводаКодаМаркировки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Действие недоступно для маркируемой продукции!";
			Сообщение.Поле = "Объект.Запасы";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		// Наборы
		Если ЗначениеЗаполнено(ТекущиеДанные.НоменклатураНабора) Тогда
			РедактироватьСоставНабора(ТекущиеДанные);
			Возврат;
		КонецЕсли;
		// Конец Наборы
		
		Оповещение = Новый ОписаниеОповещения("ИзменитьКоличествоСПомощьюКалькулятораЗавершение", ЭтаФорма);
		
		СтруктураПараметров = Новый Структура("Количество, НоменклатураХарактеристикаИПартия, Цена, Сумма, ПроцентСкидкиНаценки, ПроцентАвтоматическойСкидки", 
			ТекущиеДанные.Количество, 
			ТекущиеДанные.НоменклатураХарактеристикаИПартия,
			ТекущиеДанные.Цена,
			ТекущиеДанные.Сумма,
			ТекущиеДанные.ПроцентСкидкиНаценки,
			ТекущиеДанные.ПроцентАвтоматическойСкидки);
			
		ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаВводаКоличества", СтруктураПараметров,,,,,Оповещение);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка!";
		Сообщение.Поле = "Объект.Запасы";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды ИзменитьКоличествоСПомощьюКалькулятораЗавершение после закрытия формы изменения количества.
//
&НаКлиенте
Процедура ИзменитьКоличествоСПомощьюКалькулятораЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.Количество = Результат.Количество;
			РассчитатьСуммуВСтрокеТабличнойЧасти();
			ПересчитатьДокументНаКлиенте();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды ОчиститьТЧЗапасы формы.
//
&НаКлиенте
Процедура ОчиститьТЧЗапасы(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТЧЗапасыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Очистить табличную часть?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	
КонецПроцедуры

// Процедура - обработчик команды ОчиститьТЧЗапасыЗавершение после подтверждения удаления всех строк ТЧ запасы в форме вопроса.
//
&НаКлиенте
Процедура ОчиститьТЧЗапасыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Запасы.Очистить();
		Объект.СуммаДокумента = Объект.Запасы.Итог("Всего");
		ОбновитьНадписьКнопкиКОплатеНаКлиенте();
		ВыполнитьДействияПослеУдаленияСтрокиЗапасов();
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды ОткрытьКарточкуНоменклатуры формы.
//
&НаКлиенте
Процедура ОткрытьКарточкуНоменклатуры(Команда)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		МОграничениеТипа = Новый Массив;
		МОграничениеТипа.Добавить(ТипНоменклатурыЗапас);
		МОграничениеТипа.Добавить(ТипНоменклатурыУслуга);
		
		ДопПараметры = Новый Структура("ОграничениеТипа", МОграничениеТипа);
		ЗначенияЗаполнения = Новый Структура("ТипНоменклатуры", МОграничениеТипа);
		
		ПараметрыНовойПозицииНоменклатуры = Новый Структура("Ключ, ДополнительныеПараметры, ЗначенияЗаполнения", ТекущиеДанные.Номенклатура, ДопПараметры, ЗначенияЗаполнения);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыНовойПозицииНоменклатуры, ЭтотОбъект);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка!";
		Сообщение.Поле = "Объект.Запасы";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды СписокСоздатьЧекККМНаВозврат формы.
//
&НаКлиенте
Процедура СписокСоздатьЧекККМНаВозврат(Команда)
	
	ТекстСообщения = "";
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыЧекККМВозврат");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ЧекККМВозврат.ФормаОбъекта", Новый Структура("Основание", ТекущиеДанные.Ссылка));
		Иначе
			ТекстСообщения = "Чек ККК на возврат нельзя вводить на основании документов вида """+ТипЗнч(ТекущиеДанные.Ссылка)+""".";
		КонецЕсли;
	Иначе
		ТекстСообщения = "Не выбран чек ККМ!";
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Список";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды СписокСоздатьПриходнуюНакладнуюНаВозврат формы.
//
&НаКлиенте
Процедура СписокСоздатьПриходнуюНакладнуюНаВозврат(Команда)
	
	ТекстСообщения = "";
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыПриходнаяНакладнаяВозврат");
			// СтандартныеПодсистемы.ОценкаПроизводительности
			ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", Новый Структура("Основание, РМК", ТекущиеДанные.Ссылка, Истина), ЭтотОбъект, УникальныйИдентификатор);
		Иначе
			ТекстСообщения = "Чек ККК на возврат нельзя вводить на основании документов вида """+ТипЗнч(ТекущиеДанные.Ссылка)+""".";
		КонецЕсли;
	Иначе
		ТекстСообщения = "Не выбран чек ККМ!";
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Список";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область АвтоматическиеСкидки

// Процедура - обработчик команды РассчитатьСкидкиНаценки формы.
//
&НаКлиенте
Процедура РассчитатьСкидкиНаценки(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Если Объект.СкидкиНаценки.Количество() > 0 Тогда
			Объект.СкидкиНаценки.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СуммаДоРасчетаАвтоСкидок = Объект.Запасы.Итог("Всего");
	РассчитатьСкидкиНаценкиКлиент();
	
	Если СуммаДоРасчетаАвтоСкидок <> Объект.Запасы.Итог("Всего") Тогда
		СообщениеСтрока = НСтр("ru = 'Автоматические скидки (наценки) рассчитаны'");
		Элементы.СтраницыДанныеПоСтрокеИСдача.ТекущаяСтраница = Элементы.СтраницаСообщений;
	КонецЕсли;
	
КонецПроцедуры

// Процедура рассчитывает скидки по документу.
//
&НаКлиенте
Процедура РассчитатьСкидкиНаценкиКлиент()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
		РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Иначе
		РабочееМесто = ""
	КонецЕсли;
	
	СтруктураПараметры.Вставить("РабочееМесто", РабочееМесто);
	
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

// Функция сравнивает данные расчёта скидок на текущий момент времени с данными последнего расчёт скидок в документе.
// Если скидки изменились, то функция возвращает значение Истина.
//
&НаСервере
Функция СкидкиИзменились()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	
	ПримененныеСкидки = СкидкиНаценкиСерверПереопределяемый.Рассчитать(Объект, СтруктураПараметры);
	
	СкидкиИзменились = Ложь;
	
	КоличествоСтрок = ПримененныеСкидки.ТаблицаСкидкиНаценки.Количество();
	Если КоличествоСтрок <> Объект.СкидкиНаценки.Количество() Тогда
		СкидкиИзменились = Истина;
	Иначе
		
		Если Объект.Запасы.Итог("СуммаАвтоматическойСкидки") <> Объект.СкидкиНаценки.Итог("Сумма") Тогда
			СкидкиИзменились = Истина;
		КонецЕсли;
		
		Если Не СкидкиИзменились Тогда
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				Если    Объект.СкидкиНаценки[НомерСтроки-1].Сумма <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].Сумма
					ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].КлючСвязи <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].КлючСвязи
					ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].СкидкаНаценка <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].СкидкаНаценка Тогда
					СкидкиИзменились = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СкидкиИзменились Тогда
		АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат СкидкиИзменились;
	
КонецФункции

// Процедура рассчитывает скидки по документу.
//
&НаСервере
Процедура РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры)
	РозничныеПродажиСервер.РассчитатьСкидкиНаценкиНаСервере(ЭтотОбъект, СтруктураПараметры);
КонецПроцедуры

// Процедура открывает общую форму для анализа информации о скидках по текущей строке.
//
&НаКлиенте
Процедура ОткрытьИнформациюОСкидкахКлиент()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	
	СтруктураПараметры.Вставить("ТолькоСообщенияПослеОформления",   Ложь);
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
		РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Иначе
		РабочееМесто = ""
	КонецЕсли;
	
	СтруктураПараметры.Вставить("РабочееМесто", РабочееМесто);
	
	Если НЕ Объект.СкидкиРассчитаны Тогда
		ТекстВопроса = НСтр("ru='Скидки (наценки) не рассчитаны, рассчитать?'");
		
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("СтруктураПараметры", СтруктураПараметры);
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросРассчитатьСкидки", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		РассчитатьСкидкиЗавершитьОбработкуВопроса(СтруктураПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Завершение немодального открытия окна "ПоказатьВопрос()". Процедура открывает общую форму для анализа информации о скидках по текущей строке.
//
&НаКлиенте
Процедура ОповещениеВопросРассчитатьСкидки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	СтруктураПараметры = ДополнительныеПараметры.СтруктураПараметры;
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
	РассчитатьСкидкиЗавершитьОбработкуВопроса(СтруктураПараметры);
	
КонецПроцедуры

// Процедура открывает общую форму для анализа информации о скидках по текущей строке после расчета автоматических скидок (если это было необходимо).
//
&НаКлиенте
Процедура РассчитатьСкидкиЗавершитьОбработкуВопроса(СтруктураПараметры)
	
	Если НЕ ЗначениеЗаполнено(АдресПримененныхСкидокВоВременномХранилище) Тогда
		РассчитатьСкидкиНаценкиКлиент();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	СкидкиНаценкиКлиент.ОткрытьФормуПримененныеСкидки(ТекущиеДанные, Объект, ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события Выбор табличной части Запасы.
//
&НаКлиенте
Процедура ЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Наборы
	СтрокаТабличнойЧасти = Объект.Запасы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если НЕ ТолькоПросмотр И ЗначениеЗаполнено(СтрокаТабличнойЧасти.НоменклатураНабора) И  
		(Элемент.ТекущийЭлемент = Элементы.ЗапасыНоменклатура ИЛИ
		Элемент.ТекущийЭлемент = Элементы.ЗапасыХарактеристика ИЛИ
		Элемент.ТекущийЭлемент = Элементы.ЗапасыКартинкаНабора ИЛИ
		Элемент.ТекущийЭлемент = Элементы.ЗапасыКоличество ИЛИ
		Элемент.ТекущийЭлемент = Элементы.ЗапасыЕдиницаИзмерения) Тогда 
		
		СтандартнаяОбработка = Ложь;
		РедактироватьСоставНабора(СтрокаТабличнойЧасти);
		
	КонецЕсли;
	// Конец Наборы
	
	// Подарочные сертификаты
	Если Элемент.ТекущийЭлемент = Элементы.ЗапасыЦена И Элемент.ТекущийЭлемент.ТолькоПросмотр Тогда
		
		Реквизиты = УправлениеНебольшойФирмойСервер.ЗначенияРеквизитовОбъекта(
			Объект.Запасы.НайтиПоИдентификатору(ВыбраннаяСтрока).Номенклатура, "ТипНоменклатуры, Произвольныйноминал");
			
		Если Реквизиты.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат")
			И Реквизиты.ПроизвольныйНоминал Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("УказатьЦенуСертификата",ЭтотОбъект, Объект.Запасы.НайтиПоИдентификатору(ВыбраннаяСтрока));
			ПоказатьВводЧисла(ОписаниеОповещения, Объект.Запасы.НайтиПоИдентификатору(ВыбраннаяСтрока).Цена, "Введите стоимость сертификата", 15, 2);
			
		КонецЕсли;
			
	КонецЕсли;
	// Конец Подарочные сертификаты
	
	Если (Элемент.ТекущийЭлемент = Элементы.ЗапасыПроцентАвтоматическойСкидки ИЛИ Элемент.ТекущийЭлемент = Элементы.ЗапасыСуммаАвтоматическойСкидки)
		И НЕ ТолькоПросмотр Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьИнформациюОСкидкахКлиент();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		ПолеДляПроверки = ?(ЭтоМобильныйКилент, Элементы.ЗапасыМККПоступлению, Элементы.ЗапасыКПоступлению);
		
		Если Элемент.ТекущийЭлемент = ПолеДляПроверки Тогда
			
			ЗначениеПоля = СтрокаТабличнойЧасти.КПоступлению;
			
			Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
				
				СтруткураПараметров = Новый Структура("ОрганизацияОбъекта, Номенклатура, Характеристика, Партия, Склад, ЕдиницаИзмерения, ЗаказПокупателя, НомерВариантаКП");
				
				СтруткураПараметров.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
				СтруткураПараметров.Характеристика = СтрокаТабличнойЧасти.Характеристика;
				СтруткураПараметров.Партия = СтрокаТабличнойЧасти.Партия;
				СтруткураПараметров.Склад = Объект.СтруктурнаяЕдиница;
				СтруткураПараметров.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
				СтруткураПараметров.ЗаказПокупателя =Объект.Заказ;
				СтруткураПараметров.ОрганизацияОбъекта = Объект.Организация;
				
				ПараметрыОповещения = Новый Структура("ВыбранноеПоле", "ЗапасыПоступления");
				Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзВыпадающегоСпискаТабличнойЧасти", ЭтаФорма, ПараметрыОповещения);
				
				СписокДокументов = СписокДокументовПоЗаказу("ЗапасыПоступления", СтруткураПараметров);
				ПоказатьВыборИзМеню(Оповещение, СписокДокументов, Элемент.ТекущийЭлемент);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Наборы
	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
	Если Копирование И ЗначениеЗаполнено(СтрокаТабличнойЧасти.НоменклатураНабора) Тогда
		// Состав набора не копируется
		Отказ = Истина;
	КонецЕсли; 
	// Конец Наборы
	
	Если Копирование и РежимОстаткиИРезервы Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		
		Если Элемент.ТекущиеДанные.ПроцентАвтоматическойСкидки <> 0 ИЛИ Элемент.ТекущиеДанные.СуммаАвтоматическойСкидки <> 0 Тогда
			НоваяСтрока.ПроцентАвтоматическойСкидки = 0;
			НоваяСтрока.СуммаАвтоматическойСкидки = 0;
			РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
		ИначеЕсли ИспользоватьАвтоматическиеСкидки Тогда
			// Автоматические скидки стали неактуальны.
			СброситьФлагСкидкиРассчитаныКлиент("ПриНачалеРедактирования");
		КонецЕсли;
		
		НоваяСтрока.КлючСвязи = 0;
		НоваяСтрока.СерийныеНомера = "";
		НоваяСтрока.КодМаркировки = "";
		
		// МОТП
		НоваяСтрока.КоличествоАкцизныхМарок = 0;
		АкцизныеМаркиКлиентСервер.ЗаполнитьИндексАкцизнойМарки(НоваяСтрока);
		// Конец МОТП
		
		НоваяСтрока.Резерв = 0;
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Организация", Компания);
		СтруктураДанные.Вставить("Номенклатура", 	НоваяСтрока.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", 	НоваяСтрока.Характеристика);
		СтруктураДанные.Вставить("Партия", 	НоваяСтрока.Партия);
		СтруктураДанные.Вставить("ИспользоватьХарактеристики", НоваяСтрока.ИспользоватьХарактеристики);
		СтруктураДанные.Вставить("ИспользоватьПартии", НоваяСтрока.ИспользоватьПартии);
		
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(СтруктураДанные);
		
		ПересчитатьДокументНаКлиенте();
		
		// МОТП
		ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
		// Конец МОТП
		
	КонецЕсли
	
КонецПроцедуры

// Функция сбрасывает флаг "СкидкиРассчитаны", если это необходимо, и возвращает Истина, если требуется пересчёт скидок.
//
&НаСервере
Функция СброситьФлагСкидкиРассчитаныСервер(Действие, КолонокаТЧ = "")
	
	ТребуетсяПересчет = Ложь;
	Если ИспользоватьАвтоматическиеСкидки И Объект.Запасы.Количество() > 0 И (Объект.СкидкиРассчитаны ИЛИ УстановленСерыйЦвет) Тогда
		ТребуетсяПересчет = СброситьФлагСкидкиРассчитаны(Действие, КолонокаТЧ);
	КонецЕсли;
	Возврат ТребуетсяПересчет;
	
КонецФункции

// Функция сбрасывает флаг "СкидкиРассчитаны", если это необходимо, и возвращает Истина, если требуется пересчёт скидок.
//
&НаКлиенте
Функция СброситьФлагСкидкиРассчитаныКлиент(Действие, КолонокаТЧ = "")
	
	ТребуетсяПересчет = Ложь;
	Если ИспользоватьАвтоматическиеСкидки И Объект.Запасы.Количество() > 0 И (Объект.СкидкиРассчитаны ИЛИ УстановленСерыйЦвет) Тогда
		ТребуетсяПересчет = СброситьФлагСкидкиРассчитаны(Действие, КолонокаТЧ);
	КонецЕсли;
	Возврат ТребуетсяПересчет;
	
КонецФункции

// Функция сбрасывает флаг СкидкиРассчитаны, если это необходимо, и возвращает Истина, если требуется пересчёт скидок.
//
&НаСервере
Функция СброситьФлагСкидкиРассчитаны(Действие, КолонокаТЧ = "")
	
	Возврат СкидкиНаценкиСервер.СброситьФлагСкидкиРассчитаны(ЭтотОбъект, Действие, КолонокаТЧ);
	
КонецФункции

// Процедура выполняет действия необходимые при создании формы на сервере.
//
&НаСервере
Процедура АвтоматическиеСкидкиПриСозданииНаСервере()
	
	УстановленСерыйЦвет = Ложь;
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	Если ИспользоватьАвтоматическиеСкидки Тогда
		Если Объект.Запасы.Количество() = 0 Тогда
			Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.ОбновитьСерый;
			УстановленСерыйЦвет = Истина;
		ИначеЕсли НЕ Объект.СкидкиРассчитаны Тогда
			Объект.СкидкиРассчитаны = Ложь;
			Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.ОбновитьКрасный;
		Иначе
			Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает форму отчёта "Применённые скидки" для текущего документа в элементе "Список".
//
&НаКлиенте
Процедура ПримененныеСкидки(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = "Не выбран документ.
		|Переход к ""Примененные скидки"" возможен только после выбора документа в списке.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Список";
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		ПараметрыФормы = Новый Структура("ДокументСсылка", ТекущиеДанные.Ссылка);
		ОткрытьФорму("Отчет.ПримененныеСкидкиВДокументе.Форма.ФормаОтчета", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	Иначе
		ТекстСообщения = "Выберите чек ККМ или чек ККМ на возврат";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Список";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьБонусыНаКлиенте()
	
	Если Не ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РеквизитыБП = РаботаСБонусами.РеквизитыБонуснойПрограммы(Объект.ДисконтнаяКарта);
	
	Если РеквизитыБП.БонуснаяПрограмма.Пустая() Тогда
		Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
			Объект.БонусныеБаллыКНачислению.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если РеквизитыБП.НеНачислятьПриОплатеБонусами Тогда
		Если РаботаСБонусами.ЕстьОплатаБонусами(Объект.БезналичнаяОплата) Тогда
			Если Не Объект.БонусныеБаллыКНачислению.Количество() = 0 Тогда
				Объект.БонусныеБаллыКНачислению.Очистить();
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("БонуснаяПрограмма", РеквизитыБП.БонуснаяПрограмма);
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
		РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Иначе
		РабочееМесто = ""
	КонецЕсли;
	
	СтруктураПараметры.Вставить("РабочееМесто", РабочееМесто);
	
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ДисконтныеКарты

// Процедура - обработчик команды СчитатьДисконтнуюКарту формы.
//
&НаКлиенте
Процедура СчитатьДисконтнуюКарту(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СчитатьДисконтнуюКартуНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ДисконтныеКарты.Форма.СчитываниеДисконтнойКарты", , ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Завершающая часть процедуры - обработчика команды СчитатьДисконтнуюКарту формы.
// Вызывается после закрытия формы считывания дисконтной карты.
//
&НаКлиенте
Процедура СчитатьДисконтнуюКартуНажатиеЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт

	Если ТипЗнч(ВозвращаемыеПараметры) = Тип("Структура") Тогда
		СчитанаДисконтнаяКарта = ВозвращаемыеПараметры.СчитанаДисконтнаяКарта;
		ВыбранаДисконтнаяКарта(ВозвращаемыеПараметры.ДисконтнаяКарта);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик выбора дисконтной карты, начало.
//
&НаКлиенте
Процедура ВыбранаДисконтнаяКарта(ДисконтнаяКарта)

	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Считана дисконтная карта'"),
		ПолучитьНавигационнуюСсылку(ДисконтнаяКарта),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Считана дисконтная карта %1'"), ДисконтнаяКарта),
		БиблиотекаКартинок.Информация32);
	
	ВыбранаДисконтнаяКартаДополнительно(ДисконтнаяКарта);
	
КонецПроцедуры

// Процедура - обработчик выбора дисконтной карты, окончание.
//
&НаКлиенте
Процедура ВыбранаДисконтнаяКартаДополнительно(ДисконтнаяКарта)
	
	Если Не Модифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Объект.ДисконтнаяКарта = ДисконтнаяКарта;
	Объект.ПроцентСкидкиПоДисконтнойКарте = УправлениеНебольшойФирмойСервер.ВычислитьПроцентСкидкиПоДисконтнойКарте(Объект.Дата, ДисконтнаяКарта);
	
	ВладелецДисконтнойКарты = УправлениеНебольшойФирмойВызовСервера.ЗначениеРеквизитаОбъекта(ДисконтнаяКарта, "ВладелецКарты");
	Если Не ВладелецДисконтнойКарты.Пустая() Тогда
		Объект.Контрагент = ВладелецДисконтнойКарты;
		Объект.Договор = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация);
	КонецЕсли;
	
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(ПолучитьСтруктуруНадписиЦеныИВалютаНаКлиенте());
	
	ОбновитьКартинкуДисконтнойКарты();
	
	Если ДисконтныеКартыВызовСервера.СтарыйМеханизмСкидок(ДисконтнаяКарта) Тогда
	
		Если Объект.Запасы.Количество() > 0 Тогда
			Текст = НСтр("ru = 'Перезаполнить скидки во всех строках?'");
			Оповещение = Новый ОписаниеОповещения("ВыбранаДисконтнаяКартаДополнительноЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		КонецЕсли;
		
	Иначе
		
		РассчитатьСкидкиНаценки(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик выбора дисконтной карты, завершение.
//
&НаКлиенте
Процедура ВыбранаДисконтнаяКартаДополнительноЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Скидка = УправлениеНебольшойФирмойСервер.ПолучитьПроцентСкдикиПоВидуСкидокНаценок(Объект.ВидСкидкиНаценки) + Объект.ПроцентСкидкиПоДисконтнойКарте;
	
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			
			СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = Скидка;
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
			        
		КонецЦикла;
	КонецЕсли;
	
	ПересчитатьДокументНаКлиенте();
	
	// АвтоматическиеСкидки
	СброситьФлагСкидкиРассчитаныКлиент("ПересчетСкидокПоДисконтнойКарте");

КонецПроцедуры

#КонецОбласти

#Область ПодключаемоеОборудование

// Процедура осуществляет вывод информации на дисплей покупателя.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателя()
	
	ДПТекст = ?(
		Элементы.Запасы.ТекущиеДанные = Неопределено,
		"",
		СокрЛП(Элементы.Запасы.ТекущиеДанные.Номенклатура)
	  + Символы.ПС
	  + НСтр("ru='Итого: '")
	  + Формат(Объект.СуммаДокумента, "ЧДЦ=2; ЧРГ=' '; ЧН=0")
	);
	
	ИдентификаторУстройства = Неопределено; // Если ИдентификаторУстройства = Неопределено, будут очищены все подключенные дисплеи покупателя.
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВыводТекстаНаДисплейПокупателяЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьВыводИнформацииНаДисплейПокупателя(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, ДПТекст);
	
КонецПроцедуры // ВывестиИнформациюНаДисплейПокупателя()

&НаКлиенте
Процедура ВыводТекстаНаДисплейПокупателяЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр(
				"ru = 'При использовании дисплея покупателя произошла ошибка.
				|Дополнительное описание:
				|%ДополнительноеОписание%'"
			);
			ТекстСообщения = СтрЗаменить(
				ТекстСообщения,
				"%ДополнительноеОписание%",
				РезультатВыполнения.ОписаниеОшибки
			);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
	КонецЕсли;
	
КонецПроцедуры

// Процедура получает данные по штрихкодам.
//
&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	Если СтруктураДанные.Свойство("БезМаркировок")
		И СтруктураДанные.БезМаркировок Тогда
		
		// Преобразование весовых штрихкодов, т. к. они не были преобразованы библиотекой
		Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
			
			РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(СтруктураДанные.МассивШтрихкодов, СтруктураДанные.СтруктурнаяЕдиница);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		ДанныеШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() <> 0 Тогда
			
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Организация", СтруктураДанные.Организация);
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
			
			СтруктураДанныеНоменклатуры.Вставить("ИспользоватьХарактеристики", ?(НЕ ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура), Ложь, ДанныеШтрихкода.Номенклатура.ИспользоватьХарактеристики));
			СтруктураДанныеНоменклатуры.Вставить("ПроверятьЗаполнениеХарактеристики", ?(НЕ ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура), Ложь, ДанныеШтрихкода.Номенклатура.ПроверятьЗаполнениеХарактеристики));
			
			СтруктураДанныеНоменклатуры.Вставить("ИспользоватьПартии", ?(НЕ ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура), Ложь, ДанныеШтрихкода.Номенклатура.ПроверятьЗаполнениеПартий));
			СтруктураДанныеНоменклатуры.Вставить("ПроверятьЗаполнениеПартий", ?(НЕ ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура), Ложь, ДанныеШтрихкода.Номенклатура.ПроверятьЗаполнениеПартий));
			
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", СтруктураДанные.НалогообложениеНДС);
			СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", СтруктураДанные.Дата);
			Если ЗначениеЗаполнено(СтруктураДанные.ВидЦен) Тогда
				СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", СтруктураДанные.Дата);
				СтруктураДанныеНоменклатуры.Вставить("ВалютаДокумента", СтруктураДанные.ВалютаДокумента);
				СтруктураДанныеНоменклатуры.Вставить("СуммаВключаетНДС", СтруктураДанные.СуммаВключаетНДС);
				СтруктураДанныеНоменклатуры.Вставить("ВидЦен", СтруктураДанные.ВидЦен);
				Если ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения)
					И ТипЗнч(ДанныеШтрихкода.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
					СтруктураДанныеНоменклатуры.Вставить("Коэффициент", ДанныеШтрихкода.ЕдиницаИзмерения.Коэффициент);
				Иначе
					СтруктураДанныеНоменклатуры.Вставить("Коэффициент", 1);
				КонецЕсли;
				СтруктураДанныеНоменклатуры.Вставить("Содержание", "");
				СтруктураДанныеНоменклатуры.Вставить("ВидСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки);
			КонецЕсли;
			// ДисконтныеКарты
			СтруктураДанныеНоменклатуры.Вставить("ПроцентСкидкиПоДисконтнойКарте", СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
			СтруктураДанныеНоменклатуры.Вставить("ДисконтнаяКарта", СтруктураДанные.ДисконтнаяКарта);
			// Конец ДисконтныеКарты
			ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры));
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
				ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для каждого парам Из Метаданные.Документы.ЧекККМ.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение)=Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
			    МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	ДобавленныеСтроки = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	// Удалим пустые значения.
	ИндексЭлемента = МассивШтрихкодов.Количество() - 1;
	Пока ИндексЭлемента >= 0 Цикл
		Если НЕ ЗначениеЗаполнено(МассивШтрихкодов[ИндексЭлемента].Штрихкод) Тогда
			МассивШтрихкодов.Удалить(ИндексЭлемента);
		КонецЕсли;
			
		ИндексЭлемента = ИндексЭлемента - 1;
	КонецЦикла;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураДанные.Вставить("Дата", Объект.Дата);
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	// Конец ДисконтныеКарты
	СтруктураДанные.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("БезМаркировок", Не ИспользуетсяМаркировкаТабачнойПродукции
											И Не ИспользуетсяРегистрацияРозничныхПродажВЕГАИС);
	
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено Тогда
			ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры));			
		Иначе
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Партия,ЕдиницаИзмерения,НоменклатураНабора",ДанныеШтрихкода.Номенклатура,ДанныеШтрихкода.Характеристика,ДанныеШтрихкода.Партия,ДанныеШтрихкода.ЕдиницаИзмерения,ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")));
			Если ИспользуетсяМаркировкаТабачнойПродукции
				И ДанныеШтрихкода.СтруктураДанныеНоменклатуры.НеобходимостьВводаКодаМаркировки
				И ТекШтрихкод.Свойство("ДанныеМаркировки")
				И ТекШтрихкод.ДанныеМаркировки.Разобран 
				И ЗначениеЗаполнено(ТекШтрихкод.ДанныеМаркировки.КодМаркировки) Тогда
				МассивСтрокТЧСМаркировкой = Объект.Запасы.НайтиСтроки(Новый Структура("КодМаркировки", ТекШтрихкод.ДанныеМаркировки.КодМаркировки));
				Если МассивСтрокТЧСМаркировкой.Количество() > 0 Тогда
					СтрокаСообщения = НСтр("ru = 'Код маркировки уже присутствует в чеке'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если МассивСтрокТЧ.Количество() = 0
				ИЛИ (ИспользуетсяРегистрацияРозничныхПродажВЕГАИС И ДанныеШтрихкода.СтруктураДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки)
				ИЛИ (ИспользуетсяМаркировкаТабачнойПродукции И ДанныеШтрихкода.СтруктураДанныеНоменклатуры.НеобходимостьВводаКодаМаркировки) Тогда
				НоваяСтрока = Объект.Запасы.Добавить();
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
				НоваяСтрока.Цена = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Цена;
				НоваяСтрока.ПроцентСкидкиНаценки = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ПроцентСкидкиНаценки;
				НоваяСтрока.СтавкаНДС = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.СтавкаНДС;
				НоваяСтрока.НеобходимостьВводаАкцизнойМарки = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки;
				НоваяСтрока.НеобходимостьВводаКодаМаркировки = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.НеобходимостьВводаКодаМаркировки;
				Если НоваяСтрока.НеобходимостьВводаКодаМаркировки
					И ТекШтрихкод.Свойство("ДанныеМаркировки")
					И ТекШтрихкод.ДанныеМаркировки.Разобран Тогда
					НоваяСтрока.КодМаркировки = ТекШтрихкод.ДанныеМаркировки.КодМаркировки;
				КонецЕсли;
				НоваяСтрока.Штрихкод = ТекШтрихкод.Штрихкод;
				НоваяСтрока.ИспользоватьХарактеристики = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ИспользоватьХарактеристики;
				НоваяСтрока.ПроверятьЗаполнениеХарактеристики = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ПроверятьЗаполнениеХарактеристики;
				НоваяСтрока.ИспользоватьПартии = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ИспользоватьПартии;
				НоваяСтрока.ПроверятьЗаполнениеПартий = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ПроверятьЗаполнениеПартий;
				НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
				Если ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
					// Наборы
					ЗаменитьСтрокуЗапасовДаннымиНабора(ЭтотОбъект, НоваяСтрока, ДанныеШтрихкода.СтруктураДанныеНоменклатуры);
					// Конец Наборы
					// АвтоматическиеСкидки.
					СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
					// Конец АвтоматическиеСкидки
				Иначе
					РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
					Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
					Если НоваяСтрока.НеобходимостьВводаАкцизнойМарки 
						ИЛИ (НоваяСтрока.НеобходимостьВводаКодаМаркировки И НЕ ЗначениеЗаполнено(НоваяСтрока.КодМаркировки)) Тогда
						ДобавленныеСтроки.Добавить(НоваяСтрока);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				НоваяСтрока = МассивСтрокТЧ[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
				НоваяСтрока.Штрихкод = ТекШтрихкод.Штрихкод;
				РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
				Если НоваяСтрока.НеобходимостьВводаАкцизнойМарки 
					ИЛИ (НоваяСтрока.НеобходимостьВводаКодаМаркировки И НЕ ЗначениеЗаполнено(НоваяСтрока.КодМаркировки)) Тогда
					ДобавленныеСтроки.Добавить(НоваяСтрока);
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеШтрихкода.Свойство("СерийныйНомер") И ЗначениеЗаполнено(ДанныеШтрихкода.СерийныйНомер) Тогда
				РаботаССерийнымиНомерамиКлиентСервер.ДобавитьСерийныйНомерВСтроку(НоваяСтрока, ДанныеШтрихкода.СерийныйНомер, Объект);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа, ДобавленныеСтроки",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа, ДобавленныеСтроки);
	
КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	Если Не ИспользуетсяМаркировкаТабачнойПродукции
		И Не ИспользуетсяРегистрацияРозничныхПродажВЕГАИС Тогда
		
		ПолученыШтрихкодыБезГОСИС(ДанныеШтрихкодов);
		
	Иначе
	
		ШтрихкодированиеИСКлиент.ОбработатьВводШтрихкода(
			ЭтотОбъект,
			ДанныеШтрихкодов[0],
			КэшированныеЗначения);
		
	КонецЕсли;
	
КонецПроцедуры // ПолученыШтрихкоды()

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученыШтрихкодыБезГОСИС(ДанныеШтрихкодов)
	
	Модифицированность = Истина;
	
	НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	ДобавленныеСтроки	= НеДобавленныеШтрихкоды.ДобавленныеСтроки;
	Если ДобавленныеСтроки.Количество() > 0 Тогда
		ОткрытьВводАкцизнойМарки(ДобавленныеСтроки[0]);
		Возврат;
	КонецЕсли;
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
		// Для тех, у кого есть профиль "Рабочее место кассира" мы не разрешаем регистрацию штрихкодов
		Если ПараметрыРаботыКлиента.Свойство("ЕстьПрофильРМК") И ПараметрыРаботыКлиента.ЕстьПрофильРМК Тогда
			
			ОповеститьОНенайденныхШтрихкодах(НеизвестныеШтрихкоды, Истина);
			Возврат;
			
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтаФорма, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтаФорма,,,,Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкодыБезГОСИС()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОНенайденныхШтрихкодах(НеизвестныеШтрихкоды, ПоказыватьСообщением = Истина)
	
	СтрокаПредупреждения = "";
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		
		СтрокаПредупреждения = СтрокаПредупреждения + СтрокаСообщения + Символы.ПС;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СтрокаПредупреждения) Тогда
		Если ПоказыватьСообщением Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаПредупреждения);
		Иначе
			ПоказатьПредупреждение(,СтрокаПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	ОповеститьОНенайденныхШтрихкодах(НеизвестныеШтрихкоды);
	ПересчитатьДокументНаКлиенте();
	
	ЗаполнитьПризнакиИспользованияХарактеристик();
	
	Если РежимОстаткиИРезервы Тогда
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик команды командной панели табличной части.
//
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод)
	);
	
	Если УправлениеНебольшойФирмойСервер.ЭтоМобильныйКлиент() Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду",,,,,,ОбработкаЗавершения);
	Иначе
		ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкоду()

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("Штрихкод") Тогда
			ТекШтрихкод = Результат.Штрихкод;
		Иначе
			ТекШтрихкод = "";
		КонецЕсли;
	ИначеЕсли Результат <> Неопределено Тогда
		ТекШтрихкод = Результат;
	ИначеЕсли ДополнительныеПараметры.Свойство("ТекШтрихкод") Тогда
		ТекШтрихкод = ДополнительныеПараметры.ТекШтрихкод;
	Иначе
		ТекШтрихкод = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ТекШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьЗакладкиПродажиМК();
	
	Данные = Новый Массив();
	Данные.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1)); 
	
	ПолученыШтрихкоды(Данные);
	
КонецПроцедуры // ПоискПоШтрихкоду()

&НаСервере
Процедура ЗаполнитьПризнакиИспользованияХарактеристик()
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ГосИС

&НаСервере
Функция Подключаемый_ОбработатьВводШтрихкода(ДанныеШтрихкода, КэшированныеЗначения, ПараметрыСканирования = Неопределено)
	
	//ШтрихкодированиеИС
	РезультатОбработкиШтрихкода = ШтрихкодированиеИС.ОбработатьВводШтрихкода(
		ЭтотОбъект, ДанныеШтрихкода, КэшированныеЗначения, ПараметрыСканирования);
	
	ПослеОбработкиШтрихкодов(РезультатОбработкиШтрихкода, КэшированныеЗначения);
	
	РезультатОбработкиШтрихкода.ИзмененныеСтроки	= Неопределено;
	РезультатОбработкиШтрихкода.ДобавленныеСтроки	= Неопределено;
	
	Возврат РезультатОбработкиШтрихкода;
	
КонецФункции

//ШтрихкодированиеИС
&НаСервере
Функция Подключаемый_ВыполнитьДействие(Действие, РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения)
	
	ПараметрыОбработкиВыбора	= ШтрихкодированиеИС.ИнициализироватьПараметрыОбработкиВыбора(РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения);
	РезультатОбработкиШтрихкода	= ВыполнитьДействиеНаСервере(Действие, ПараметрыОбработкиВыбора);
	
	ПослеОбработкиШтрихкодов(
		РезультатОбработкиШтрихкода,
		КэшированныеЗначения);
	
	РезультатОбработкиШтрихкода.ИзмененныеСтроки  = Неопределено;
	РезультатОбработкиШтрихкода.ДобавленныеСтроки = Неопределено;
	
	Возврат РезультатОбработкиШтрихкода;
	
КонецФункции

&НаСервере
Функция ВыполнитьДействиеНаСервере(Действие, ПараметрыОбработкиВыбора)
	
	Возврат ШтрихкодированиеИС.ВыполнитьДействие(ЭтотОбъект, Действие, ПараметрыОбработкиВыбора);
	
КонецФункции

//ШтрихкодированиеИС
&НаКлиенте
Процедура Подключаемый_ПослеОбработкиШтрихкодов()
	
	Если ЗначениеЗаполнено(ШтрихкодДляОбработки) Тогда
		
		Штрихкод = ШтрихкодДляОбработки;
		ШтрихкодДляОбработки = Неопределено;
		
		ПараметрыМаркировки = ИнтеграцияМОТПУНФКлиент.ИнициализироватьПараметрыОткрытияФормыВводаКодаМаркировки();
		ЗаполнитьПараметрыМаркировкиНоменклатуры(Штрихкод, ПараметрыМаркировки);
		Если ПараметрыМаркировки.МаркируемаяПродукция Тогда
			ИнтеграцияМОТПУНФКлиент.ОткрытьФормуСчитыванияКодаМаркировки(ЭтотОбъект, ПараметрыМаркировки);
			Возврат;
		КонецЕсли;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(Штрихкод);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
		
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
			
			ОткрытьФорму(
				"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
				Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение);
			
			Возврат;
			
		КонецЕсли;
		
		ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
		
	КонецЕсли;
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыМаркировкиНоменклатуры(ДанныеШтрихкода, ПараметрыМаркировки)
	
	Номенклатура = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьНоменклатуруПоШтрихкоду(ДанныеШтрихкода);
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ПараметрыМаркировки.Вставить("МаркируемаяПродукция", Ложь);
		Возврат;
	КонецЕсли;
	
	ПараметрыМаркировки.Вставить("Номенклатура", Номенклатура);
	
	Если Номенклатура.ТабачнаяПродукция Тогда
		ПараметрыМаркировки.Вставить("ВидПродукции", Перечисления.ВидыПродукцииИС.Табачная);
		ПараметрыМаркировки.Вставить("МаркируемаяПродукция", Истина);
	ИначеЕсли Номенклатура.ВидАлкогольнойПродукции.Маркируемый Тогда
		ПараметрыМаркировки.Вставить("ВидПродукции", Перечисления.ВидыПродукцииИС.Алкогольная);
		ПараметрыМаркировки.Вставить("МаркируемаяПродукция", Истина);
	Иначе
		ПараметрыМаркировки.Вставить("МаркируемаяПродукция", Ложь);
	КонецЕсли;
	
	ПараметрыМаркировки.Вставить("ПараметрыСканирования", ШтрихкодированиеИСКлиентСервер.ИнициализироватьПараметрыСканирования(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПрочиеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	//ШтрихкодированиеИС
	ПараметрыСканирования = ШтрихкодированиеИСКлиентСервер.ИнициализироватьПараметрыСканирования(ЭтотОбъект);
	РезультатОбработкиШтрихкода = ИнициализироватьРезультатОбработкиШтрихкодаНаСервере(ПараметрыСканирования);
	РезультатОбработкиШтрихкода.ТребуетсяОбработкаШтрихкода = Истина;
	РезультатОбработкиШтрихкода.ИсходныеДанные = ДанныеШтрихкодов;
	
	ПослеОбработкиШтрихкодов(РезультатОбработкиШтрихкода, КэшированныеЗначения);
	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьРезультатОбработкиШтрихкодаНаСервере(ПараметрыСканирования)
	
	Результат = ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода(ПараметрыСканирования);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УстановкаПериодовДинамическихСписков

// Процедура заполняет списки выбора в элементах, которые управляют периодом в списках документов.
//
&НаСервере
Процедура ЗаполнитьСпискиВидыПериодов()
	
	Элементы.ВидПериодаЖурнала.СписокВыбора.Очистить();
	Элементы.ВидПериодаЖурнала.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаТекущуюСмену);
	Элементы.ВидПериодаЖурнала.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаПрошлуюСмену);
	Элементы.ВидПериодаЖурнала.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаПроизвольныйПериод);
	
	Элементы.ВидПериодаЧековККМ.СписокВыбора.Очистить();
	Элементы.ВидПериодаЧековККМ.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаТекущуюСмену);
	Элементы.ВидПериодаЧековККМ.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаПрошлуюСмену);
	Элементы.ВидПериодаЧековККМ.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаПроизвольныйПериод);
	
	Элементы.ВидПериодаЧековККМНаВозврат.СписокВыбора.Очистить();
	Элементы.ВидПериодаЧековККМНаВозврат.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаТекущуюСмену);
	Элементы.ВидПериодаЧековККМНаВозврат.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаПрошлуюСмену);
	Элементы.ВидПериодаЧековККМНаВозврат.СписокВыбора.Добавить(Перечисления.ВидыПериодовРМК.ЗаПроизвольныйПериод);
	
КонецПроцедуры

// Процедура - обработчик собыития ОбработкаВыбора элемента ВидПериодаЖурнала формы.
//
&НаКлиенте
Процедура ВидПериодаЖурналаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьПериодНаКлиенте(ВыбранноеЗначение, "Список");
	СтандартнаяОбработка = Ложь;
	Элементы.ВидПериодаЖурнала.ОбновитьТекстРедактирования();
	
КонецПроцедуры

// Процедура - обработчик собыития ОбработкаВыбора элемента ВидПериодаЧековККМ формы.
//
&НаКлиенте
Процедура ВидПериодаЧековККМОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьПериодНаКлиенте(ВыбранноеЗначение, "СписокЧековККМ");
	СтандартнаяОбработка = Ложь;
	Элементы.ВидПериодаЧековККМ.ОбновитьТекстРедактирования();
	
КонецПроцедуры

// Процедура - обработчик собыития ОбработкаВыбора элемента ВидПериодаЧековККМНаВозврат формы.
//
&НаКлиенте
Процедура ВидПериодаЧековККМНаВозвратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьПериодНаКлиенте(ВыбранноеЗначение, "СписокЧековККМНаВозврат");
	СтандартнаяОбработка = Ложь;
	Элементы.ВидПериодаЧековККМНаВозврат.ОбновитьТекстРедактирования();
	
КонецПроцедуры

// Процедура - обработчик собыития ОбработкаВыбора элемента ВидПериодаЗаказов формы.
//
&НаКлиенте
Процедура ВидПериодаЗаказовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "СписокЗаказов", "Дата");
	
КонецПроцедуры

// Процедура настривает период динамического списка.
//
&НаКлиенте
Процедура УстановитьПериодНаКлиенте(ВидПериодаРМК, ИмяСписка, ПараметрСтандартныйПериод = Неопределено)
	
	Если ВидПериодаРМК = ЭтотОбъект.ЗаПроизвольныйПериод Тогда
		
		Если ИмяСписка = "Список" Тогда
			ВидПериодаЖурналаПеречисление = ВидПериодаРМК;
		ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозвратПеречисление = ВидПериодаРМК;
		ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМПеречисление = ВидПериодаРМК;
		ИначеЕсли ИмяСписка = "СписокЗаказов" Тогда
			ВидПериодаЗаказовПеречисление = ВидПериодаЗаказов;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект, Новый Структура("ИмяСписка", ИмяСписка));
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Диалог.Период = ЭтотОбъект.Элементы[ИмяСписка].Период;
		Диалог.Показать(ОписаниеОповещения);
		
	Иначе
		
		УстановитьПериодНаСервере(ВидПериодаРМК, ИмяСписка, ПараметрСтандартныйПериод);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура настривает период динамического списка (если требуется интерактивный выбор периода).
//
&НаКлиенте
Процедура УстановитьПериодЗавершение(Результат, Параметры) Экспорт
	
	УстановитьПериодЗавершениеНаСервере(Результат, Параметры);
	
КонецПроцедуры

// Процедура настривает период динамического списка на сервере (если требуется интерактивный выбор периода).
//
&НаСервере
Процедура УстановитьПериодЗавершениеНаСервере(Результат, Параметры)
	
	Если Результат <> Неопределено Тогда
		
		Если Параметры.ИмяСписка <> "СписокЗаказов" Тогда
			ЭтотОбъект[Параметры.ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Ложь);
			ЭтотОбъект[Параметры.ИмяСписка].Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
			ЭтотОбъект[Параметры.ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
		КонецЕсли;
		
		Элементы[Параметры.ИмяСписка].Период.Вариант = Результат.Вариант;
		Элементы[Параметры.ИмяСписка].Период.ДатаНачала = Результат.ДатаНачала;
		Элементы[Параметры.ИмяСписка].Период.ДатаОкончания = Результат.ДатаОкончания;
		Элементы[Параметры.ИмяСписка].Обновить();
		
		Если Параметры.ИмяСписка = "Список" Тогда
			Элементы.Дата.Видимость = Истина;
			ВидПериодаЖурнала = ПолучитьПредставлениеПериода(Результат, " - ");
		ИначеЕсли Параметры.ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозврат = ПолучитьПредставлениеПериода(Результат, " - ");
		ИначеЕсли Параметры.ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМ = ПолучитьПредставлениеПериода(Результат, " - ");
		ИначеЕсли Параметры.ИмяСписка = "СписокЗаказов" Тогда
			ВидПериодаЗаказов = ПолучитьПредставлениеПериода(Результат, " - ");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура настривает период динамического списка на сервере.
//
&НаСервере
Процедура УстановитьПериодНаСервере(ВидПериодаРМК, ИмяСписка, ПараметрСтандартныйПериод = Неопределено)
	
	Если ИмяСписка = "Список" Тогда
		ВидПериодаЖурналаПеречисление = ВидПериодаРМК;
	ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
		ВидПериодаЧековККМНаВозвратПеречисление = ВидПериодаРМК;
	ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
		ВидПериодаЧековККМПеречисление = ВидПериодаРМК;
	КонецЕсли;
	
	Если ВидПериодаРМК = ЗаТекущуюСмену Тогда
		
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
		Элементы[ИмяСписка].Период = Новый СтандартныйПериод;
		Элементы[ИмяСписка].Обновить();
		Если ИмяСписка = "Список" Тогда
			Элементы.Дата.Видимость = Ложь;
			ВидПериодаЖурнала = "За текущую смену";
		ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозврат = "За текущую смену";
		ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМ = "За текущую смену";
		КонецЕсли;
		
	ИначеЕсли ВидПериодаРМК = ЗаПрошлуюСмену Тогда
		
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Ложь);
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Истина);
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("КассоваяСмена", ПолучитьПоследнийОтчетОРозничныхПродажахЗаЗакрытуюКассовуюСмену());
		Элементы[ИмяСписка].Период = Новый СтандартныйПериод;
		Элементы[ИмяСписка].Обновить();
		Если ИмяСписка = "Список" Тогда
			Элементы.Дата.Видимость = Ложь;
			ВидПериодаЖурнала = "За прошлую смену";
		ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозврат = "За прошлую смену";
		ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМ = "За прошлую смену";
		КонецЕсли;
		
	ИначеЕсли ВидПериодаРМК = ЗаВчерашнийДень Тогда
		
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Ложь);
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
		Элементы[ИмяСписка].Обновить();
		Элементы[ИмяСписка].Период.ДатаНачала = НачалоДня(НачалоДня(ТекущаяДата())-1);
		Элементы[ИмяСписка].Период.ДатаОкончания = НачалоДня(ТекущаяДата())-1;
		Элементы[ИмяСписка].Обновить();
		Если ИмяСписка = "Список" Тогда
			Элементы.Дата.Видимость = Ложь;
			ВидПериодаЖурнала = "За вчерашний день";
		ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозврат = "За вчерашний день";
		ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМ = "За вчерашний день";
		КонецЕсли;
		
	ИначеЕсли ВидПериодаРМК = ЗаПроизвольныйПериод Тогда
		
		Элементы[ИмяСписка].Период.ДатаНачала = ПараметрСтандартныйПериод.ДатаНачала;
		Элементы[ИмяСписка].Период.ДатаОкончания = ПараметрСтандартныйПериод.ДатаОкончания;
		Если ИмяСписка <> "СписокЗаказов" Тогда
			ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Ложь);
			ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
		КонецЕсли;
		Элементы[ИмяСписка].Обновить();
		Если ИмяСписка = "Список" Тогда
			Элементы.Дата.Видимость = Истина;
			ВидПериодаЖурнала = ПолучитьПредставлениеПериода(Элементы.Список.Период, " - ");
		ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозврат = ПолучитьПредставлениеПериода(Элементы.СписокЧековККМНаВозврат.Период, " - ");
		ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМ = ПолучитьПредставлениеПериода(Элементы.СписокЧековККМ.Период, " - ");
		ИначеЕсли ИмяСписка = "СписокЗаказов" Тогда
			ВидПериодаЗаказов = ПолучитьПредставлениеПериода(Элементы.СписокЗаказов.Период, " - ");
		КонецЕсли;
		
	ИначеЕсли ВидПериодаРМК = ЗаВесьПериод Тогда
		
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Ложь);
		ЭтотОбъект[ИмяСписка].Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
		Элементы[ИмяСписка].Период = Новый СтандартныйПериод;
		Элементы[ИмяСписка].Обновить();
		Если ИмяСписка = "Список" Тогда
			Элементы.Дата.Видимость = Истина;
			ВидПериодаЖурнала = "За всё время";
		ИначеЕсли ИмяСписка = "СписокЧековККМНаВозврат" Тогда
			ВидПериодаЧековККМНаВозврат = "За всё время";
		ИначеЕсли ИмяСписка = "СписокЧековККМ" Тогда
			ВидПериодаЧековККМ = "За всё время";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает представление стандартного периода.
//
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеПериода(СтандартныйПериод, Разделитель = " по ")
	
	Возврат РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(СтандартныйПериод);
	
КонецФункции

#КонецОбласти

#Область БыстрыеТовары

// Процедура создает кнопки на панели быстрых товаров.
//
&НаСервере
Процедура ЗаполнитьБыстрыеТовары(ПриОткрытии = Ложь)

	КоличествоСтолбцов = 3;
	
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось определить рабочее место для работы с подключаемым оборудованием!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	НастройкаРМК = РабочееМестоКассираВызовСервера.ПолучитьНастройкуРМК(РабочееМесто);
	Если Не ЗначениеЗаполнено(НастройкаРМК) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить настройки РМК для текущего рабочего места!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БыстрыеТовары.Номенклатура КАК Номенклатура,
		|	БыстрыеТовары.Характеристика КАК Характеристика,
		|	БыстрыеТовары.Ctrl,
		|	БыстрыеТовары.Shift,
		|	БыстрыеТовары.Alt,
		|	БыстрыеТовары.СочетаниеКлавиш,
		|	БыстрыеТовары.Клавиша,
		|	БыстрыеТовары.Заголовок,
		|	БыстрыеТовары.Номенклатура.ИспользоватьХарактеристики КАК ХарактеристикиИспользуются,
		|	БыстрыеТовары.Номенклатура.Наименование КАК Наименование,
		|	БыстрыеТовары.Характеристика.Наименование,
		|	ВЫБОР
		|		КОГДА БыстрыеТовары.ПолеСоритровки = """"
		|			ТОГДА ""999999""
		|		ИНАЧЕ БыстрыеТовары.ПолеСоритровки
		|	КОНЕЦ КАК ПолеСоритровки
		|ИЗ
		|	Справочник.НастройкиРМК.БыстрыеТовары КАК БыстрыеТовары
		|ГДЕ
		|	БыстрыеТовары.Ссылка = &НастройкаРМК
		|	И НЕ БыстрыеТовары.Отключено
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолеСоритровки,
		|	Номенклатура,
		|	Характеристика
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НастройкаРМК", НастройкаРМК);
	
	МРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРезультата = МРезультатов[0].Выгрузить();
	
	// Удалим команды.
	Если Не ПриОткрытии Тогда
		МассивУдаляемыхКоманд = Новый Массив;
		Для Каждого Команда Из Команды Цикл
			Если (СтрНайти(Команда.Имя, "БыстрыйТовар_") > 0) 
				ИЛИ (СтрНайти(Команда.Имя, "ГруппаБыстрыхТоваров_") > 0) 
				Тогда
				МассивУдаляемыхКоманд.Добавить(Команда);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Команда Из МассивУдаляемыхКоманд Цикл
			Команды.Удалить(Команда);
		КонецЦикла;
		// Удалим элементы.
		МассивУдаляемыхЭлементов = Новый Массив;
		Для Каждого Элемент Из Элементы Цикл
			Если (СтрНайти(Элемент.Имя, "БыстрыйТовар_") > 0) 
				ИЛИ (СтрНайти(Элемент.Имя, "ГруппаОплатаКартой_") > 0) 
				ИЛИ (СтрНайти(Элемент.Имя, "ГруппаБыстрыхТоваров_")) Тогда
				МассивУдаляемыхЭлементов.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из МассивУдаляемыхЭлементов Цикл
			Попытка
				Элементы.Удалить(Элемент);
			Исключение КонецПопытки;
		КонецЦикла;
		
		БыстрыеТовары.Очистить();
	КонецЕсли;
	
	ТекСч = 1;
	Для Каждого БыстрыйТовар Из ТаблицаРезультата Цикл
		Если Не ЗначениеЗаполнено(БыстрыйТовар.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = БыстрыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, БыстрыйТовар);
		
		ИмяКнопки = "БыстрыйТовар_" + БыстрыеТовары.Индекс(НоваяСтрока);
			
		НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКнопки);
		НоваяКоманда.Действие = "ВыбранБыстрыйТовар";
		Если ЗначениеЗаполнено(БыстрыйТовар.Заголовок) Тогда
			НоваяКоманда.Заголовок = БыстрыйТовар.Заголовок;
		Иначе
			НоваяКоманда.Заголовок = Строка(БыстрыйТовар.Наименование)+?(ЗначениеЗаполнено(БыстрыйТовар.ХарактеристикаНаименование), ". "+СокрЛП(БыстрыйТовар.ХарактеристикаНаименование), "");
		КонецЕсли;
		НоваяКоманда.Отображение               = ОтображениеКнопки.Текст;
		НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
		Если ЗначениеЗаполнено(БыстрыйТовар.Клавиша) Тогда
			НоваяКоманда.СочетаниеКлавиш           = Новый СочетаниеКлавиш(Клавиша[БыстрыйТовар.Клавиша], БыстрыйТовар.Alt, БыстрыйТовар.Ctrl, БыстрыйТовар.Shift);
		КонецЕсли;
		
		Если ТекСч = 1 ИЛИ (ТекСч-1) % КоличествоСтолбцов = 0 Тогда
			НоваяГруппа = Элементы.Добавить("ГруппаОплатаКартой_"+ТекСч, Тип("ГруппаФормы"), Элементы.ГруппаКнопкиБыстрыхТоваров);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		КонецЕсли;

		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), НоваяГруппа);
		НоваяКнопка.ТолькоВоВсехДействиях = Ложь;
		НоваяКнопка.Видимость = Истина;
		НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
		Если ЗначениеЗаполнено(БыстрыйТовар.Заголовок) Тогда
			НоваяКнопка.Заголовок = СокрЛП(БыстрыйТовар.Заголовок);
		Иначе
			НоваяКнопка.Заголовок = СокрЛП(БыстрыйТовар.Наименование)+?(ЗначениеЗаполнено(БыстрыйТовар.ХарактеристикаНаименование), ". "+СокрЛП(БыстрыйТовар.ХарактеристикаНаименование), "");
		КонецЕсли;
		ПредставлениеСочетания = ПредставлениеСочетанияКлавиш(НоваяКоманда.СочетаниеКлавиш);
		Если ЗначениеЗаполнено(ПредставлениеСочетания) Тогда
			НоваяКнопка.Заголовок = Лев(СокрЛП(НоваяКнопка.Заголовок), 20) + " " + ПредставлениеСочетания;
		КонецЕсли;
		НоваяКнопка.Ширина = 9;
		НоваяКнопка.Высота = 3;
		НоваяКнопка.ВысотаЗаголовка = 3;
		НоваяКнопка.СочетаниеКлавиш = НоваяКоманда.СочетаниеКлавиш;
		
		НоваяКнопка.РастягиватьПоГоризонтали = Истина;
		НоваяКнопка.АвтоМаксимальнаяШирина = Ложь;
		НоваяКнопка.МаксимальнаяШирина = 0;
		
		НоваяСтрока.ИмяКоманды = ИмяКнопки;
		
		ТекСч = ТекСч + 1;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьБыстрыеТовары()

// Процедура - обработчика нажатия кнопки быстрого товара.
&НаКлиенте
Процедура ВыбранБыстрыйТовар(Команда, СтруктураНоменклатураХарактеристика = Неопределено)
	
	СтруктураОтбора = Неопределено;
	Если СтруктураНоменклатураХарактеристика = Неопределено Тогда
		НайденныеСтроки = БыстрыеТовары.НайтиСтроки(Новый Структура("ИмяКоманды", ""+Команда.Имя));
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтруктураОтбора = Новый Структура("Номенклатура, Характеристика", НайденныеСтроки[0].Номенклатура, НайденныеСтроки[0].Характеристика);
		КонецЕсли;
	Иначе
		СтруктураОтбора = СтруктураНоменклатураХарактеристика;
	КонецЕсли;
	
	Если СтруктураОтбора <> Неопределено Тогда
		ЗапасыНайденныеСтроки = Объект.Запасы.НайтиСтроки(СтруктураОтбора);
		
		Если ЗапасыНайденныеСтроки.Количество() = 0
			ИЛИ ЗапасыНайденныеСтроки[0].НеобходимостьВводаАкцизнойМарки
			ИЛИ ЗапасыНайденныеСтроки[0].НеобходимостьВводаКодаМаркировки Тогда
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = СтруктураОтбора.Номенклатура;
			НоваяСтрока.Характеристика = СтруктураОтбора.Характеристика;
			
			ДокументПересчитанНаКлиенте = Ложь;
			НоменклатураПриИзменении(НоваяСтрока);
		Иначе
			ЗапасыНайденныеСтроки[0].Количество = ЗапасыНайденныеСтроки[0].Количество + 1;
			
			ДокументПересчитанНаКлиенте = Ложь;
			РассчитатьСуммуВСтрокеТабличнойЧасти(ЗапасыНайденныеСтроки[0]);
			
			НоваяСтрока = ЗапасыНайденныеСтроки[0];
		КонецЕсли;
		
		УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, НоваяСтрока);
		
		Элементы.Запасы.Обновить();
		Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
		ПересчитатьДокументНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СочетанияКлавиш

// Функция возвращает представление клавиши
// Параметры:
//	ЗначениеКлавиша						- Клавиша
//
// Возвращаемое значение
//	Строка - Представление клавиши
//
&НаСервере
Функция ПредставлениеКлавиши(ЗначениеКлавиша) Экспорт
	
	Если Строка(Клавиша._1) = Строка(ЗначениеКлавиша) Тогда
		Возврат "1";
	ИначеЕсли Строка(Клавиша._2) = Строка(ЗначениеКлавиша) Тогда
		Возврат "2";
	ИначеЕсли Строка(Клавиша._3) = Строка(ЗначениеКлавиша) Тогда
		Возврат "3";
	ИначеЕсли Строка(Клавиша._4) = Строка(ЗначениеКлавиша) Тогда
		Возврат "4";
	ИначеЕсли Строка(Клавиша._5) = Строка(ЗначениеКлавиша) Тогда
		Возврат "5";
	ИначеЕсли Строка(Клавиша._6) = Строка(ЗначениеКлавиша) Тогда
		Возврат "6";
	ИначеЕсли Строка(Клавиша._7) = Строка(ЗначениеКлавиша) Тогда
		Возврат "7";
	ИначеЕсли Строка(Клавиша._8) = Строка(ЗначениеКлавиша) Тогда
		Возврат "8";
	ИначеЕсли Строка(Клавиша._9) = Строка(ЗначениеКлавиша) Тогда
		Возврат "9";
	ИначеЕсли Строка(Клавиша.Num0) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 0";
	ИначеЕсли Строка(Клавиша.Num1) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 1";
	ИначеЕсли Строка(Клавиша.Num2) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 2";
	ИначеЕсли Строка(Клавиша.Num3) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 3";
	ИначеЕсли Строка(Клавиша.Num4) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 4";
	ИначеЕсли Строка(Клавиша.Num5) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 5";
	ИначеЕсли Строка(Клавиша.Num6) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 6";
	ИначеЕсли Строка(Клавиша.Num7) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 7";
	ИначеЕсли Строка(Клавиша.Num8) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 8";
	ИначеЕсли Строка(Клавиша.Num9) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num 9";
	ИначеЕсли Строка(Клавиша.NumAdd) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num +";
	ИначеЕсли Строка(Клавиша.NumDecimal) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num .";
	ИначеЕсли Строка(Клавиша.NumDivide) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num /";
	ИначеЕсли Строка(Клавиша.NumMultiply) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num *";
	ИначеЕсли Строка(Клавиша.NumSubtract) = Строка(ЗначениеКлавиша) Тогда
		Возврат "Num -";
	Иначе
		Возврат Строка(ЗначениеКлавиша);
	КонецЕсли;
	
КонецФункции

// Функция возвращает представление клавиши
// Параметры:
//	СочетаниеКлавиш						- Сочетание клавиш для которого нужно сформировать представление
//	БезСкобок							- Флаг, указывающий, что представление должно быть сформировано без скобок
//
// Возвращаемое значение
//	Строка - Представление сочетания клавиш
//
&НаСервере
Функция ПредставлениеСочетанияКлавиш(СочетаниеКлавиш, БезСкобок = Ложь) Экспорт
	
	Если СочетаниеКлавиш.Клавиша = Клавиша.Нет Тогда
		Возврат "";
	КонецЕсли;
	
	Наименование = ?(БезСкобок, "", "(");
	Если СочетаниеКлавиш.Ctrl Тогда
		Наименование = Наименование + "Ctrl+"
	КонецЕсли;
	Если СочетаниеКлавиш.Alt Тогда
		Наименование = Наименование + "Alt+"
	КонецЕсли;
	Если СочетаниеКлавиш.Shift Тогда
		Наименование = Наименование + "Shift+"
	КонецЕсли;
	Наименование = Наименование + ПредставлениеКлавиши(СочетаниеКлавиш.Клавиша) + ?(БезСкобок, "", ")");
	
	Возврат Наименование;
	
КонецФункции

#КонецОбласти

#Область ПредставлениеСтрокиТЧЗапасыНаЧеке

// Функция возвражает информацию о количестве и суммах в виде строки. Используется для заполнения состава чека на закладке "Возврат".
//
&НаСервере
Функция ПолучитьОписаниеДляСтрокиТЧЗапасыНаСервере(Строка)
	
	СуммаСкидкиСтроки = (Строка.Количество * Строка.Цена) - Строка.Сумма;
	НоменклатураХарактеристикаИПартия = СокрЛП(Строка.Номенклатура.Наименование)+?(Строка.Характеристика.Пустая(), "", ". "+Строка.Характеристика)+?(Строка.Партия.Пустая(), "", ". "+Строка.Партия);
	Если СуммаСкидкиСтроки <> 0 Тогда
		ПроцентСкидки = Формат(СуммаСкидкиСтроки * 100 / (Строка.Количество * Строка.Цена), "ЧДЦ=2");
		ТекстСкидки = ?(СуммаСкидкиСтроки > 0, " - "+СуммаСкидкиСтроки, " + "+(-СуммаСкидкиСтроки))+" "+Объект.ВалютаДокумента
					  +" ("+?(СуммаСкидкиСтроки > 0, " - "+ПроцентСкидки+"%)", " + "+(-ПроцентСкидки)+"%)");
	Иначе
		ТекстСкидки = "";
	КонецЕсли;
	Возврат ""+Строка.Цена+" "+Объект.ВалютаДокумента+" Х "+Строка.Количество+" "+Строка.ЕдиницаИзмерения+ТекстСкидки+" = "+Строка.Сумма+" "+Объект.ВалютаДокумента;
	
КонецФункции

// Функция заполняет реквизиты ДанныеПоСтроке и НоменклатураХарактеристикаИПартия строки ТЧ Запасы.
//
&НаКлиентеНаСервереБезКонтекста
Функция УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, Строка)
	
	СуммаСкидкиСтроки = (Строка.Количество * Строка.Цена) - Строка.Сумма;
	Строка.НоменклатураХарактеристикаИПартия = СокрЛП(""+Строка.Номенклатура)+?(Строка.Характеристика.Пустая(), "", ". "+Строка.Характеристика)+?(Строка.Партия.Пустая(), "", ". "+Строка.Партия);
	Если СуммаСкидкиСтроки <> 0 Тогда
		ПроцентСкидки = Формат(СуммаСкидкиСтроки * 100 / (Строка.Количество * Строка.Цена), "ЧДЦ=2");
		ТекстСкидки = ?(СуммаСкидкиСтроки > 0, " - "+СуммаСкидкиСтроки, " + "+(-СуммаСкидкиСтроки))+" "+Объект.ВалютаДокумента
					  +" ("+?(СуммаСкидкиСтроки > 0, " - "+ПроцентСкидки+"%)", " + "+(-ПроцентСкидки)+"%)");
	Иначе
		ТекстСкидки = "";
	КонецЕсли;
	Строка.ДанныеПоСтроке = ""+Строка.Цена+" "+Объект.ВалютаДокумента+" Х "+Строка.Количество+" "+Строка.ЕдиницаИзмерения+ТекстСкидки+" = "+Строка.Сумма+" "+Объект.ВалютаДокумента;
	
КонецФункции

// Функция заполняет реквизиты ДанныеПоСтроке и НоменклатураХарактеристикаИПартия для всех строк ТЧ Запасы.
//
&НаКлиенте
Процедура ЗаполнитьОписаниеДляТЧЗапасыНаКлиенте()
	
	Для Каждого ТекущаяСтрока Из Объект.Запасы Цикл
		УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Функция заполняет реквизиты ДанныеПоСтроке и НоменклатураХарактеристикаИПартия для всех строк ТЧ Запасы.
//
&НаСервере
Процедура ЗаполнитьОписаниеДляТЧЗапасыНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.Запасы Цикл
		УстановитьОписаниеДляСтрокиТЧЗапасы(Объект, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаАкцизнойМаркиАП(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	МассивАкцизныхМарок = Объект.АкцизныеМарки.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметры.ТекущийКлючСвязи));
	Для каждого СтрокаАкцизнаяМарка Из МассивАкцизныхМарок Цикл
		Объект.АкцизныеМарки.Удалить(СтрокаАкцизнаяМарка);
	КонецЦикла;
	
	СтрокаТЧ = Объект.Запасы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОткрытияФормы = Неопределено Тогда
		Объект.Запасы.Удалить(СтрокаТЧ);
		Возврат;
	КонецЕсли;
	
	СтрокаАкцизнаяМарка = Объект.АкцизныеМарки.Добавить();
	СтрокаАкцизнаяМарка.КлючСвязи = ДополнительныеПараметры.ТекущийКлючСвязи;
	СтрокаАкцизнаяМарка.КодАкцизнойМарки = РезультатОткрытияФормы.Штрихкод;
	СтрокаАкцизнаяМарка.АкцизнаяМарка    = РезультатОткрытияФормы.ШтрихкодУпаковки;
	СтрокаАкцизнаяМарка.Справка2         = РезультатОткрытияФормы.Справка2;
	
	СтрокаТЧ.НоменклатураЕГАИС    = РезультатОткрытияФормы.АлкогольнаяПродукция;
	СтрокаТЧ.Количество = 1;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод) Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
		СтруктураПараметров.Вставить("Характеристика", СтрокаТЧ.Характеристика);
		СтруктураПараметров.Вставить("Партия", СтрокаТЧ.Партия);
		СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТЧ.ЕдиницаИзмерения);
		
		СтрокаТЧ.Штрихкод = ИнтеграцияЕГАИСУНФВызовСервера.ПолучитьШтрихкодПоНоменклатуре(СтруктураПараметров);
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаАкцизнойМаркиТП(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	СтрокаТЧ = Объект.Запасы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОткрытияФормы = Неопределено Тогда
		Объект.Запасы.Удалить(СтрокаТЧ);
		Возврат;
	КонецЕсли;
	
	Если НЕ КодМаркировкиСоответствуетНоменклатуре(РезультатОткрытияФормы, ДополнительныеПараметры) Тогда
		Объект.Запасы.Удалить(СтрокаТЧ);
		Возврат;
	КонецЕсли;
	СтрокаТЧ.КодМаркировки = РезультатОткрытияФормы;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаСервере
Функция КодМаркировкиСоответствуетНоменклатуре(РезультатОткрытияФормы, ДополнительныеПараметры)
	
	СтрокаТЧ = Объект.Запасы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	
	Если СтрокаТЧ = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не выбрана строка в табличной части ""Товары и услуги"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	Иначе
		Возврат УправлениеНебольшойФирмойСервер.КодМаркировкиСоответствуетНоменклатуре(РезультатОткрытияФормы, СтрокаТЧ.Номенклатура, СтрокаТЧ.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВвестиАкцизнуюМарку(СтрокаТЧ)
	
	ИдентификаторСтроки = СтрокаТЧ.ПолучитьИдентификатор();
	Номенклатура = СтрокаТЧ.Номенклатура;
	ТекущийКлючСвязи = СтрокаТЧ.КлючСвязи;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура"         , Номенклатура);
	ПараметрыФормы.Вставить("КонтрольАкцизныхМарок", Истина);
	
	Если СтрокаТЧ.НеобходимостьВводаКодаМаркировки Тогда
		ПараметрыФормы.Вставить("КодыМаркировки", Истина);
	Конецесли;
	
	ПараметрыФормы.Вставить("ПредставлениеНоменклатуры", Строка(Номенклатура));
	ПараметрыФормы.Вставить("ТекущийКлючСвязи"         , ТекущийКлючСвязи);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ДополнительныеПараметры.Вставить("ТекущийКлючСвязи", ТекущийКлючСвязи);
	
	Если СтрокаТЧ.НеобходимостьВводаКодаМаркировки Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВводаАкцизнойМаркиТП", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("ОбщаяФорма.ФормаВводаАкцизнойМарки", ПараметрыФормы, ЭтаФорма, ,,,ОписаниеОповещения, РежимОткрытияОкнаФОрмы.БлокироватьОкноВладельца);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВводаАкцизнойМаркиАП", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Обработка.РаботаСАкцизнымиМаркамиЕГАИС.Форма.ФормаВводаАкцизнойМарки", ПараметрыФормы, ЭтаФорма, ,,,ОписаниеОповещения, РежимОткрытияОкнаФОрмы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьВводАкцизнойМарки(СтрокаТЧ)

	ВернутьЛожь = Ложь;
	Если НЕ ИспользуетсяРегистрацияРозничныхПродажВЕГАИС
		И НЕ ИспользуетсяМаркировкаТабачнойПродукции Тогда
		ВернутьЛожь = Истина;
	ИначеЕсли СтрокаТЧ = Неопределено Тогда
		ВернутьЛожь = Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		ВернутьЛожь = Истина;
	ИначеЕсли НЕ СтрокаТЧ.НеобходимостьВводаАкцизнойМарки
		И НЕ СтрокаТЧ.НеобходимостьВводаКодаМаркировки Тогда
		ВернутьЛожь = Истина;
	КонецЕсли;
	
	Если ВернутьЛожь Тогда
		ПересчитатьДокументНаКлиенте();
		Возврат Ложь;
	КонецЕсли;
	
	Если ИспользуетсяРегистрацияРозничныхПродажВЕГАИС 
		И НЕ ЗначениеЗаполнено(СтрокаТЧ.КлючСвязи) Тогда
		УправлениеНебольшойФирмойКлиентСервер.ЗаполнитьКлючСвязи(Объект.Запасы, СтрокаТЧ, "КлючСвязи");
	КонецЕсли;
	
	ВвестиАкцизнуюМарку(СтрокаТЧ);
	
КонецФункции

#КонецОбласти

#Область МеткиОтборов

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения, "СписокЗаказов");
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, СписокЗаказов, ИмяПоляОтбораСписка, "СписокЗаказов");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, СписокЗаказов, МеткаИД, "СписокЗаказов");

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект, "СписокЗаказов");
	
	Если Не УчетПоКомпанииВЦелом Тогда
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("ИспользоватьНастройкиПоУмолчанию", ИспользоватьНастройкиПоУмолчанию);
		ХранилищеНастроекДанныхФорм.Сохранить("ЧекККМФормаРМКДопНастройки", "СтруктураНастроек", СтруктураНастроек);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельКонтактнойИнформации

// УНФ.ПанельКонтактнойИнформации
&НаСервере
Процедура ОбновитьПанельКонтактнойИнформацииСервер()
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец УНФ.ПанельКонтактнойИнформации

#КонецОбласти

#Область РаботаССерийнымиНомерами

&НаКлиенте
Процедура ЗапасыСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера("Запасы");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерийныеНомераНачалоВыбора_МК(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера("ЗапасыМК");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийныеНомера(ИмяТЧ)
		
	ТекущиеДанныеИдентификатор = Элементы[ИмяТЧ].ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийныхНомеров = ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор);
	
	ОткрытьФорму("Обработка.ПодборСерийныхНомеров.Форма", ПараметрыСерийныхНомеров, ЭтотОбъект);

КонецПроцедуры

Функция ПолучитьСерийныеНомераИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	Модифицированность = Истина;
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки);
	
КонецФункции

Функция ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор)
	
	Возврат РаботаСФормойДокумента.ПараметрыПодбораСерийныхНомеров(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор);
	
КонецФункции

#КонецОбласти

#Область Наборы

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаменитьСтрокуЗапасовДаннымиНабора(Форма, СтрокаТабличнойЧасти, СтруктураДанные)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, СтрокаТабличнойЧасти, , Форма.ИспользоватьСерийныеНомераОстатки);
	
	НаборыКлиентСервер.ЗаменитьСтрокуДаннымиНабора(Объект, "Запасы", СтрокаТабличнойЧасти, СтруктураДанные); 
		
	Элементы.ЗапасыКартинкаНабора.Видимость = Истина;
			
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСоставНабора(СтрокаТабличнойЧасти)
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("НоменклатураНабора", СтрокаТабличнойЧасти.НоменклатураНабора);
	СтруктураОткрытия.Вставить("ХарактеристикаНабора", СтрокаТабличнойЧасти.ХарактеристикаНабора);
	ДобавленныеСтроки = Объект.ДобавленныеНаборы.НайтиСтроки(СтруктураОткрытия);
	СтрокиНабора = Объект.Запасы.НайтиСтроки(СтруктураОткрытия);
	Если ДобавленныеСтроки.Количество()=0 Тогда
		СтруктураОткрытия.Вставить("Количество", 1);
	Иначе
		СтруктураОткрытия.Вставить("Количество", ДобавленныеСтроки[0].Количество);
	КонецЕсли; 
	СтруктураОткрытия.Вставить("СоставНабора", Новый Массив);
	Для каждого Стр Из СтрокиНабора Цикл
		СтруктураСтроки = Новый Структура("Номенклатура,Характеристика,Количество,ДоляСтоимости,ЕдиницаИзмерения,Активная");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Стр);
		СтруктураСтроки.Активная = (Стр=СтрокаТабличнойЧасти); 
		СтруктураОткрытия.СоставНабора.Добавить(СтруктураСтроки);
	КонецЦикла; 
	ОткрытьФорму("РегистрСведений.СоставНаборов.Форма.ФормаРедактированияСостава", СтруктураОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоставНабора(НоменклатураНабора, ХарактеристикаНабора, КоличествоНаборов, СоставНабора)
	
	НаборыСервер.ОбновитьСоставНабораВТабличнойЧасти(НоменклатураНабора, ХарактеристикаНабора, , КоличествоНаборов, СоставНабора, Объект);
	Модифицированность = Истина;

	ЗаполнитьПризнакиИспользованияХарактеристик();
	
	// АвтоматическиеСкидки.
	СброситьФлагСкидкиРассчитаныСервер("ОбработкаПодбора");
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеКартинокНаборов(Запасы, ДобавленныеНаборы)
	
	Для каждого Стр Из Запасы Цикл
		Стр.КартинкаНабора = НаборыКлиентСервер.КартинкаНабора(Стр, ДобавленныеНаборы);
		Если Стр.КартинкаНабора>5 Тогда
			Стр.КартинкаНабора = ((Стр.КартинкаНабора - 1) % 5) + 1;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура ОбновитьПризнакиНабора(Запасы)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНаборы") Тогда
		Возврат;
	КонецЕсли; 
	
	МассивНоменклатуры = Новый Массив;
	Для каждого Стр Из Запасы Цикл
		Если ЗначениеЗаполнено(Стр.Номенклатура) И НЕ ЗначениеЗаполнено(Стр.НоменклатураНабора) И ТипЗнч(Стр.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			МассивНоменклатуры.Добавить(Стр.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивНоменклатуры)
		|	И Номенклатура.ЭтоНабор";
		Выборка = Запрос.Выполнить().Выбрать();
		ПараметрыНоменклатуры = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			ПараметрыНоменклатуры.Вставить(Выборка.Ссылка, Истина);	
		КонецЦикла; 
		
		Для каждого Стр Из Запасы Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Номенклатура) ИЛИ ЗначениеЗаполнено(Стр.НоменклатураНабора) ИЛИ ТипЗнч(Стр.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") Тогда
				Стр.ЭтоНабор = Ложь;
			Иначе
				Стр.ЭтоНабор = ПараметрыНоменклатуры.Получить(Стр.Номенклатура);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция  ХарактеристикиНабора(Номенклатура, Текст)
	
	СтруктураПараметров = Новый Структура();
	Если ПустаяСтрока(Текст) Тогда
		СтруктураПараметров.Вставить("СтрокаПоиска", Неопределено);
	Иначе
		СтруктураПараметров.Вставить("СтрокаПоиска", Текст);
	КонецЕсли; 
	СтруктураПараметров.Вставить("Отбор", Новый Структура);
	СтруктураПараметров.Отбор.Вставить("Владелец", Номенклатура);
	Возврат Справочники.ХарактеристикиНоменклатуры.ПолучитьДанныеВыбора(СтруктураПараметров);
	
КонецФункции
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АвторизацияПоОтветственному()
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаАвторизации", ЭтотОбъект, Новый Структура());
	ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаАвторизации_РМК", Новый Структура("Ответственный", Объект.Ответственный), ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАвторизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если ЗначениеЗаполнено(Результат.Ответственный) Тогда
			Объект.Ответственный = Результат.Ответственный;
			
			СформироватьЗаголовокНаКлиенте(СтруктураСостояниеКассовойСмены);
			
			ТекстСообщения = НСтр("ru = '%ИмяОтветственного'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОтветственного", Строка(Объект.Ответственный));
			
			ПоказатьОповещениеПользователя(НСтр("ru = 'Выбран ответственный'"),,ТекстСообщения, БиблиотекаКартинок.ПользовательБезНеобходимыхСвойств);
			
			БылаАвторизация = Истина;
			
		Иначе
			ЭтаФорма.Модифицированность = Ложь;
			ЭтаФорма.Закрыть();
		КонецЕсли;
		
	Иначе
		АвторизацияПоОтветственному();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоставИПанельКонтактнойИнформации(ТекЗаказ)
	
	Если КонтрагентАктивнойСтроки <> ТекущийКонтрагент Тогда
		ТекущийКонтрагент = КонтрагентАктивнойСтроки;
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	
	Если ТекЗаказ <> Неопределено Тогда
		ЗаполнитьСоставЗаказаИСсылкиНаДокументыНаСервере(ТекЗаказ);
	Иначе
		СоставЗаказа = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСпискаЗаказов()
	
	Если Элементы.СписокЗаказов.ТекущиеДанные <> Неопределено Тогда
		ОбновитьСоставИПанельКонтактнойИнформации(Элементы.СписокЗаказов.ТекущиеДанные.Ссылка);
	Иначе
		ОбновитьСоставИПанельКонтактнойИнформации(Неопределено);
	КонецЕсли;
	ОтключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСпискаЗаказов");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
		СписокЗаказов.КомпоновщикНастроек.Настройки.УсловноеОформление,
		Метаданные.Справочники.СостоянияЗаказовПокупателей.ПолноеИмя()
	);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТекущиеДела()
	
	Если НЕ Параметры.Свойство("ТекущиеДела") Тогда
		Возврат;
	КонецЕсли;
	
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru='Заказы покупателей'");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", Ложь);
	
	РаботаСОтборами.СоздатьЭлементыМеток(ЭтотОбъект, "Закрыт", "ГруппаОтборЗакрыт", Ложь, НСтр("ru='Не закрытые'"));
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, "Закрыт");
	
	РаботаСОтборами.ПрикрепитьМеткиОтбораИзМассива(ЭтотОбъект, "Ответственный", "ГруппаОтборОтветственный", УправлениеНебольшойФирмойСервер.ПолучитьСотрудниковПользователя());
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, "Ответственный");
	
	Если Параметры.Свойство("ПросроченоВыполнение") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='просрочено выполнение'");
		Список.УстановитьОбязательноеИспользование("ПросроченоВыполнение", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПросроченоВыполнение", Истина);
		
	ИначеЕсли Параметры.Свойство("ПросроченаОплата") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='просрочена оплата'");
		Список.УстановитьОбязательноеИспользование("ПросроченаОплата", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПросроченаОплата", Истина);
		
	ИначеЕсли Параметры.Свойство("НаСегодня") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='на сегодня'");
		Список.УстановитьОбязательноеИспользование("НаСегодня", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НаСегодня", Истина);
		
	ИначеЕсли Параметры.Свойство("ВРаботе") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='в работе'");
		Список.УстановитьОбязательноеИспользование("ЗаказВРаботе", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказВРаботе", Истина);
		
	ИначеЕсли Параметры.Свойство("Новые") Тогда
		
		Заголовок = Заголовок + ": " + НСтр("ru='новые'");
		Список.УстановитьОбязательноеИспользование("ЗаказНовый", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказНовый", Истина);
		
	КонецЕсли;
	
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	РаботаСОтборами.ОбновитьЭлементыМеток(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтогов(Команда)
	
	ОчиститьСообщения();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Выполнить сверку итогов на эквайринговом терминале?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговВопросЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьСверкуИтогоПриЗакрытииСменыПриИзменении(Элемент)
	
	// РМК
	РабочееМестоКассираВызовСервера.ОбновитьНастройкиРМК(НастройкаРМК, НеПоказыватьПриОткрытииФормуВыбораКассы, СверятьИтогиНаЭТПриЗакрытииСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Имя = "ЗапасыЦена" ИЛИ Элемент.ТекущийЭлемент.Имя = "ЗапасыЦена_МК" Тогда
		Если НЕ ПродажаСоСклада И РазрешеноРедактированиеЦенДокументов Тогда
			Отказ = Истина;
			ПоказатьПредупреждение(Неопределено, "Цену можно установить в карточке номенклатуры. В рабочем месте кассира можно менять цену только при продаже с оптового склада.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьЦенуСертификата(Результат, ВыбраннаяСтрока) Экспорт
	
	Если Не Результат = Неопределено Тогда
		ВыбраннаяСтрока.Цена = Результат;
		РассчитатьСуммуВСтрокеТабличнойЧасти();
	КонецЕсли;
	
Конецпроцедуры

// Устанавливает условное оформления Таб. частей для отображения доступности характеристик
//
&НаСервере
Процедура ОбновитьУсловноеОформлениеТабличнойЧастиДляХарактеристикИПартий()
			
			НаименованиеПоляХарактеристика = "ЗапасыХарактеристика";
			НаименованиеПоляХарактеристикаОприходование = "ЗапасыХарактеристикаОприходование";
			
			НаименованиеПоляПартия = "ЗапасыПартия";
			НаименованиеПоляПартияОприходование = "ЗапасыПартияОприхдование";

			
			ЗначениеПоиска = ЭтаФорма.Элементы.Найти(НаименованиеПоляХарактеристика);
			ЗначениеПоискаХарактеристикаОприходование = ЭтаФорма.Элементы.Найти(НаименованиеПоляХарактеристикаОприходование);
			
			ЗначениеПоискаПартия = ЭтаФорма.Элементы.Найти(НаименованиеПоляПартия);
			ЗначениеПоискаПартияОприходование = ЭтаФорма.Элементы.Найти(НаименованиеПоляПартияОприходование);

			
			Если НЕ ЗначениеПоиска = Неопределено
				Тогда
				ИмяПоляПроверятьЗаполнениеХарактеристики = "Объект.Запасы.ПроверятьЗаполнениеХарактеристики";
				ИмяПоляИспользоватьХарактеристики = "Объект.Запасы.ИспользоватьХарактеристики";
				ИмяПоляХарактеристики = НаименованиеПоляХарактеристика;
				
				НовоеУсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляИспользоватьХарактеристики, Ложь, ВидСравненияКомпоновкиДанных.Равно);
		
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = '<Не используется>'"));
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
				
				НовоеУсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеХарактеристики, Истина, ВидСравненияКомпоновкиДанных.Равно);
				
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
				
				НовоеУсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
				
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
			КонецЕсли;
			
			Если НЕ ЗначениеПоискаПартия = Неопределено
				Тогда
				ИмяПоляПроверятьЗаполнениеПартии = "Объект.Запасы.ПроверятьЗаполнениеПартий";
				ИмяПоляИспользоватьПартии = "Объект.Запасы.ИспользоватьПартии";
				ИмяПоляПартии = НаименованиеПоляПартия;
				
				НовоеУсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляИспользоватьПартии, Ложь, ВидСравненияКомпоновкиДанных.Равно);
		
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляПартии);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Текст", НСтр("ru = '<Не используется>'"));
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ТолькоПросмотр", Истина);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти);
				
				НовоеУсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеПартии, Истина, ВидСравненияКомпоновкиДанных.Равно);
				
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляПартии);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
				
				НовоеУсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
				
				РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.Запасы.Партия", Справочники.ПартииНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
				РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляПартии);
				РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
			КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуДисконтнойКарты()
	
	РозничныеПродажиСервер.ОбновитьКартинкуДисконтнойКарты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация)
	
	Если Не Контрагент.ВестиРасчетыПоДоговорам Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоговора(Элементы, Контрагент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Договор",
		"Видимость",
		ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаСервере
Функция ОрганизацияЗаказаПодходит(СсылкаНаЗаказ)
	
	Если Константы.УчетПоКомпании.Получить() Тогда
		Результат = Истина;
	ИначеЕсли СсылкаНаЗаказ.Организация = Объект.Организация Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ГосИС
&НаСервере
Процедура УдалитьАкцизныеМарки(Данные, Отказ)
	
	ИнтеграцияИСУНФ.УдалитьАкцизныеМаркиЧека(ЭтотОбъект, Данные, Отказ);
	
	ИнтеграцияИСУНФ.АкцизныеМаркиЗаполнитьСлужебныеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеОбработкиШтрихкодов(РезультатОбработкиШтрихкода, КэшированныеЗначения)
	
	Модифицированность = Истина;
	Если РезультатОбработкиШтрихкода.ТребуетсяОбработкаШтрихкода Тогда
		
		ШтрихкодДляОбработки = РезультатОбработкиШтрихкода.ИсходныеДанные;
		
	Иначе
		
		ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
		
		СуммаТоваров = Объект.Запасы.Итог("Всего");
		Если Не Объект.ОперацияСДенежнымиСредствами Тогда
			Объект.СуммаДокумента = СуммаТоваров;
		КонецЕсли;
	
		СуммаСдачи = Объект.БезналичнаяОплата.Итог("Сумма")
				   + Объект.Предоплата.Итог("СуммаРасчетов")
				   + Объект.ПолученоНаличными
				   - Объект.СуммаДокумента;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВидыПродукцииВЗапасахСервер()
	
	Возврат ИнтеграцияИСУНФ.ВидыПроцукцииВЗапасах(Объект.Запасы);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСканированияТабачнойПродукции()
	
	СтандартнаяОбработка = Ложь;
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
		Истина,
		"Документ.ЧекККМ.Форма.ФормаДокументаРМК.ОткрытьФормуСканированияТабачнойПродукции");
	
		ПроверкаИПодборПродукцииМОТПКлиент.ДекорацияСканироватьПроверитьТоварыОбработкаНавигационнойСсылки(
			ЭтотОбъект,
			ПроверкаИПодборПродукцииМОТПКлиентСервер.НавигационнаяСсылкаОткрытьФормуПроверкиИПодбора(),
			СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеОтгружаемойПродукцииПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЭтоАдресВременногоХранилища(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	СканированиеОтгружаемойПродукцииПослеЗакрытияНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПроверкиИПодбора(Результат, ДополнительныеПараметры) Экспорт
	
	ПриЗакрытииФормыПроверкиИПодбораНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииФормыПроверкиИПодбораНаСервере(Результат, ДополнительныеПараметры)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		ДанныеПроверкиИПодбора = ПолучитьИзВременногоХранилища(Результат);
		
		ИнтеграцияИСУНФ.УдалитьСтрокиАкцизныхМарокПоВидуПродукции(Объект.АкцизныеМарки, Перечисления.ВидыПродукцииИС.Табачная);
		
		ИнтеграцияИСУНФ.УдалитьСтрокиЗапасовПоВидуПродукции(Объект.Запасы, Перечисления.ВидыПродукцииИС.Табачная);
		
		ДобавленныеСтроки = Новый Массив;
		Для Каждого СтрокаПродукции Из ДанныеПроверкиИПодбора.ТаблицаПодобраннойПровереннойПродукции Цикл
			НоваяСтрокаТоваров = Объект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, СтрокаПродукции);
			ДобавленныеСтроки.Добавить(НоваяСтрокаТоваров);
		КонецЦикла;
		
		Для Каждого СтрокаАкцизныхМарок Из ДанныеПроверкиИПодбора.ТаблицаШтрихкодовВерхнегоУровня Цикл
			НоваяСтрокаАкцизныхМарок = Объект.АкцизныеМарки.Добавить();
			НоваяСтрокаАкцизныхМарок.АкцизнаяМарка = СтрокаАкцизныхМарок.ШтрихкодУпаковки;
		КонецЦикла;
		
		ОбработатьСтрокиТЧ(ДобавленныеСтроки, Новый Массив);
	
		ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СканированиеОтгружаемойПродукцииПослеЗакрытияНаСервере(АдресВременногоХранилища)
	
	РезультатПроверки = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	ДеревоУпаковок = РезультатПроверки.ДеревоМаркируемойПродукции;
	ДеревоУпаковок.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	
	ШтрихкодыУпаковок = ШтрихкодированиеИС.ШтрихкодыУпаковок(
		ИнтеграцияЕГАИС.ЗначенияШтрихкодовИзДереваУпаковок(ДеревоУпаковок));
	
	ИнтеграцияИСУНФ.УдалитьСтрокиАкцизныхМарокПоВидуПродукции(Объект.АкцизныеМарки, Перечисления.ВидыПродукцииИС.Алкогольная);
	
	Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодыУпаковок(
		ДеревоУпаковок,
		ШтрихкодыУпаковок);
	
	ПараметрыЗаполнения = АкцизныеМаркиЕГАИС.ПараметрыЗаполненияТоваровИАкцизныхМарок(ЭтотОбъект, Ложь);
	ПараметрыЗаполнения.ЕстьСправка2                   = Ложь;
	ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция = "НоменклатураЕГАИС";
	
	Документы.ЧекККМ.ЗаполнитьТоварыИАкцизныеМарки(
		Объект, ДеревоУпаковок, ПараметрыЗаполнения);
	
	ОбработатьСтрокиТЧ(
		ПараметрыЗаполнения.ДобавленныеСтроки,
		ПараметрыЗаполнения.ИзмененныеСтроки);
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	
	ИнтеграцияИСУНФ.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, Объект.Запасы);
	
	ИнтеграцияИСУНФ.АкцизныеМаркиЗаполнитьСлужебныеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция АдресДанныхПроверкиАлкогольнойПродукции()
	
	ДанныеХранилища = Новый Структура("ДеревоУпаковок, ТаблицаАлкогольнойПродукцииКОпределениюСправок2",
		Неопределено,
		Новый ТаблицаЗначений);
		
	ДанныеХранилища.ДеревоУпаковок = АкцизныеМаркиЕГАИС.ШтрихкодыУпаковок(
		Объект,
		Объект.ОрганизацияЕГАИС,
		"НоменклатураЕГАИС",
		Истина).ДеревоУпаковок;
	
	ДанныеХранилища.ТаблицаАлкогольнойПродукцииКОпределениюСправок2 = Документы.ЧекККМ.ТаблицаАлкогольнойПродукцииКОпределениюСправок2(Объект);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеХранилища);
	
КонецФункции

&НаСервере
Функция АдресДанныхПроверкиТабачнойПродукции()
	
	ПараметрыСканирования = ШтрихкодированиеИСКлиентСервер.ИнициализироватьПараметрыСканирования(ЭтотОбъект, Перечисления.ВидыПродукцииИС.Табачная);
	
	СписокШтрихкодов = Объект.АкцизныеМарки.Выгрузить().ВыгрузитьКолонку("АкцизнаяМарка");
	ШтрихкодыТабачнойПродукции = ИнтеграцияИСУНФ.ШтрихкодыСодержащиеВидыПродукции(
		СписокШтрихкодов,
		Перечисления.ВидыПродукцииИС.Табачная);
	
	ДанныеПроверяемогоДокумента = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
		ШтрихкодыТабачнойПродукции, ПараметрыСканирования);
		
	ТаблицаТабачнойПродукции = Новый ТаблицаЗначений;
	ИнтеграцияМОТПУНФ.СформироватьТаблицуТабачнойПродукцииДокумента_Партия(Объект, ТаблицаТабачнойПродукции);

	ДанныеХранилища = Новый Структура("ДеревоУпаковок, МаркированныеТовары, ТаблицаТабачнойПродукции",
		ДанныеПроверяемогоДокумента.ДеревоУпаковок,
		ДанныеПроверяемогоДокумента.МаркированныеТовары,
		ТаблицаТабачнойПродукции);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеХранилища, УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ОбработатьСтрокиТЧ(ДобавленныеСтроки, ИзмененныеСтроки, КэшированныеЗначения = Неопределено)
	
	Для Каждого ДобавленнаяСтрока Из ДобавленныеСтроки Цикл
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Организация", Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура", ДобавленнаяСтрока.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", ДобавленнаяСтрока.Характеристика);
		СтруктураДанные.Вставить("Партия", ДобавленнаяСтрока.Партия);
		СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
		
		Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
			СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
			СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
			СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
			СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
			СтруктураДанные.Вставить("Коэффициент", 1);
			СтруктураДанные.Вставить("Содержание", "");
			СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
		СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
		
		СтатусПартии = Новый СписокЗначений;
		СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
		
		СтруктураДанные.Вставить("СтатусПартии", СтатусПартии);
		СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, СтруктураДанные);
		
		// МОТП
		ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
		// Конец МОТП
		
		Если РежимОстаткиИРезервы Тогда
			ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(СтруктураДанные, ДобавленнаяСтрока.Номенклатура);
		КонецЕсли
		
	КонецЦикла;
	
КонецПроцедуры
// Конец ГосИС

&НаКлиенте
Процедура СпозиционироватьНаПоискеНоменклатура()
	
	Если Не ЭтаФорма.ТекущийЭлемент = Элементы.ЗначениеПоискаНоменклатуры Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ЗначениеПоискаНоменклатуры;
		ЗначениеПоискаНоменклатуры = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпозиционироватьНаПоискеШК()
	
	Если Не ЭтаФорма.ТекущийЭлемент = Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ЗначениеПоискаНоменклатурыПоШтрихКоду;
		ЗначениеПоискаНоменклатурыПоШтрихКоду = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаБыстрыхТоваровОбработкаКоманды(ИмяЭлементаОткрытия = "")
	
	Если ЗначениеЗаполнено(НастройкаРМК) Тогда
		СтруктураПараметров = Новый Структура("Ключ, ИмяСтраницы", НастройкаРМК, ИмяЭлементаОткрытия);
		ОткрытьФорму("Справочник.НастройкиРМК.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана настройка РМК";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникНастройкиРМК()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ОбъектНастройка = НастройкаРМК.ПолучитьОбъект();
		ОбъектНастройка.ПоискНоменклатурыПоШтрихКоду = ПоискНоменклатурыПоШтрихКоду;
		ОбъектНастройка.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = Не изменина настройка быстрого поиска. '") + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки1(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаКлиенте
Процедура ВыборИзСпискаБыстрыхТоваровМКЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ВыбранБыстрыйТовар(Неопределено, Результат);
		НастроитьЗакладкиПродажиМК();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧек(Команда)
	
	Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница = Элементы.ГруппаПродажаМК;
	Элементы.ГруппаСтраницыПродажаМК.ТекущаяСтраница = Элементы.ГруппаНетДанных;
	Элементы.ПечатьТоварногоЧека_МК.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	ПоискПоШтрихкоду(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавлениеНоменклатуры_МК", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Новый Структура("РежимВыбора, ТекущаяСтрока", Истина, ВыбранныйТовар), ЭтаФорма,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНоменклатуры_МК(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = Результат;
		Элементы.ЗапасыМК.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ЗапасыНоменклатураПриИзменении_МК(Неопределено);
		НастроитьЗакладкиПродажиМК();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПоискаНоменклатуры_МК_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗначениеПоискаНоменклатуры = Результат;
		ЗначениеПоискаНоменклатурыПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоискНоменклатурыНажатие(Элемент)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ФормаПоискаНоменклатуры_МК_Завершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаПоискаНоменклатуры_МК",, ЭтаФорма,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоискНоменклатуры1Нажатие(Элемент)
	
	Если ЗначениеЗаполнено(НастройкаРМК) Тогда
		СтруктураПараметров = Новый Структура("Ключ", НастройкаРМК);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборИзСпискаБыстрыхТоваровМКЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.НастройкиРМК.Форма.ФормаЭлемента", СтруктураПараметров, ЭтотОбъект, УникальныйИдентификатор,,, ОповещениеОЗакрытии);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрана настройка РМК'");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказОчистка(Элемент, СтандартнаяОбработка)
	
	ИнициализироватьНовыйЧек();
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиИРезервы

&НаКлиенте
Процедура ОстаткиИРезервы(Команда)
	
	РежимОстаткиИРезервы = Не РежимОстаткиИРезервы;
	
	Если Элементы.ГруппаПродажаИВозврат.ТекущаяСтраница.Имя = "ГруппаПродажа" Тогда
		Элементы.ОстаткиИРезервы.Пометка = Не Элементы.ОстаткиИРезервы.Пометка;
	Иначе
		Элементы.ЗапасыМККонтекстноеМенюОстаткиИРезервы.Пометка = Не Элементы.ЗапасыМККонтекстноеМенюОстаткиИРезервы.Пометка;
	КонецЕсли;
	
	ОбновитьОтображениеКолонокВРазрезеЗапасов();
	
	Если РежимОстаткиИРезервы Тогда ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере() КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКолонокВРазрезеЗапасов()
	
	Если Не ЭтоМобильныйКилент Тогда
		Элементы.ЗапасыКонтекстноеМенюГруппаРаботаССтроками.Видимость = РежимОстаткиИРезервы;
		Элементы.ГруппаОстатки.Видимость = РежимОстаткиИРезервы;
		Элементы.ЗапасыКонтекстноеМенюГруппаРаботаССтроками.Видимость = РежимОстаткиИРезервы;
	Иначе
		Элементы.ГруппаОстатки_МК.Видимость = РежимОстаткиИРезервы;
		Элементы.ЗапасыМККонтекстноеМенюГруппаРаботаССтроками.Видимость = РежимОстаткиИРезервы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзВыпадающегоСпискаТабличнойЧасти(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда Возврат КонецЕсли;
	
	ПоказатьЗначение(,Результат.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначенияОстатковПоНоменклатуре(ТекущиеДанные)
	
	Если РежимОстаткиИРезервы Тогда
		СтруктураДанные = Новый Структура;
		
		СтруктураДанные.Вставить("Организация", Компания);
		СтруктураДанные.Вставить("Номенклатура", 	ТекущиеДанные.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", 	ТекущиеДанные.Характеристика);
		СтруктураДанные.Вставить("Партия", 	ТекущиеДанные.Партия);
		СтруктураДанные.Вставить("ИспользоватьХарактеристики", ТекущиеДанные.ИспользоватьХарактеристики);
		СтруктураДанные.Вставить("ИспользоватьПартии", ТекущиеДанные.ИспользоватьПартии);
		
		ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(СтруктураДанные, ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДублиСтрок(Команда)
	
	СтрокаТабличнойЧасти = ?(ЭтоМобильныйКилент, Элементы.ЗапасыМК.ТекущиеДанные, Элементы.Запасы.ТекущиеДанные);
	ИмяДекорации = ?(ЭтоМобильныйКилент, "ДекорацияОтборПоДублямМК", "ДекорацияОтборПоДублям");
	ИмяКоманды = ?(ЭтоМобильныйКилент, "ЗапасыМККонтекстноеМенюПоказатьДублиСтрок", "ЗапасыКонтекстноеМенюПоказатьДублиСтрок");
	ИмяТЧ = ?(ЭтоМобильныйКилент, "ЗапасыМК", "Запасы");
	
	Если Не Элементы[ИмяДекорации].Видимость Тогда
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Партия"
		, СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика, СтрокаТабличнойЧасти.Партия);
		
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() <=1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Дубли строки не найдены.'");
			Сообщение.КлючДанных = Объект.Ссылка;
			Сообщение.Сообщить();
			Возврат
		КонецЕсли;
		
		Если Элементы.Запасы.ОтборСтрок <> Неопределено Тогда
			Элементы.Запасы.ОтборСтрок = Неопределено;
		КонецЕсли;
		
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("Номенклатура, Характеристика, Партия"
		, СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика, СтрокаТабличнойЧасти.Партия);
		
		Элементы[ИмяКоманды].Пометка = Истина;
		
		Элементы[ИмяДекорации].Заголовок = ИнформацияОбОтборе(СтрокаТабличнойЧасти.НомерСтроки);
		Элементы[ИмяДекорации].Видимость = Истина;
		
		Элементы[ИмяТЧ].ОтборСтрок = ПараметрыОтбора;
		
	Иначе
		Элементы[ИмяКоманды].Пометка = Ложь;
		Элементы[ИмяДекорации].Видимость = Ложь;
		Элементы[ИмяТЧ].ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтборПоДублямОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоМобильныйКилент Тогда
		Элементы.ЗапасыМККонтекстноеМенюПоказатьДублиСтрок.Пометка = Ложь;
		Элементы.ДекорацияОтборПоДублямМК.Видимость = Ложь;
		Элементы.ЗапасыМК.ОтборСтрок = Неопределено;
	Иначе
		Элементы.ЗапасыКонтекстноеМенюПоказатьДублиСтрок.Пометка = Ложь;
		Элементы.ДекорацияОтборПоДублям.Видимость = Ложь;
		Элементы.Запасы.ОтборСтрок = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ИнформацияОбОтборе(НомерСтрокиПредставление)
	ТекстСообщения = НСтр("ru = 'Дубли строки '");
	Возврат НоменклатураВДокументахСервер.ИнформацияОбОтборе(ТекстСообщения + Строка(НомерСтрокиПредставление));
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиНаСервере(СтруктураДанные = Неопределено, НоменклатураОтбора = Неопределено)
	
	НоменклатураВДокументахСервер.ЗаполнитьЗначенияОстатковНоменклатурыВТабличнойЧастиЧекККМ_РМК(Объект, СтруктураДанные, НоменклатураОтбора);
	НоменклатураВДокументахСервер.ЗаполнитьПризнакТипаЗапасНоменклатуры(Объект);
	
КонецПроцедуры

&НаСервере
Функция СписокДокументовПоЗаказу(ТипОперации, СтруткураПараметров)
	Возврат НоменклатураВДокументахСервер.СписокДокументовПоЗаказу(Объект, ТипОперации,СтруткураПараметров);
КонецФункции

&НаКлиенте
Процедура ОрганизацияИзККМ(Команда)
	
	Элементы.ОтборОрганизацияКонтекстноеМенюОрганизацияИзККМ.Пометка = Не Элементы.ОтборОрганизацияКонтекстноеМенюОрганизацияИзККМ.Пометка;
	ИспользоватьНастройкиПоУмолчанию = Элементы.ОтборОрганизацияКонтекстноеМенюОрганизацияИзККМ.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтветственного(Команда)
	АвторизацияПоОтветственному();
КонецПроцедуры

#КонецОбласти