
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ОтборВидаЦен;
	
	Если Параметры.Свойство("ВидЦены", ОтборВидаЦен) <> Истина
		ИЛИ НЕ ЗначениеЗаполнено(ОтборВидаЦен) Тогда
		
		ВызватьИсключение НСтр("ru ='Самостоятельное использование формы не предусмотрено.'"); 
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПрайсЛисты, "ВидыЦен.ВидЦен", ОтборВидаЦен, ВидСравненияКомпоновкиДанных.Равно, "ВидЦен", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПрайсЛист(Команда)
	
	ДанныеТекущейСтроки = Элементы.ПрайсЛисты.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ФормированиеПрайсЛистов.Форма", Новый Структура("ПрайсЛист", ДанныеТекущейСтроки.Ссылка), ЭтаФорма);
	
КонецПроцедуры
