
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;	
	
	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(ТекущаяЗапись.Характеристика) 
			И ТекущаяЗапись.РежимЗагрузкиХарактеристик <> Перечисления.РежимыЗагрузкиХарактеристикРаботаСНоменклатурой.Сопоставление Тогда
			
			ТекущаяЗапись.РежимЗагрузкиХарактеристик = Перечисления.РежимыЗагрузкиХарактеристикРаботаСНоменклатурой.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
