
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Если ЕстьПланыОбмена() Тогда
			ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ФормаСписка",
				,
				,
				ПараметрКоманды,
				ПараметрыВыполненияКоманды.Окно
			);
		Иначе
			ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ФормаПодключения",
				,
				,
				ПараметрКоманды,
				ПараметрыВыполненияКоманды.Окно
			);
		КонецЕсли;
	ИначеЕсли МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность20() Тогда
		ОткрытьФорму("ПланОбмена.СинхронизацияМП.Форма.ФормаПодключения",,,ПараметрКоманды, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МобильныйКлиент",
				,
				,
				ПараметрКоманды,
				ПараметрыВыполненияКоманды.Окно
			);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьПланыОбмена()
	
	ВыборкаПлановОбмена = ПланыОбмена.МобильноеПриложение.Выбрать();
	ВыборкаПлановОбмена.Следующий();
	Если ВыборкаПлановОбмена.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
