#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Организация) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[0].ДоговорКонтрагента, "Организация");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Контрагент) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[0].ДоговорКонтрагента, "Владелец");;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
