////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, предназначенные для группового изменения строк в табличной
//  части и управления оформлением панели редактирования.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при создании формы на сервере; заполняет список выбора поля ввода Действие панели редактирования таблицы.
//
// Параметры:
//  НаборЭлементов - Структура - набор необходимых реквизитов и элементов формы, входящих в панель редактирования.
//    * ДокументСсылка  - ДокументСсылка - Ссылка на документ, в котором происходит редактирование ТЧ.
//    * ИмяТЧ  - Строка - Имя ТЧ, которая будет редактироваться.
//    * ДействиеЭлемент - ПолеФормы - Элемент формы, содержащий выбранное действие для группового изменения строк.
//  Действие       - ПеречислениеСсылка - Выбранное действие для группового изменения строк.
//
Процедура ПриСозданииНаСервере(НаборЭлементов, Действие) Экспорт
	
	НаборЭлементов.ПанельРедактирования.Видимость = Ложь;
	НаборЭлементов.КолонкаПометка.Видимость = Ложь;
	НаборЭлементов.КолонкаПометка.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	НаборЭлементов.КолонкаНомерСтроки.Видимость = Истина;
	
	КлючОбъекта = ТипЗнч(НаборЭлементов.ДокументСсылка);
	КлючНастроек = "ГрупповоеИзменениеСтрок_" + НаборЭлементов.ИмяТЧ;
	Действие = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек);
	
КонецПроцедуры

// Управляет видимостью командной панели
Процедура ПоказатьСкрытьПанельРедактирования(Форма, НаборЭлементов, СостояниеПерехода, ИзменяетДанные = Неопределено) Экспорт
	
	ВидимостьПанели = НЕ НаборЭлементов.ПанельРедактирования.Видимость;
	НаборЭлементов.ПанельРедактирования.Видимость = ВидимостьПанели;
	
	СостояниеПерехода = ?(ВидимостьПанели, 1, 0);
	НастроитьОформлениеПанелиРедактирования(Форма, НаборЭлементов, СостояниеПерехода, Неопределено, ИзменяетДанные);
	
	ГрупповоеИзменениеСтрокКлиентСервер.УстановитьПредставлениеДействия(НаборЭлементов, Ложь);
	
КонецПроцедуры

// Записывает в пользовательские настройки последнее выбранное действие для изменения таблицы.
// Вызывается при закрытии формы.
//
// Параметры:
//  НаборЭлементов - Структура - набор необходимых реквизитов и элементов формы, входящих в панель редактирования.
//    * ДокументСсылка  - ДокументСсылка - Ссылка на документ, в котором происходит редактирование ТЧ.
//    * ИмяТЧ - Строка - Имя ТЧ, которая будет редактироваться.
//    * ДействиеЭлемент - ПолеФормы - Элемент формы, содержащий выбранное действие для группового изменения строк.
//  Действие       - ПеречислениеСсылка - Выбранное действие для группового изменения строк.
//
Процедура СохранитьНастройки(НаборЭлементов) Экспорт
	
	КлючОбъекта = ТипЗнч(НаборЭлементов.ДокументСсылка);
	КлючНастроек = "ГрупповоеИзменениеСтрок_" + НаборЭлементов.ИмяТЧ;
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, НаборЭлементов.Действие);
	
КонецПроцедуры

// Получает строковое представление действия.
//
// Параметры:
//  ДействиеПеречисление - ПеречислениеСсылка.ДействияГрупповогоИзмененияСтрок - Действие, описание которого необходимо получить.
// Возвращаемое значение:
//  Строка - Представление действия.
Функция ПредставлениеДействия(ДействиеПеречисление) Экспорт
	
	ДействиеПредставление = Строка(ДействиеПеречисление);
	Возврат Лев(ДействиеПредставление, СтрНайти(ДействиеПредставление, "@") - 1);
	
КонецФункции

Процедура НастроитьИсходнуюПанельРедактирования(Значение, НаборЭлементов) Экспорт
	
	Значение = "";
	НаборЭлементов.ЗначениеЭлемент.Заголовок = "Значение";
	ТипСтрока = Новый Массив;
	ТипСтрока.Добавить(Тип("Строка"));
	НаборЭлементов.ЗначениеЭлемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтрока);
	
КонецПроцедуры

// Управляет оформлением панели редактирования таблицы.
//
// Параметры:
//  ЭтаФорма         - УправляемаяФорма - Форма, в которой происходит групповое изменение строк ТЧ.
//  НаборЭлементов   - Структура - набор необходимых реквизитов и элементов формы, входящих в панель редактирования.
//    * ПанельРедактирования - ГруппаФормы - Группа формы, непосредственно являющаяся панелью редактирования ТЧ.
//    * ГруппаДействие - ГруппаФормы - Группа формы, содержащая поле выбора действия для группового изменения строк.
//    * ГруппаЗначение - ГруппаФормы - Группа формы, содержащая поле ввода значения для группового изменения строк.
//    * ГруппаВыполнить - ГруппаФормы - Группа формы, содержащая кнопку формы, запускающую обработку ТЧ.
//    * КнопкаВыполнитьДействие - КнопкаФормы - Кнопка формы, запускающая обработку ТЧ.
//    * КолонкаПометка - ПолеФормы - Пометка строки.
//    * КолонкаНомерСтроки - ПолеФормы - Номер строки.
//    * Действие - ПеречислениеСсылка.ДействияГрупповогоИзмененияСтрок - Выбранное действие для группового изменения строк.
//    * ЗначениеЭлемент - ПолеФормы - Поле ввода значения для группового изменения строк.
//    * ОбъектИзменений - Строка - Название элемента формы, входящего в состав ТЧ, над которым будут производиться изменения.
//    * КолонкаОбъектИзменений - ПолеФормы - Элемент формы, входящего в состав ТЧ, над которым будут производиться изменения.
//  Состояние        - Число - Состояние формы, к которому происходит переход.
//    * 0 - Панель скрыта.
//    * 1 - Выбор действия.
//    * 2 - Выбор значения.
//    * 3 - Применение изменений.
//    * 4 - Представление изменений.
//  Значение         - ПроизвольноеЗначение - Значение, которое используется для изменения значений колонки ТЧ при групповом изменении строк.
//  ИзменяетЗначение - Булево - Определяет, нужно ли загрузить исходное состояние редактируемой ТЧ
//                              при скрытии панели редактирования.
//
Процедура НастроитьОформлениеПанелиРедактирования(ЭтаФорма, НаборЭлементов, Состояние, Значение, ИзменяетЗначение = Неопределено) Экспорт
	
	Если Состояние = 2 И НаборЭлементов.Действие = Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки Тогда
		Состояние = 3;
	КонецЕсли;
	
	Если Состояние = 0 Тогда
		
		// 0. Панель скрыта
		Если ЗначениеЗаполнено(ИзменяетЗначение) И ИзменяетЗначение Тогда
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
		
		НаборЭлементов.ПанельРедактирования.Видимость = Ложь;
		НаборЭлементов.КолонкаПометка.Видимость = Ложь;
		НаборЭлементов.КолонкаПометка.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
		НаборЭлементов.КолонкаНомерСтроки.Видимость = Истина;
		НаборЭлементов.КолонкаНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
		
	ИначеЕсли Состояние = 1 Тогда
		// 1. Выбор действия
		
		НаборЭлементов.КолонкаПометка.Видимость = Истина;
		НаборЭлементов.КолонкаПометка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
		НаборЭлементов.КолонкаНомерСтроки.Видимость = Ложь;
		НаборЭлементов.КолонкаНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
		НаборЭлементов.ПанельРедактирования.Видимость = Истина;
		
		Значение = НаборЭлементов.ЗначениеЭлемент.ОграничениеТипа.ПривестиЗначение("");
		
	ИначеЕсли Состояние = 2 Тогда
		// 2. Выбор значения
		
		Если НаборЭлементов.Действие <> Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки Тогда
			НаборЭлементов.ЗначениеЭлемент.Видимость = Истина;
		КонецЕсли;
		
		Значение = НаборЭлементов.ЗначениеЭлемент.ОграничениеТипа.ПривестиЗначение("");
		
		Если НаборЭлементов.ЗначениеЭлемент.Видимость Тогда
			ЭтаФорма.ТекущийЭлемент = НаборЭлементов.ЗначениеЭлемент;
		Иначе
			ЭтаФорма.ТекущийЭлемент = НаборЭлементов.КнопкаВыполнитьДействие;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеРезервнымиКопиями(Форма, Таблица, РезервнаяКопияТаблицыАдрес, СостояниеПерехода, ИзменяетДанные) Экспорт
	
	ИзменяетДанные = ?(ИзменяетДанные = Неопределено, Ложь, ИзменяетДанные);
	Если СостояниеПерехода = 1 Тогда
		СделатьРезервнуюКопиюТаблицы(Форма, Таблица, РезервнаяКопияТаблицыАдрес);
	ИначеЕсли СостояниеПерехода = 0 И НЕ ИзменяетДанные Тогда
		ВосстановитьТаблицуИзРезервнойКопии(Таблица, РезервнаяКопияТаблицыАдрес);
	КонецЕсли;
	
	Если СостояниеПерехода = 1 Тогда
		Если Таблица.Количество()>0 И Таблица[0].Свойство("Пометка") Тогда
			//При открытии устанавливаем пометки
			Для каждого стр Из Таблица Цикл
				стр.Пометка = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

// Помещает таблицу во временное хранилище.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - Форма, в которой происходит групповое изменение строк ТЧ.
//  Таблица  - ДанныеФормыКоллекция - ТЧ, которую требуется поместить во временное хранилище.
//  РезервнаяКопияТаблицыАдрес - Строка - Вернет адрес таблицы во временном хранилище.
//
Процедура СделатьРезервнуюКопиюТаблицы(ЭтаФорма, Таблица, РезервнаяКопияТаблицыАдрес) Экспорт
	
	РезервнаяКопияТаблицыАдрес = ПоместитьВоВременноеХранилище(Таблица.Выгрузить(), ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

// Полностью заменяет текущую таблицу таблицей из временного хранилища.
//
// Параметры:
//  Таблица  - ДанныеФормыКоллекция - ТЧ, которую требуется заменить таблицей во временном хранилище.
//  РезервнаяКопияТаблицыАдрес - Строка - Адрес таблицы во временном хранилище.
//
Процедура ВосстановитьТаблицуИзРезервнойКопии(Таблица, РезервнаяКопияТаблицыАдрес) Экспорт
	
	Таблица.Загрузить(ПолучитьИзВременногоХранилища(РезервнаяКопияТаблицыАдрес));
	
КонецПроцедуры

// Производит групповое изменение строк ТЧ.
//
// Параметры:
//  ЭтаФорма       - УправляемаяФорма - Форма, в которой происходит групповое изменение строк ТЧ.
//  Таблица        - ДанныеФормыКоллекция - ТЧ, над которой производится групповое изменение строк.
//  Действие       - ПеречислениеСсылка.ДействияГрупповогоИзмененияСтрок - Выбранное действие для группового изменения строк.
//  ОбъектДействия - Строка - Имя реквизита ТЧ объекта, над которым производятся изменения.
//  Значение       - ПроизвольноеЗначение - Значение, которое используется для изменения значений колонки ТЧ при групповом изменении строк.
//
Процедура ОбработатьТаблицу(ЭтаФорма, Таблица, Действие, ОбъектДействия, Значение, ИмяЭлементаНоменклатура, ПараметрыОтбора = Неопределено) Экспорт
	
	Если Действие <> Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента
		И Действие <> Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки
		И Действие <> Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСкидкуСуммой
		И Таблица.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru='Не выбрана ни одна строка.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
		
		Для каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.Свойство("Цена") Тогда
				Строка.Цена = Строка.Цена * (100 + Значение) / 100;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦены") Тогда
		
		Для каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.Свойство("Цена") Тогда
				Строка.Цена = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду") Тогда
		
		Для каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанные = Новый Структура();
			
			СтруктураДанные.Вставить("ДатаОбработки",	ЭтаФорма.Объект.Дата);
			СтруктураДанные.Вставить("Номенклатура",	Строка.Номенклатура);
			СтруктураДанные.Вставить("Характеристика",	Строка.Характеристика);
			СтруктураДанные.Вставить("Коэффициент",		1);
			СтруктураДанные.Вставить("ВалютаДокумента", ЭтаФорма.Объект.ВалютаДокумента);
			СтруктураДанные.Вставить("ВидЦен", 			Значение);
			
			Если Строка.Свойство("Цена") Тогда
				Строка.Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
		
		Для каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.Свойство("Цена") Тогда
				Строка.Цена = УправлениеНебольшойФирмойСервер.ОкруглитьЦену(Строка.Цена, Значение, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
		
		Для каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.Свойство("Сумма") Тогда
				Строка.Сумма = УправлениеНебольшойФирмойСервер.ОкруглитьЦену(Строка.Сумма, Значение, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки") Тогда
		
		Для каждого Строка Из Таблица Цикл
			
			Если ПараметрыОтбора <> Неопределено Тогда
				ЭтоПодходящаяСтрока = УправлениеНебольшойФирмойКлиентСервер.ОбъектСоответствуетПараметрамОтбора(Строка, ПараметрыОтбора);
				Если НЕ ЭтоПодходящаяСтрока Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если Строка.Свойство("ПроцентСкидкиНаценки") Тогда
				Строка.ПроцентСкидкиНаценки = Значение;
			КонецЕсли;
			Если Строка.Свойство("Пометка") Тогда
				Строка.Пометка = Истина;
			КонецЕсли;

		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСкидкуСуммой") Тогда
		
		РаспределитьСуммуНаСкидки(Таблица, "Сумма", Значение, ПараметрыОтбора);
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
		
		Если Значение <> Неопределено Тогда
			РаспределитьСуммуПоКолонке(Таблица, "Количество", Значение);
		КонецЕсли;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
		
		Если Значение <> Неопределено Тогда
			РаспределитьСуммуПоКолонке(Таблица, "Сумма", Значение);
		КонецЕсли;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.Свойство("СтавкаНДС") Тогда
				Строка.СтавкаНДС = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		// Оставим пометки только у добавленных из документа.
		Для Каждого Строка Из Таблица Цикл
			Строка.Пометка = Ложь;
		КонецЦикла;
		
		Если ТипЗнч(Значение) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			ИмяТЧИсточник = "РаботыИУслуги";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			ИмяТЧИсточник = "Продукция";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ИнвентаризацияЗапасов") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ОприходованиеЗапасов") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.СборкаЗапасов") Тогда
			ИмяТЧИсточник = "Продукция";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.СписаниеЗапасов") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.СчетНаОплату") Тогда
			ИмяТЧИсточник = "Запасы";
		ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			ИмяТЧИсточник = "Запасы";
		КонецЕсли;
		
		ДопустимыеТипыНоменклатуры = Новый Массив;
		
		ЭлементНоменклатура = ЭтаФорма.Элементы[ИмяЭлементаНоменклатура];
		ПараметрыВыбораНоменклатуры = ЭлементНоменклатура.ПараметрыВыбора;
		Для Каждого ПараметрВыбора Из ПараметрыВыбораНоменклатуры Цикл
			
			Если ПараметрВыбора.Имя <> "Отбор.ТипНоменклатуры" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ПараметрВыбора.Значение) = Тип("ФиксированныйМассив")
				ИЛИ ТипЗнч(ПараметрВыбора.Значение) = Тип("ФиксированныйМассив") Тогда
				
				Для каждого ЗначениеОтбора Из ПараметрВыбора.Значение Цикл
					ДопустимыеТипыНоменклатуры.Добавить(ЗначениеОтбора);
				КонецЦикла;
			Иначе
				ДопустимыеТипыНоменклатуры.Добавить(ПараметрВыбора.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначенияНовойСтроки = Новый Структура("Номенклатура,Количество");
		
		Для Каждого Строка Из Значение[ИмяТЧИсточник] Цикл
			
			Если ТипЗнч(Строка.Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДопустимыеТипыНоменклатуры.Найти(Строка.Номенклатура.ТипНоменклатуры) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначенияНовойСтроки.Номенклатура = Неопределено;
			ЗначенияНовойСтроки.Количество = Неопределено;
			
			ЗаполнитьЗначенияСвойств(ЗначенияНовойСтроки, Строка);
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Пометка = Истина;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияНовойСтроки);
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки") Тогда
		
		ПомеченныеСтроки = Таблица.НайтиСтроки(Новый Структура("Пометка", Истина));
		
		Для Каждого Строка Из ПомеченныеСтроки Цикл
			
			Таблица.Удалить(Строка);
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПокупателя")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуОтгрузки")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПоступления")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПокупателя")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуРеализации")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьДатуПланирования")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьИсходноеМесто")
		ИЛИ Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьНовоеМесто") Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Строка[ОбъектДействия] = Значение;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСклад") Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Строка[ОбъектДействия] = Значение;
			
			Если Не Строка.Свойство("Ячейка") ИЛИ Не ЗначениеЗаполнено(Строка.Ячейка) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Ячейка, "Владелец") <> Значение Тогда
				Строка.Ячейка = Справочники.Ячейки.ПустаяСсылка();
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЯчейку") Тогда
		
		Для Каждого Строка Из Таблица Цикл
			
			Если НЕ Строка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.СтруктурнаяЕдиница <> Значение.Владелец Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Ячейка = Значение;
			
		КонецЦикла;
		
	ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ЗаполнитьСерийныеНомера") Тогда
		
		Если ИмяЭлементаНоменклатура = "ПродукцияНоменклатура" Тогда
			РаботаССерийнымиНомерами.ЗаполнитьСерийныеНомераВНаличии(ЭтаФорма.Объект, "Продукция");
		Иначе
			РаботаССерийнымиНомерами.ЗаполнитьСерийныеНомераВНаличии(ЭтаФорма.Объект);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Распределяет сумму по колонке таблицы.
Процедура РаспределитьСуммуПоКолонке(Таблица, ИмяКолонки, СуммаРаспределения)
	
	Если СуммаРаспределения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитаем общую помеченных позиций
	ОбщаяСумма = 0;
	Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщаяСумма = ОбщаяСумма + СтрокаТабличнойЧасти[ИмяКолонки];
	КонецЦикла;
	
	Если ОбщаяСумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Теперь распределяем
	СтрокаМаксимальнойСуммы = Неопределено; // На эту строку будем относить остаток после распределения (ошибки округления)
	МаксимальнаяСумма       = 0; // Значение максимальной суммы.
	НепогашеннаяСумма       = СуммаРаспределения;
	
	Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда
			Продолжить;
		КонецЕсли;
			
		ТекущаяСумма = СтрокаТабличнойЧасти.Сумма;
		Дельта       = СуммаРаспределения * СтрокаТабличнойЧасти[ИмяКолонки] / ОбщаяСумма;
		
		// Если Дельта по модулю оказалась больше, чем осталось погасить
		Если Дельта < 0 Тогда
			Дельта = Макс(НепогашеннаяСумма, Дельта)
		Иначе
			Дельта = Мин(НепогашеннаяСумма, Дельта)
		КонецЕсли;
		
		// Проверим текущую сумму на максимум.
		Если ТекущаяСумма > МаксимальнаяСумма Тогда
			МаксимальнаяСумма       = ТекущаяСумма;
			СтрокаМаксимальнойСуммы = СтрокаТабличнойЧасти;
		КонецЕсли;
		
		// Учеличиваем значение
		СтрокаТабличнойЧасти.Сумма = ТекущаяСумма + Дельта;
		
		// Остаток нераспределенной суммы надо уменьшать на дельту реального изменения
		НепогашеннаяСумма = НепогашеннаяСумма - (СтрокаТабличнойЧасти.Сумма - ТекущаяСумма);
		
	КонецЦикла;
	
	// Если что-то осталось, кидаем на строку с максимальной суммой.
	Если НепогашеннаяСумма > 0 И СтрокаМаксимальнойСуммы <> Неопределено Тогда
		СтрокаМаксимальнойСуммы.Сумма = СтрокаМаксимальнойСуммы.Сумма + НепогашеннаяСумма;
	КонецЕсли;
	
КонецПроцедуры

// Распределяет сумму по колонке таблицы.
Процедура РаспределитьСуммуНаСкидки(Таблица, ИмяКолонки, СуммаРаспределения, ПараметрыОтбора = Неопределено)
	
	// Посчитаем общую сумму помеченных позиций
	ОбщаяСумма = 0;
	Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
		
		Если ПараметрыОтбора <> Неопределено Тогда
			Если НЕ УправлениеНебольшойФирмойКлиентСервер.ОбъектСоответствуетПараметрамОтбора(СтрокаТабличнойЧасти, ПараметрыОтбора) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Таблица) = Тип("ДокументТабличнаяЧасть.ЗаказПокупателя.Запасы")
			ИЛИ ТипЗнч(Таблица) = Тип("ДокументТабличнаяЧасть.РасходнаяНакладная.Запасы") Тогда
			ОбщаяСумма = ОбщаяСумма + СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
		Иначе
			ОбщаяСумма = ОбщаяСумма + СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество 
				* ?(СтрокаТабличнойЧасти.Свойство("Кратность"), СтрокаТабличнойЧасти.Кратность, 1) 
				* ?(СтрокаТабличнойЧасти.Свойство("Коэффициент"), СтрокаТабличнойЧасти.Коэффициент, 1);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбщаяСумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроцентСкидки = СуммаРаспределения / ОбщаяСумма * 100;
	
	ОбщаяСуммаСкидки = 0;
	ОбщаяСуммаБезСкидок = 0;
	ПоследняяСтрока = Неопределено;
	Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
		
		Если ПараметрыОтбора <> Неопределено Тогда
			Если НЕ УправлениеНебольшойФирмойКлиентСервер.ОбъектСоответствуетПараметрамОтбора(СтрокаТабличнойЧасти, ПараметрыОтбора) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = ПроцентСкидки;
		Если ТипЗнч(Таблица) = Тип("ДокументТабличнаяЧасть.ЗаказПокупателя.Запасы")
			ИЛИ ТипЗнч(Таблица) = Тип("ДокументТабличнаяЧасть.РасходнаяНакладная.Запасы") Тогда
			СуммаСтрокиБезСкидок = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
			СуммаСкидкиНаценки = СуммаСтрокиБезСкидок * ПроцентСкидки / 100;
			СтрокаТабличнойЧасти.СуммаСкидкиНаценки = СуммаСкидкиНаценки;
		Иначе
			СуммаСтрокиБезСкидок = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество 
				* ?(СтрокаТабличнойЧасти.Свойство("Кратность"), СтрокаТабличнойЧасти.Кратность, 1) 
				* ?(СтрокаТабличнойЧасти.Свойство("Коэффициент"), СтрокаТабличнойЧасти.Коэффициент, 1);
			СуммаСкидкиНаценки = СуммаСтрокиБезСкидок * ПроцентСкидки / 100;
			Если СтрокаТабличнойЧасти.Свойство("СуммаСкидкиНаценки") Тогда
				СтрокаТабличнойЧасти.СуммаСкидкиНаценки = СуммаСкидкиНаценки;
			КонецЕсли;
			СтрокаТабличнойЧасти.Пометка = Истина;
		КонецЕсли;
		СтрокаТабличнойЧасти.Сумма = СуммаСтрокиБезСкидок - СуммаСкидкиНаценки;
		
		ОбщаяСуммаСкидки = ОбщаяСуммаСкидки + СуммаСкидкиНаценки;
		ПоследняяСтрока = СтрокаТабличнойЧасти;
		
	КонецЦикла;
	
	ИтогСуммаСкидкиНаценки = 0;
	Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
		Если ПараметрыОтбора <> Неопределено Тогда
			Если НЕ УправлениеНебольшойФирмойКлиентСервер.ОбъектСоответствуетПараметрамОтбора(СтрокаТабличнойЧасти, ПараметрыОтбора) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ИтогСуммаСкидкиНаценки = ИтогСуммаСкидкиНаценки + СтрокаТабличнойЧасти.СуммаСкидкиНаценки;
	КонецЦикла;
	
	НепогашеннаяСумма = СуммаРаспределения - ИтогСуммаСкидкиНаценки;
	Если ПоследняяСтрока <> Неопределено И НепогашеннаяСумма <> 0 Тогда
		Если ТипЗнч(Таблица) = Тип("ДокументТабличнаяЧасть.ЗаказПокупателя.Запасы")
			ИЛИ ТипЗнч(Таблица) = Тип("ДокументТабличнаяЧасть.РасходнаяНакладная.Запасы") Тогда
			СуммаСтрокиБезСкидки = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
			ПоследняяСтрока.ПроцентСкидкиНаценки = (СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество 
				* СтрокаТабличнойЧасти.ПроцентСкидкиНаценки/100 
				+ НепогашеннаяСумма) / СуммаСтрокиБезСкидки * 100;
		Иначе
			СуммаСтрокиБезСкидки = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество 
				* ?(СтрокаТабличнойЧасти.Свойство("Кратность"), СтрокаТабличнойЧасти.Кратность, 1) 
				* ?(СтрокаТабличнойЧасти.Свойство("Коэффициент"), СтрокаТабличнойЧасти.Коэффициент, 1);
			ПоследняяСтрока.ПроцентСкидкиНаценки = (СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество 
				* ?(СтрокаТабличнойЧасти.Свойство("Кратность"), СтрокаТабличнойЧасти.Кратность, 1) 
				* ?(СтрокаТабличнойЧасти.Свойство("Коэффициент"), СтрокаТабличнойЧасти.Коэффициент, 1) 
				* СтрокаТабличнойЧасти.ПроцентСкидкиНаценки/100 
				+ НепогашеннаяСумма) / СуммаСтрокиБезСкидки * 100;
		КонецЕсли;
		
		ПоследняяСтрока.СуммаСкидкиНаценки = ПоследняяСтрока.СуммаСкидкиНаценки + НепогашеннаяСумма;
		СтрокаТабличнойЧасти.Сумма = СуммаСтрокиБезСкидок - ПоследняяСтрока.СуммаСкидкиНаценки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора(НаборЭлементов) Экспорт
	
	Если НаборЭлементов.КолонкаОбъектИзменений <> Неопределено Тогда
		НаборЭлементов.ЗначениеЭлемент.СвязиПараметровВыбора = НаборЭлементов.КолонкаОбъектИзменений.СвязиПараметровВыбора;
	Иначе
		НаборЭлементов.ЗначениеЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
