#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Сотрудники.Итог("СуммаПлатежа");
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПерсоналомОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ВЫБОР
		|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс / &Кратность КАК ЧИСЛО(15, 2))
		|		КОНЕЦ) КАК СуммаПлатежа,
		|	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСПерсоналом.Остатки(
		|			,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И Валюта = &ВалютаРасчетов
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		|ГДЕ
		|	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПерсоналомОстатки.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'При выплате аванса заполнение по остаткам не предусмотрено!'");
 		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет табличную часть Сотрудники по подразделению.
//
Процедура ЗаполнитьПоПодразделениюНаСервере() Экспорт
	
	// Сотрудники:
	// 1. Уволенные, переведенные из 
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 2. Работающие.
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 3. Принятые на работу, переведенные в
	//  - в течении периода будет запись с указанным подразделением;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"
	// Пункты 1 и 2
	|Выбрать РАЗРЕШЕННЫЕ
	|	Максимум(СотрудникиСрезПоследних.Период) КАК Период
	|	,СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|Поместить СотрудникиЧислящиесяНаНачалоПериода
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&ПериодРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
	|Где СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|Сгруппировать по СотрудникиСрезПоследних.Сотрудник, СотрудникиСрезПоследних.СтруктурнаяЕдиница
	|
	// Пункт 3
	|;Выбрать РАЗРЕШЕННЫЕ
	|	Сотрудники.Период КАК Период
	|	,Сотрудники.Сотрудник КАК Сотрудник
	|Поместить СотрудникиПереведенныеПринятыеВПериоде
	|Из РегистрСведений.Сотрудники КАК Сотрудники
	|Где Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Период МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|
	// Результирующая выборка
	|;Выбрать РАЗРЕШЕННЫЕ
	|	СотрудникиЧислящиесяНаНачалоПериода.Сотрудник
	|Из СотрудникиЧислящиесяНаНачалоПериода КАК СотрудникиЧислящиесяНаНачалоПериода
	|
	|Объединить
	|
	|Выбрать 
	|	СотрудникиПереведенныеПринятыеВПериоде.Сотрудник
	|Из СотрудникиПереведенныеПринятыеВПериоде КАК СотрудникиПереведенныеПринятыеВПериоде";

	Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация",		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли