
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокРеквизитов(Параметры.НастройкиВыгрузкиРеквизитов);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокРеквизитов(НастройкиВыгрузкиРеквизитов)
	
	Если ЗначениеЗаполнено(НастройкиВыгрузкиРеквизитов) Тогда
		СписокВыбранныхРеквизитов = ОбменССайтом.ЧтениеJSONВСтруктуру(НастройкиВыгрузкиРеквизитов, Ложь);
	Иначе
		СписокВыбранныхРеквизитов = Новый Структура;
	КонецЕсли;
	
	Для каждого рекв Из Метаданные.Справочники.Номенклатура.Реквизиты Цикл
		
		СвойстваРеквизитаСписка = Неопределено;
		ЕстьРеквизит = СписокВыбранныхРеквизитов.Свойство(рекв.Имя, СвойстваРеквизитаСписка);
		
		Если ЕстьРеквизит Тогда
			ПредставлениеРеквизита = ?(ЗначениеЗаполнено(СвойстваРеквизитаСписка), СвойстваРеквизитаСписка, рекв.Имя);
			НовСтр = СписокРеквизитов.Добавить();
			НовСтр.Значение = рекв.Имя;
			НовСтр.Представление = ПредставлениеРеквизита;
			НовСтр.Пометка = Истина;
			//СписокРеквизитов.Добавить(рекв.Имя, ПредставлениеРеквизита, Истина);
		Иначе
			//СписокРеквизитов.Добавить(рекв.Имя, рекв.Имя, Ложь);
			НовСтр = СписокРеквизитов.Добавить();
			НовСтр.Значение = рекв.Имя;
			НовСтр.Представление = рекв.Имя;
			НовСтр.Пометка = Ложь;

		КонецЕсли;
		
	КонецЦикла;
	
	СортироватьПоПометке();
	
КонецФункции

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВыбранныеРеквизиты = Новый Структура;
	
	Для каждого реквизит Из СписокРеквизитов Цикл
		
		Если реквизит.Пометка Тогда
			ВыбранныеРеквизиты.Вставить(реквизит.Значение, реквизит.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(ВыбранныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРеквизитовПриИзменении(Элемент)
	
	СортироватьПоПометке();
	
КонецПроцедуры

Процедура СортироватьПоПометке()
	
	ТЗРеквизитов = РеквизитФормыВЗначение("СписокРеквизитов");
	ТЗРеквизитов.Сортировать("Пометка Убыв, Значение Возр");
	
	ЗначениеВРеквизитФормы(ТЗРеквизитов, "СписокРеквизитов");
	
КонецПроцедуры

