///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С ПРОВЕРКОЙ ДАННЫХ НА КЛИЕНТЕ И СЕРВЕРЕ


// Создает описание структур входных параметров обработки провери
// данных согласно спецификации (Обработка.ПроверкаДанных.МодульОбъекта)
//
// Возвращает:
//		Структура (ВходнойПереход,ВыходнойПереход,ПараметрыРаботы)
//
Функция ПолучитьОписаниеСтруктурПараметровПроверкиДанных(Организация) Экспорт
	
	#Если Сервер Тогда
		Дата = ТекущаяДатаСеанса();
	#Иначе
		Дата = ТекущаяДата();
	#КонецЕсли
	ВозвращаяемаяСтруктура = Новый Структура(
		"ВходнойПереход, ВыходнойПереход, ПараметрыРаботы",
		Новый Структура,
		Новый Структура,
		Новый Структура);
	
	ВозвращаяемаяСтруктура.ВходнойПереход = Новый Структура(
		"ИмяПерехода,НавигационныйПереход,Адресация,Параметры",
		"",
		Ложь,
		"",
		Новый Структура);
	
	ВозвращаяемаяСтруктура.ВыходнойПереход = Новый Структура(
		"ИмяПерехода,НавигационныйПереход,Адресация,Параметры,РазрешитьПереходПриОшибках",
		"",
		Ложь,
		"",
		Новый Структура,
		Ложь);
	
	ВозвращаяемаяСтруктура.ПараметрыРаботы = Новый Структура(
		"Организация,СобытиеКПроверке,ПараметрыКонтроля,ПериодПроизвольногоКонтроля",
		Организация,
		Неопределено,
		Новый Структура(
			"СведенияПоОрганизации,
			|ПараметрыУчета,
			|БанковскиеСчета,
			|НачальныеОстатки,
			|ОтрицательныеДенежныеОстаткиБанк,
			|ОтрицательныеДенежныеОстаткиКасса,
			|ОтрицательныеСкладскиеОстатки,
			|ВзаиморасчетыСКонтрагентами,
			|ПериодыРаботыСотрудников,
			|ВзаиморасчетыССотрудниками,
			|КонтрольПроведенных,
			|СведенияПоСотрудникам,
			|КонтрольПроведенных,
			|ЗаполнениеПоказателейЕНВД,
			|НаличиеПоказателейЕНВД,
			|ТарифыСтраховыхВзносов,
			|КорректностьЗаполненияВидовДеятельностиЕНВД,
			|КонтрольДокументовИзУНФ,
			|ТорговыеТочкиРозничнойПродажиАлкоголя,
			|СведенияПоТорговымТочкам",
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь),
		Новый Структура(
			"ДатаНачала,ДатаОкончания",
			Дата(1,1,1),
			Дата));
	
	Возврат ВозвращаяемаяСтруктура;
	
КонецФункции

// Функция проверяет корректность Кода ОКВЭД
Функция КодОКВЭДСоответствуетТребованиям(Знач ОКВЭД) Экспорт
	
	ОКВЭД = СокрЛП(ОКВЭД);
	Для Инд = 1 По СтрДлина(ОКВЭД) Цикл
		ТекСимв = Сред(ОКВЭД, Инд, 1);
		Если ТекСимв >= "0" И ТекСимв <= "8" Тогда
			ОКВЭД = Лев(ОКВЭД, Инд - 1) + "9" + Сред(ОКВЭД, Инд + 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОКВЭД = "99" ИЛИ ОКВЭД = "99.9" ИЛИ ОКВЭД = "99.99" ИЛИ ОКВЭД = "99.99.9" ИЛИ ОКВЭД = "99.99.99";
	
КонецФункции


Функция РегНомерПФРСоответствуетТребованиям(Знач РегНомерПФР) Экспорт
	РегНомерПФР = СокрЛП(РегНомерПФР);
	
	Если Не ЗначениеЗаполнено(РегНомерПФР) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(РегНомерПФР)) <> 14 Тогда
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(СокрЛП(РегНомерПФР), 1, 3))
		Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(СокрЛП(РегНомерПФР), 5, 3))
		Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(СокрЛП(РегНомерПФР), 9)) Тогда 
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

