
#Область ПрограммныйИнтерфейс

#Область СобытияФормы

Процедура ПриСозданииНаСервере(Форма, ИмяГруппыРазмещения = "", СписокКонтекстноеМеню = Неопределено) Экспорт
	
	ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения, СписокКонтекстноеМеню);
	УстановитьУсловноеОформление(Форма);
	
	Если Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации И Форма.ДанныеПанелиКонтактнойИнформации.Количество() = 0 Тогда
		ДобавитьСообщениеОбОтсутствииДанных(Форма.ДанныеПанелиКонтактнойИнформации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(Форма, Контрагент, ИмяГруппыРазмещения = "", СписокКонтекстноеМеню = Неопределено) Экспорт
	
	ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения, СписокКонтекстноеМеню);
	ОбновитьДанныеПанели(Форма, Контрагент);
	
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьДанныеПанели(Форма, ВладелецКИ) Экспорт
	
	Если НЕ Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ДанныеПанелиКонтактнойИнформации.Очистить();
	
	Если ВладелецКИ = Неопределено Тогда
		ДобавитьСообщениеОбОтсутствииДанных(Форма.ДанныеПанелиКонтактнойИнформации);
		Возврат;
	КонецЕсли;
	
	МодульМенеджераВладельцаКИ = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ВладелецКИ);
	МодульМенеджераВладельцаКИ.ЗаполнитьДанныеПанелиКонтактнаяИнформация(ВладелецКИ, Форма.ДанныеПанелиКонтактнойИнформации);
	
	Если Форма.ДанныеПанелиКонтактнойИнформации.Количество() = 0 Тогда
		ДобавитьСообщениеОбОтсутствииДанных(Форма.ДанныеПанелиКонтактнойИнформации);
	КонецЕсли;
	
КонецПроцедуры

Функция ИндексПиктограммыПоТипу(ТипКИ) Экспорт
	
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ИндексКартинки = 12;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		ИндексКартинки = 8;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
		ИндексКартинки = 9;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
		ИндексКартинки = 20;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		ИндексКартинки = 11;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ИндексКартинки = 7;
	ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
		ИндексКартинки = 10;
	Иначе
		ИндексКартинки = 0;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьРеквизитФормы(Реквизиты, Имя)
	
	Для каждого Реквизит Из Реквизиты Цикл
		Если Реквизит.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьКомандаФормы(Команды, Имя)
	
	Для каждого Команда Из Команды Цикл
		Если Команда.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПроверитьСоздатьРеквизитыПанели(Форма, ИмяГруппыРазмещения, СписокКонтекстноеМеню)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент()
		И СписокКонтекстноеМеню <> Неопределено
		И НЕ ЕстьКомандаФормы(Форма.Команды, "СписокПоказатьКонтактнуюИнформациюТекущегоОбъекта") Тогда
		
		СоздатьКонтекстнуюКомандуПросмотраКИ(Форма, СписокКонтекстноеМеню);
	КонецЕсли;
	
	Если ЕстьРеквизитФормы(Форма.ПолучитьРеквизиты(), "ЕстьТаблицаДанныеПанелиКонтактнойИнформации") Тогда
		Возврат;
	КонецЕсли;
	
	НужноСоздатьТаблицуФормы = НЕ (ОбщегоНазначения.ЭтоМобильныйКлиент() И СписокКонтекстноеМеню <> Неопределено);
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕстьТаблицаДанныеПанелиКонтактнойИнформации", Новый ОписаниеТипов("Булево")));
	
	Если НужноСоздатьТаблицуФормы Тогда
		// Создадим таблицу значений
		ИмяТаблицы = "ДанныеПанелиКонтактнойИнформации";
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Отображение", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИндексПиктограммы", Новый ОписаниеТипов("Число"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипОтображаемыхДанных", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВладелецКИ", Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.КонтактныеЛица, СправочникСсылка.Лиды, Строка"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Родитель", Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.КонтактныеЛица, СправочникСсылка.Лиды"), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредставлениеКИ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипКИ", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если НужноСоздатьТаблицуФормы Тогда
		
		// Создадим элементы
		ТаблицаФормы = Форма.Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Форма.Элементы[ИмяГруппыРазмещения]);
		ТаблицаФормы.ПутьКДанным = ИмяТаблицы;
		ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
		ТаблицаФормы.ИзменятьПорядокСтрок = Ложь;
		ТаблицаФормы.РежимВыделенияСтроки = РежимВыделенияСтрокиТаблицы.Строка;
		ТаблицаФормы.Шапка = Ложь;
		ТаблицаФормы.АвтоВводНовойСтроки = Ложь;
		ТаблицаФормы.РазрешитьНачалоПеретаскивания = Ложь;
		ТаблицаФормы.РазрешитьПеретаскивание = Ложь;
		ТаблицаФормы.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		ТаблицаФормы.ВертикальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.НеИспользовать;
		ТаблицаФормы.ГоризонтальныеЛинии = Ложь;
		ТаблицаФормы.ВертикальныеЛинии = Ложь;
		ТаблицаФормы.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		ТаблицаФормы.Высота = 10;
		ТаблицаФормы.РастягиватьПоГоризонтали = Ложь;
		Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
			ТаблицаФормы.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения;
		КонецЕсли;
		ТаблицаФормы.УстановитьДействие("Выбор",				"Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор");
		ТаблицаФормы.УстановитьДействие("ПриАктивизацииСтроки",	"Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки");
		
		Отображение = Форма.Элементы.Добавить(ИмяТаблицы + "Отображение", Тип("ПолеФормы"), ТаблицаФормы);
		Отображение.ПутьКДанным = ИмяТаблицы + ".Отображение";
		Отображение.Вид = ВидПоляФормы.ПолеНадписи;
		Отображение.РежимРедактирования = РежимРедактированияКолонки.Вход;
		Отображение.АвтоВысотаЯчейки = Истина;
		Отображение.Ширина = 23;
		
		Пиктограмма = Форма.Элементы.Добавить(ИмяТаблицы + "Пиктограмма", Тип("ПолеФормы"), ТаблицаФормы);
		Пиктограмма.ПутьКДанным = ИмяТаблицы + ".ИндексПиктограммы";
		Пиктограмма.Вид = ВидПоляФормы.ПолеКартинки;
		Пиктограмма.КартинкаЗначений = БиблиотекаКартинок.ВидыКонтактнойИнформации;
		Пиктограмма.АвтоВысотаЯчейки = Истина;
		Пиктограмма.ГиперссылкаЯчейки = Истина;
		Пиктограмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
		Пиктограмма.Ширина = 1;
		Пиктограмма.РастягиватьПоГоризонтали = Ложь;
		Пиктограмма.РастягиватьПоВертикали = Ложь;
		
		ДобавитьКомандуКонтекстногоМеню(
			Форма,
			"КонтекстноеМенюПанелиКартаЯндекс",
			НСтр("ru = 'Адрес на Яндекс.Картах'"),
			НСтр("ru = 'Показывает адрес на картах Яндекс.Карты'"),
			ТаблицаФормы.КонтекстноеМеню,
			БиблиотекаКартинок.ЯндексКарты
		);
		
		ДобавитьКомандуКонтекстногоМеню(
			Форма,
			"КонтекстноеМенюПанелиКартаGoogle",
			НСтр("ru = 'Адрес на Google Maps'"),
			НСтр("ru = 'Показывает адрес на карте Google Maps'"),
			ТаблицаФормы.КонтекстноеМеню,
			БиблиотекаКартинок.GoogleMaps
		);
		
		Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьКонтекстнуюКомандуПросмотраКИ(Форма, СписокКонтекстноеМеню)
	
	ДобавитьКомандуКонтекстногоМеню(
		Форма,
		"СписокПоказатьКонтактнуюИнформациюТекущегоОбъекта",
		НСтр("ru = 'Показать контактную информацию'"),
		"",
		Форма.Элементы[СписокКонтекстноеМеню]
	);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма)
	
	Если НЕ Форма.ЕстьТаблицаДанныеПанелиКонтактнойИнформации Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Значение контактной информации - обычный стиль, контактные лица - выделяем
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ЦветТекстаПравойПанелиОтборов;
	Оформление.Использование 	= Истина;
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Шрифт");
	Оформление.Значение 		= ШрифтыСтиля.ШрифтПравойПанелиОтборов;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформации.ТипОтображаемыхДанных");
	Отбор.ПравоеЗначение 	= "КонтактноеЛицо";
	
	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле			= Новый ПолеКомпоновкиДанных("ДанныеПанелиКонтактнойИнформацииОтображение");
	ОформляемоеПоле.Использование	= Истина;
	
КонецПроцедуры

Процедура ДобавитьСообщениеОбОтсутствииДанных(ДанныеПанелиКонтактнойИнформации)
	
	НоваяСтрока = ДанныеПанелиКонтактнойИнформации.Добавить();
	НоваяСтрока.Отображение = НСтр("ru='<Нет контактных данных>'");
	НоваяСтрока.ИндексПиктограммы = -1;
	НоваяСтрока.ТипОтображаемыхДанных = "НетДанных";
	НоваяСтрока.ВладелецКИ = Неопределено;
	
КонецПроцедуры

Процедура ДобавитьКомандуКонтекстногоМеню(Форма, ИмяКоманды, Заголовок, Подсказка, Родитель, Картинка = Неопределено)
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Заголовок = Заголовок;
		Команда.Подсказка = Подсказка;
		Команда.Действие = "Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду";
		Если Картинка <> Неопределено Тогда
			Команда.Картинка = Картинка;
		КонецЕсли;
	КонецЕсли;
	
	Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Родитель);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти
