
&НаКлиенте
Процедура Подсчитать(Команда)
	Закрыть(ДлинаНоменклатуры*ШиринаНоменклатуры*ГлубинаНоменклатуры*0.000001);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// МобильныйКлиент
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗакрыть", "Отображение", ОтображениеКнопки.Картинка);
	КонецЕсли;
	УправлениеНебольшойФирмойСервер.НастроитьВспомогательнуюФормуМобильныйКлиент(ЭтотОбъект);
	// Конец МобильныйКлиент

КонецПроцедуры
