#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидНалога");
	Результат.Добавить("Тип");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

Процедура ДополнитьВидыНачислений() Экспорт
		
		Группа = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Начисления");
		
		Если Не ЗначениеЗаполнено(Группа) или не Группа.ЭтоГруппа Тогда
			ГруппаНачисление = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
		Иначе
			ГруппаНачисление = Группа;
		КонецЕсли;
		
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Оклад по дням (график работы сотрудника)");
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по дням Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= "Оклад по дням (график работы сотрудника)";
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
			НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли;
		
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Оклад по часам (график работы сотрудника)");
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по часам Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= "Оклад по часам (график работы сотрудника)";
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
			НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли
		
	КонецПроцедуры

#КонецЕсли