#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьИсточникПривлеченияПоКИ(ЗначениеКИ, ЭтоКоллтрекинг = Ложь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтслеживаниеИсточниковПривлечения.ИсточникПривлечения КАК ИсточникПривлечения
	|ИЗ
	|	РегистрСведений.ОтслеживаниеИсточниковПривлечения КАК ОтслеживаниеИсточниковПривлечения
	|ГДЕ
	|	ОтслеживаниеИсточниковПривлечения.ЗначениеКИ ПОДОБНО &ЗначениеКИ
	|	И НЕ ОтслеживаниеИсточниковПривлечения.ИсточникПривлечения.Недействителен";
	
	Если ЭтоКоллтрекинг Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОтслеживаниеИсточниковПривлечения.ЗначениеКИ", "ОтслеживаниеИсточниковПривлечения.ЗначениеКИДляПоиска");
		ЗначениеКИ = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ЗначениеКИ);
	КонецЕсли;

	Запрос.УстановитьПараметр("ЗначениеКИ", ЗначениеКИ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИсточникПривлечения;
	КонецЦикла;
	
	Возврат Справочники.ИсточникиПривлеченияПокупателей.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
