#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.Вставить("РежимПериода", "ЗаПериод");
	НастройкиОтчета.Вставить("УровеньГруппировкиСтрок", 2);
	НастройкиОтчета.Вставить("УровеньГруппировкиКолонок", 2);
	НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета = Истина;
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	МассивПолейСумм = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("СуммаОборот,СебестоимостьОборот,СуммаСкидкиОборот,
	|Прибыль,ПроцентСкидки,СуммаБезСкидкиОборот");
	
	Для каждого ОписаниеВараинта Из НастройкиВариантов Цикл
		
		ВариантыОформления = ОписаниеВараинта.Значение.ВариантыОформления;
		ОтчетыУНФ.ДобавитьВариантыОформленияСумм(ВариантыОформления, МассивПолейСумм, КомпоновщикНастроек.Настройки);
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["ПримененныеСкидкиОценка"].Теги = НСТР("ru = 'Продажи,Скидки,Дисконт,Маркетинг'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.АктВыполненныхРабот");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ЗаказПокупателя");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ОтчетКомиссионера");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ОтчетКомитенту");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ОтчетОПереработке");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ОтчетОРозничныхПродажах");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ПриходнаяНакладная");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ЧекККМ");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.ЧекККМВозврат");
	ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["ПримененныеСкидкиОценка"].СвязанныеПоля, "Документ", "Документ.РасходнаяНакладная");
	
КонецПроцедуры

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли