
&НаСервере
Процедура УстановитьОтборы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Пользователь",	КэшЗначений.ТекущийПользователь,ВидСравненияКомпоновкиДанных.Равно, НСтр("ru ='Пользователь'"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОбъектЗагрузки",КэшЗначений.ОбъектЗагрузки,		ВидСравненияКомпоновкиДанных.Равно, НСтр("ru ='Объект загрузки'"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИмяТабличнойЧасти",КэшЗначений.ИмяТабличнойЧасти,		ВидСравненияКомпоновкиДанных.Равно, НСтр("ru ='Объект загрузки'"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ПолныйПутьОбъектЗагрузки;
	
	Если НЕ Параметры.Свойство("ОбъектЗагрузки", ПолныйПутьОбъектЗагрузки) Тогда
		
		ВызватьИсключение НСтр("ru ='Самостоятельное использование формы не предусмотрено.'");
		
	КонецЕсли;
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ВыбранныеПоля",		Неопределено);
	КэшЗначений.Вставить("ТекущийПользователь",	Пользователи.АвторизованныйПользователь());
	КэшЗначений.Вставить("ПолныйПутьОбъектЗагрузки", ПолныйПутьОбъектЗагрузки);
	
	ОписаниеОбъектаЗагрузки = ЗагрузкаДанныхИзВнешнегоИсточника.ОбъектЗагрузкиПоПолномуИмени(ПолныйПутьОбъектЗагрузки);
	КэшЗначений.Вставить("ОбъектЗагрузки",		ОписаниеОбъектаЗагрузки.ОбъектЗагрузки);
	КэшЗначений.Вставить("ИмяТабличнойЧасти",	ОписаниеОбъектаЗагрузки.ИмяТабличнойЧасти);
	
	Параметры.Свойство("ВыбранныеПоля", КэшЗначений.ВыбранныеПоля);
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВыбранныеПоля",				КэшЗначений.ВыбранныеПоля);
	ДанныеЗаполнения.Вставить("Пользователь",				КэшЗначений.ТекущийПользователь);
	ДанныеЗаполнения.Вставить("ПолныйПутьОбъектЗагрузки",	КэшЗначений.ПолныйПутьОбъектЗагрузки);
	ДанныеЗаполнения.Вставить("ОбъектЗагрузки",				КэшЗначений.ОбъектЗагрузки);
	ДанныеЗаполнения.Вставить("ИмяТабличнойЧасти",			КэшЗначений.ИмяТабличнойЧасти);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	ОткрытьФорму("Справочник.МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры
