Функция НалогообложениеЗаполненоВОбработкеЗаполнения(пОбъектСсылка, пПараметры) Экспорт
	
	НалогообложениеЗаполненоВОбработкеЗаполнения = пОбъектСсылка.Пустая()
		И (ТипЗнч(пПараметры.Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
		   ИЛИ (ТипЗнч(пПараметры.Основание) = Тип("Структура")
		   		И пПараметры.Основание.Свойство("Основание")
				И ТипЗнч(пПараметры.Основание.Основание) = Тип("ДокументСсылка.ЗаказПокупателя")));
	
	Возврат НалогообложениеЗаполненоВОбработкеЗаполнения;
	
КонецФункции