
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Патент = Параметры.Патент;
	СпециальныйНалоговыйРежим = Параметры.СпециальныйНалоговыйРежим;
	Комментарий = Параметры.Комментарий;
	Контрагент = Параметры.Контрагент;
	Ответственный = Параметры.Ответственный;
	Подразделение = Параметры.Подразделение;
	ДисконтнаяКарта = Параметры.ДисконтнаяКарта;
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	Элементы.Патент.Видимость = (СпециальныйНалоговыйРежим = Перечисления.СпециальныеНалоговыеРежимы.ПСН);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураДляВозврата = Новый Структура;
	
	СтруктураДляВозврата.Вставить("Патент", Патент);
	СтруктураДляВозврата.Вставить("СпециальныйНалоговыйРежим", СпециальныйНалоговыйРежим);
	СтруктураДляВозврата.Вставить("Комментарий", Комментарий);
	СтруктураДляВозврата.Вставить("Контрагент", Контрагент);
	СтруктураДляВозврата.Вставить("Ответственный", Ответственный);
	СтруктураДляВозврата.Вставить("Подразделение", Подразделение);
	СтруктураДляВозврата.Вставить("ДисконтнаяКарта", ДисконтнаяКарта);
	
	Закрыть(СтруктураДляВозврата);
	
КонецПроцедуры

&НаСервере
Процедура СпециальныйНалоговыйРежимПриИзмененииНаСервере()
	НастроитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СпециальныйНалоговыйРежимПриИзменении(Элемент)
	СпециальныйНалоговыйРежимПриИзмененииНаСервере();
КонецПроцедуры
