
&НаСервере
Процедура ПолучитьПараметрыЗаполнения(СтруктураЗаполнения)
	
	ЗаголовокПредставления = "";
	Если Константы.ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати.Получить() Тогда
		
		ЗаголовокПредставления = Нстр("ru = 'Договор: '");
		
	КонецЕсли;
	
	СтруктураЗаполнения.Вставить("Контрагент", СтруктураЗаполнения.Договор.Владелец);
	СтруктураЗаполнения.Вставить("Организация", СтруктураЗаполнения.Договор.Организация);
	СтруктураЗаполнения.Вставить("ОснованиеПечатиСсылка", СтруктураЗаполнения.Договор);
	СтруктураЗаполнения.Вставить("ОснованиеПечати", ЗаголовокПредставления + СтруктураЗаполнения.Договор.Наименование);
	СтруктураЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	СтруктураЗаполнения.Вставить("ЭтоГруппа", СтруктураЗаполнения.Контрагент.ЭтоГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Договор", ПараметрКоманды);
	ПолучитьПараметрыЗаполнения(СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя выбирать группу контрагентов.'");
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения));
	
КонецПроцедуры
